[
  {
    "se": "S??E??",
    "title": "Burl Ives",
    "tt": 2611404,
    "air_date": "1950-10-24",
    "description": "Faye reads some viewer mail concerning earlier episodes about Silly Putty and flying saucers. She welcomes singer/actor Burl Ives and they talk about traveling in Europe. Burl then sings some folk songs from Italy and Sweden.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Burl Ives",
        "nm": 412322,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Celeste Holm",
    "tt": 2786228,
    "air_date": "1951-01-05",
    "description": "Actress Celeste Holm visits Faye to talk about her new play Affairs of State. Holm has brought with her four members of the play's production staff - Peter Zeisler the stage manager, Sam Roseman the property manager, Tom Connell the electrician, and Bob Richardson the doorman. Each talks about his job. There is a Pepsi commercial at the beginning and end of the show.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Celeste Holm",
        "nm": 2141,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "Peter Zeisler",
        "nm": 5581375,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Tom Connell",
        "nm": 5643007,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Bob Richardson",
        "nm": 5060930,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Bob Richardson",
        "nm": 5644365,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Sam Roseman",
        "nm": 5642119,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Edith Piaf",
    "tt": 2611458,
    "air_date": "1950-11-11",
    "description": "Art Ford tells Faye about the first time he saw Edith Piaf perform in Paris in 1947. He brought Piaf's records back to the US and started playing them on his radio show. Then, Edith comes out and sings La Vie en Rose in English and French. She sits with Faye and Art and tells them about writing the song. She then sings L'accordeoniste.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Art Ford",
        "nm": 285513,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Édith Piaf",
        "nm": 681191,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Famous Artists",
    "tt": 2788132,
    "air_date": "1951-01-15",
    "description": "Faye reads a letter from Joe Hill, a World War II vet, who asks for advice on becoming an artist. She welcomes Hill to the show. He talks about how he started drawing while he was in the hospital after the war. Commercial artist Al Dorne describes the many different ways artists can earn a living such as drawing greeting cards, ads, package design, and wrapping paper to name a few. He also talks about the Famous Artists correspondence school which he helped found. Dorne critiques one of Joe's drawings and tells Joe, thanks to Faye, that he has been enrolled in the school's classes.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Joe Hill",
        "nm": 5584116,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Albert Dorne",
        "nm": 5584790,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Fencing/Douglas Fairbanks Jr",
    "tt": 2788170,
    "air_date": "1950-11-18",
    "description": "Faye welcomes Douglas Fairbanks, Jr who talks about his last film State Secret. He says it took a month just to shoot the mountain climbing sequence. They also talk about his films Prisoner of Zenga and Sinbad the Sailor as well as some of his father's films. Then they meet Marty Schneider and Bill Thomas of the New York University fencing team and watch as the two fence. Fairbanks talks about the difference between movie fencing and real fencing. He demonstrates with Schneider how to choreograph movie fencing.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Douglas Fairbanks Jr.",
        "nm": 1195,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Marty Schneider",
        "nm": 5584642,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Bill Thomas",
        "nm": 5583603,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Flanagan/Reed",
    "tt": 2611238,
    "air_date": "1950-09-26",
    "description": "Faye reads a letter from a viewer who says the Pepsi jingle is the same as an English folk song. Band leader Ralph Flanagan comes out and plays different versions of the song, John Peele, on the piano. He then introduces folk musician Susan Reed who plays and sings the folk song. Next, Ina Von Hee, a foreign exchange student, talks to Faye about her experiences in the United States so far. Faye invites her to stay in New York City as a guest of Pepsi for a few days and then come back to the show to share her impressions of the city.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Ralph Flanagan",
        "nm": 1035378,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Susan Reed",
        "nm": 4254420,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "Ina Von Hee",
        "nm": 5451384,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Flying Saucers",
    "tt": 2611280,
    "air_date": "1950-10-07",
    "description": "Faye begins the show by talking about an abandoned Air Force project investigating flying saucers. She shows illustrations by Jim Carmichael of aliens. Frank Scully talks about UFOs and claims to have talked with magnetic research scientists who found a flying saucer with dead aliens inside. He then talks about the superior maneuverability of flying saucers.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Frank Scully",
        "nm": 780272,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Frank Lloyd Wright",
    "tt": 2611406,
    "air_date": "1950-10-19",
    "description": "Faye talks with theater director Paton Price, architect Frank Lloyd Wright, and playwright Tennessee Williams about the controversy surrounding a new theater Wright designed for Hartford, CT. The four look at a model of the theater and Wright explains how he wants to bring the theater back to human scale so it's not so expensive to produce.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Paton Price",
        "nm": 697079,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Frank Lloyd Wright",
        "nm": 942394,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Tennessee Williams",
        "nm": 931783,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Frank Sinatra",
    "tt": 2785522,
    "air_date": "1951-03-09",
    "description": "The show opens with Frank Sinatra reading a letter from a viewer. He then reads a \"letter\" from Faye asking for advice on how to succeed in television. She sits next to him and tells him the only thing she can do is talk and he offers to help her learn how to sing. He then sings I've Got a Crush on You. They get up and go to the bar to have a Pepsi. Frank next gives Faye a dance lesson after claiming to have taught Gene Kelly how to dance. Afterwards, the two talk about Frank's television show, the connection fans have with TV stars and TV critics.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Frank Sinatra",
        "nm": 69,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Gielgud and Brown",
    "tt": 2659040,
    "air_date": "1951-02-09",
    "description": "Faye welcomes John Gielgud and Pamela Brown to the show. They are appearing on Broadway in the play The Lady's Not for Burning and talk about the play. Gielgud thinks comedy is harder to do than drama although there's not much difference between the two. Brown and Gielgud perform scenes from The Importance of Being Ernest and Alice in Wonderland.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Pamela Brown",
        "nm": 114386,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "John Gielgud",
        "nm": 24,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Halloween Party",
    "tt": 2611426,
    "air_date": "1950-10-31",
    "description": "Faye hosts a Halloween party. The four guests all wear masks and Faye encourages viewers to see if they can guess who they are. She talks to each guest and gives hints to help the viewers: Miss B (Joan Blondell), Mr E (Duke Ellington plays the song Sophisticated Lady on the piano), Mr G (Billy Gilbert), and Miss C (Kitty Carlisle who talks about her baby girl and sings the song Love in Bloom with Ellington). At the end of the show, everyone reveals their identities.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Joan Blondell",
        "nm": 951,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "Duke Ellington",
        "nm": 254153,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Billy Gilbert",
        "nm": 317970,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Kitty Carlisle",
        "nm": 137634,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Jimmy Cannon",
    "tt": 2611368,
    "air_date": "1950-10-17",
    "description": "New York Post columnist Jimmy Cannon tells Faye about the three months he spent in Korea covering the Korean War. Footage of the burning of Inchon is shown. Cannon tells some stories and talks about the possibility of World War Three happening.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Jimmy Cannon",
        "nm": 134211,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Let's Make Opera",
    "tt": 2611370,
    "air_date": "1950-10-10",
    "description": "Faye welcomes Peter Lawrence, co-producer of the Broadway musical Peter Pan, who talks about bringing the children's opera Let's Make Opera to the US from Great Britain. Marc Blitzstein talks about the music in the opera and introduces Jo Sullivan who performs two songs.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Peter Lawrence",
        "nm": 5451633,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Marc Blitzstein",
        "nm": 88567,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Jo Sullivan",
        "nm": 1692989,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Men's Fashions: Steve Allen",
    "tt": 2785682,
    "air_date": "1951-05-25",
    "description": "Faye reads a letter from a male viewer concerning men's clothing choices for the summer. She walks over to Steve Allen who is playing the piano. When he finishes he shows off his outfit - a t-shirt and jeans with a rope belt. They talk and then he plays and sings the song There Never Was a Woman Who Didn't Need a Man. Steve talks about his daytime show on CBS and jokes about his career. Charlie, Faye's assistant, comes out to model a coat designed by Sally Victor. Faye and Steve look at other clothes before Charlie and Bill Larkin, one of Steve's writers, show off more clothes. Steve tries on a shirt/coat and plays one last song.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Steve Allen",
        "nm": 6752,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Rockets",
    "tt": 2786264,
    "air_date": "1951-01-03",
    "description": "The show opens with a Pepsi commercial about the moon which Faye uses to introduce the topic for the show - space travel. She welcomes Robert Coles of the Hayden Planetarium and science fiction author and space travel advocate Willy Ley. The men talk about the basic concepts of space travel and then, using staged and simulated photographs of the moon from Ley's latest book, they give viewers a tour of the moon.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Robert R. Coles",
        "nm": 5583213,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Willy Ley",
        "nm": 507998,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Salvador Dali",
    "tt": 2659060,
    "air_date": "1950-11-25",
    "description": "Faye talks about the painting Madonna and Child by Salvador Dali. It will be going on exhibit in New York City on November 27. She shows jewelry designed by Dali and then welcomes him to the set. There is a copy of the painting Madonna and Child on the set and the two talk about it.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Salvador Dalí",
        "nm": 198557,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "TV Versus Movies",
    "tt": 2786190,
    "air_date": "1951-01-08",
    "description": "Faye welcomes director Otto Preminger and theater owner Harry Brandt to the show to discuss the future of motion pictures and the effect television has had on the film industry. Brandt argues that, while television may initially cut into attendance at movie theaters, the drop won't be permanent since he feels motion pictures are a higher quality form of entertainment than television. Preminger feels television, given the right circumstances and budgets, will produce quality programming.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Otto Preminger",
        "nm": 695937,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Harry Brandt",
        "nm": 1057614,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "The Weavers",
    "tt": 2659044,
    "air_date": "1950-11-16",
    "description": "Faye talks about the record Goodnight Irene, by The Weavers, selling two million records. The group sings it in the background and then finishes the song on camera. Faye talks to the group as they all have some Pepsi. They talk about how they met and became a group. They then sing the song The Roving Kind. After chatting with Faye some more, they sing Sloop John B. The group says they will be going on tour in January 1951. The show ends with Pete and Fred playing the Pepsi jingle.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Ronnie Gilbert",
        "nm": 318224,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "Lee Hays",
        "nm": 371630,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Fred Hellerman",
        "nm": 375401,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Pete Seeger",
        "nm": 781517,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Tough Guys",
    "tt": 2786200,
    "air_date": "1951-01-12",
    "description": "Faye welcomes actors Anthony Quinn, Horace McMahon, and Arnold Stang to the show. Quinn and McMahon teach Stang, who usually portrays mild mannered - even wimpy - characters how to portray a gangster. There is a Pepsi commercial at the beginning and end of the episode.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "Horace McMahon",
        "nm": 573024,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Arnold Stang",
        "nm": 822205,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "William Cimillo",
    "tt": 2785832,
    "air_date": "1950-12-05",
    "description": "Faye reads a letter from a woman asking her to talk about something fun just for the ladies. Faye shows off a pair of fancy earrings that wrap around the ear and a pair of fur shoes she is wearing. She also has something for the men - handmade handkerchiefs from France that cost $115.00 for two. Then, she shows a $1 million worth of diamonds including a ring worth $40,000-$50,000. Faye invites her guest, William Cimillo to join her for a Pepsi. In 1947, Cimillo drove his bus from New York City to Florida on the spur of the moment. He tells Faye why he did it and how he got his job back.",
    "cast": [
      {
        "name": "Faye Emerson",
        "nm": 256207,
        "roles": [
          {
            "char": "Herself - Host"
          }
        ]
      },
      {
        "name": "William Cimillo",
        "nm": 5582520,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S??E??",
    "title": "Episode dated 13 February 1950",
    "tt": 868117,
    "air_date": "1950-02-13",
    "description": null,
    "cast": [
      {
        "name": "Peggy Ann Garner",
        "nm": 307750,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "Lee Tracy",
        "nm": 870543,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  }
]
