[
  {
    "se": "S01E01",
    "title": "My Favorite Martin",
    "tt": 654536,
    "air_date": "1963-09-29",
    "description": "Reporter Tim O'Hara, while covering a flight of the Air Force X-15, finds a spaceship that contains a genuine martian. The martian is a professor who specializes in the planet Earth and now has to repair his spaceship before he can go home.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Ina Victor",
        "nm": 896112,
        "roles": [
          {
            "char": "Annabelle"
          }
        ]
      },
      {
        "name": "Ann Marshall",
        "nm": 550749,
        "roles": [
          {
            "char": "Angela Brown"
          }
        ]
      },
      {
        "name": "Herbert Rudley",
        "nm": 748822,
        "roles": [
          {
            "char": "Col. Whitehead"
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Lee Krieger",
        "nm": 471199,
        "roles": [
          {
            "char": "Radarman"
          }
        ]
      },
      {
        "name": "Marc Towers",
        "nm": 1253511,
        "roles": [
          {
            "char": "Plainclothes Man"
          }
        ]
      },
      {
        "name": "Simon Oakland",
        "nm": 643000,
        "roles": [
          {
            "char": "Lt. Murphy"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E02",
    "title": "The Matchmakers",
    "tt": 654559,
    "air_date": "1963-10-06",
    "description": "There is dual girl trouble in the O'Hara household. George, the dog who Tim is looking after for Mr. Burns, is in love with Chloe, the dog from next door. Through trying to get George and Chloe together, Tim falls for Chloe's owner, Marsha Carson. However Marsha has had some recent relationship problems of her own. Howard Loomis, her boyfriend, took off to Mexico without as much as a goodbye. Because Marsha feels betrayed by Howard, she is now overprotective of Chloe and suspicious of all men, including Tim. Tim's case is not helped by Angela, who bad mouths Tim to Marsha solely because Angela has a crush on Tim herself. From information from Chloe, Martin finds out the whereabouts of Howard, who rushes back to Los Angeles based on \"anonymous\" information provided by Martin. Howard, whose departure to Mexico was beyond his control and who tried to contact Marsha prior to his departure, clears the air with her and reignites their relationship to the point of getting engaged. This leaves Tim out in the cold. But at least all works out for George and Chloe, as Tim is given the task of sitting for Chloe while Marsha and Howard rush off to Las Vegas to get married.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Ann Marshall",
        "nm": 550749,
        "roles": [
          {
            "char": "Angela Brown"
          }
        ]
      },
      {
        "name": "Laura Shelton",
        "nm": 791359,
        "roles": [
          {
            "char": "Marsha Carson"
          }
        ]
      },
      {
        "name": "Linden Chiles",
        "nm": 157607,
        "roles": [
          {
            "char": "Howard Loomis"
          }
        ]
      },
      {
        "name": "Chloe",
        "nm": 1838683,
        "roles": [
          {
            "char": "Dog"
          }
        ]
      },
      {
        "name": "George",
        "nm": 4762016,
        "roles": [
          {
            "char": "Dog"
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns",
            "voice": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E03",
    "title": "There Is No Cure for the Common Martian",
    "tt": 654564,
    "air_date": "1963-10-13",
    "description": "Martin comes down with a common cold, which is not so common but rather debilitating for Martians. Meanwhile Tim is sent to Trimbles Department Store to review their outer space exhibit. Trimble, a major advertiser in The Sun, tries to buy and bully for a good review, despite the display showing every unfounded stereotype of life on other planets. Tim knows the display to be total fantasy. But he doesn't get a chance to write the review as he inadvertently takes one of Martin's sleep inducing cold tablets and falls asleep. To submit the review by deadline, Martin writes the review based on his own personal experience of what is true to life on Mars. Trimble is livid and wants Mr. Burns to fire Tim unless Tim apologizes and writes a retraction; Mr. Burns is willing to do so. Tim is going to do as Trimble and Burns wants if only to keep his job and keep from financial bankruptcy, but Martin doesn't want him to compromise what he knows to be right and wrong. Tim does stand up to Trimble and Trimble keeps to his threat until Trimble's usually mild mannered daughter, Gloria, takes her cue from Tim's moxie and stands up to her father about the quality of the exhibit. Trimble changes his tune as he admires the stand up quality of his daughter.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Willard Waterman",
        "nm": 914018,
        "roles": [
          {
            "char": "Mr. Trimble"
          }
        ]
      },
      {
        "name": "Sharon Farrell",
        "nm": 268331,
        "roles": [
          {
            "char": "Gloria Trimble"
          }
        ]
      },
      {
        "name": "Phil Garris",
        "nm": 308377,
        "roles": [
          {
            "char": "Delivery Boy"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E04",
    "title": "Russians R in Season",
    "tt": 654542,
    "air_date": "1963-10-20",
    "description": "Martin reads about a $2 billion American space program, a program he knows is doomed for failure. Not wanting to see the American government waste $2 billion, Tim writes himself a fake letter to the newspaper which includes Martin's nighttime musings; Tim thinks Martin's mumblings are key to the flaw in the space program. Based on the fake letter, Tim writes a newspaper story criticizing the wasted $2 billion. Tim's masquerade is uncovered by the government, agents for whom think he's a spy working for the Russians. Tim is questioned under a lie detector, and he fails miserably when it comes to questions about Martin. So the agents call in Martin, the agents who question him under the lie detector, under hypnosis, and through brainwashing. Martin overcomes each, to him, primitive method. But he can't overcome the truth serum, and he spills the beans about being a Martian. It isn't until then that the agents let Tim and Martin go. They figure that Martin is crazy and delusional, which is causing stress on Tim which in turn made him write the letter.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Richard Deacon",
        "nm": 212586,
        "roles": [
          {
            "char": "James J. Jackson"
          }
        ]
      },
      {
        "name": "Frank Aletter",
        "nm": 18173,
        "roles": [
          {
            "char": "Agent No. 2"
          }
        ]
      },
      {
        "name": "Edward Holmes",
        "nm": 391813,
        "roles": [
          {
            "char": "Agent No. 1"
          }
        ]
      },
      {
        "name": "Bryan O'Byrne",
        "nm": 639930,
        "roles": [
          {
            "char": "Dr. Weisbord"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E05",
    "title": "Man or Amoeba",
    "tt": 654516,
    "air_date": "1963-10-27",
    "description": "Renowned scientist Professor Newton Jennings posits that life no more advanced than amoebas or jellyfish can exist on Mars. Martin helps Angela write a report refuting Jennings claims, which quickly gets her a failing grade. When Martin's attempts to reason with Angela's teacher, Miss Weaver, fails, Martin figures the only way to regain the upper hand and Angela's trust is to speak to Jennings and expose him as a fraud. However Jennings is brilliant but has one minor flaw in his calculation. So Martin, with Tim's help, plants a seed in Jennings brain to correct the calculation, which Martin hopes Jennings will pick up. The brilliant professor does and restates his theory, which in turn leads to vindication for both Angela and Martin.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Ann Marshall",
        "nm": 550749,
        "roles": [
          {
            "char": "Angela Brown"
          }
        ]
      },
      {
        "name": "John Fiedler",
        "nm": 275835,
        "roles": [
          {
            "char": "Professor Jennings"
          }
        ]
      },
      {
        "name": "Betsy Jones-Moreland",
        "nm": 429506,
        "roles": [
          {
            "char": "Miss Weaver"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E06",
    "title": "The Man on the Couch",
    "tt": 654557,
    "air_date": "1963-11-03",
    "description": "To get some rarefied air, Martin goes atop a water tower. Passersby, including the police, think he's a jumper and he's promptly sent to the psychiatric ward of the hospital. Martin thinks he can quickly exit the hospital by reading the psychiatrist's mind and tell him what he wants to hear. However the psychiatrist, Dr. Harvey Bonnett, has other things on his mind, like his troubled marriage. Ultimately, Dr. Bonnett becomes the patient and Martin the doctor.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Frank Behrens",
        "nm": 67056,
        "roles": [
          {
            "char": "Dr. Bonnett"
          }
        ]
      },
      {
        "name": "Henry Beckman",
        "nm": 65798,
        "roles": [
          {
            "char": "Lt. Harland"
          }
        ]
      },
      {
        "name": "Robert Paget",
        "nm": 656442,
        "roles": [
          {
            "char": "Young Man"
          }
        ]
      },
      {
        "name": "Orangey",
        "nm": 1248838,
        "roles": [
          {
            "char": "Cat on Footpath",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E07",
    "title": "A Loaf of Bread, a Jug of Wine, and Peaches",
    "tt": 654482,
    "air_date": "1963-11-10",
    "description": "Martin allows himself to experience an emotion foreign to Martians: love at first sight. He falls hard for Peaches Ancream, that being her real given name since her father had a sense of humor. It is also an appropriate name as she is an exotic dancer. Peaches and Martin hit it off, so much so that Martin wants to marry her after their first date. Peaches admires honesty more than anything else in life, the reason that she broke up with her last boyfriend, Police Officer Thorp, who is still harboring strong feelings for Peaches. Martin decides to tell Peaches the truth about himself, which Peaches doesn't believe. When Officer Thorp confesses about the reason for his lies - he told her 6 different places where he was from since in reality he is an orphan who doesn't know - Peaches goes back to the man she feels is being more truthful.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Noam Pitlik",
        "nm": 685736,
        "roles": [
          {
            "char": "Officer Thorp"
          }
        ]
      },
      {
        "name": "Eleanor Berry",
        "nm": 1604925,
        "roles": [
          {
            "char": "Nurse"
          }
        ]
      },
      {
        "name": "Greta Randall",
        "nm": 709599,
        "roles": [
          {
            "char": "Model"
          }
        ]
      },
      {
        "name": "Kathie Browne",
        "nm": 115025,
        "roles": [
          {
            "char": "Peaches"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E08",
    "title": "The Awful Truth",
    "tt": 654549,
    "air_date": "1963-11-17",
    "description": "Tim talks Martin into temporarily giving him a Martian power. Martin decides to give him the power of levitation for a 24 hour period. When he thinks the power practically useless beyond performing mere parlor tricks, Tim asks for another, to him, more useful power: mind-reading. Martin grants him his wish, to be activated the next day and to last until midnight. Tim also uses this power for parlor tricks, which gets him into trouble. But he also wants to use it for an interview he has that afternoon with Councilman Jack Gramby. Tim wants to write a story about the Councilman's true political intentions. Tim is unable to read his mind because the Councilman is uncommitted in his political intentions, even to himself. So Tim writes a story on what he calls the mental ping-pong of the Councilman. The Councilman telephones Mr. Burns, Mr. Burns thinking that it is to sue the paper for libel. Distraught about probably losing his job, Tim goes into hiding for the rest of the day. However when Mr. Burns finds Tim just before midnight, he tells Tim that Gramby actually wanted to congratulate the paper. Reading the story made Gramby realize that he as a politician really did need to take a stand. Mr. Burns wants Tim to do such an exposé with all politicians at City Hall. Unfortunately Tim's mind-reading powers are just about to run out.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Jackie Russell",
        "nm": 751208,
        "roles": [
          {
            "char": "Daphne Joyce"
          }
        ]
      },
      {
        "name": "Dal McKennon",
        "nm": 268428,
        "roles": [
          {
            "char": "Mailman"
          }
        ]
      },
      {
        "name": "Jon Silo",
        "nm": 798151,
        "roles": [
          {
            "char": "Waiter"
          }
        ]
      },
      {
        "name": "Dee J. Thompson",
        "nm": 860050,
        "roles": [
          {
            "char": "Jean"
          }
        ]
      },
      {
        "name": "Alan Reed",
        "nm": 715284,
        "roles": [
          {
            "char": "Councilman Jack Gramby"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E09",
    "title": "Rocket to Mars",
    "tt": 654541,
    "air_date": "1963-12-01",
    "description": "When the junk men come by, they mistakenly empty Martin and Tim's garage instead of Mrs. Brown's, and in doing so take Martin's space ship. Mrs. Brown has no idea the name of the junk yard, but there was a witness to the incident: Booboo, a neighborhood dog. Booboo, with the help of his dog friends and acquaintances, helps Martin track down the junk yard. When Martin and Tim get to the junk yard, they find out that the ship has already been sold to a Mr. Carter, who is using it as a \"rocket\" carousel at a children's amusement park. Mr. Carter refuses to sell it back to Martin. So Martin decides to disappear and fly the spaceship away, although he does slip Carter the money for the ship anonymously. Martin has one other debt to pay: a steak dinner for Booboo and all his friends for all their help.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Cliff Norton",
        "nm": 636183,
        "roles": [
          {
            "char": "Mr. Carter"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Junkyard Manager"
          }
        ]
      },
      {
        "name": "Karl Lukas",
        "nm": 525523,
        "roles": [
          {
            "char": "Bruno",
            "as Karl Lucas": true
          }
        ]
      },
      {
        "name": "Tom Kennedy",
        "nm": 448366,
        "roles": [
          {
            "char": "Mike"
          }
        ]
      },
      {
        "name": "Tommy Durkin",
        "nm": 3069507,
        "roles": [
          {
            "char": "Harold"
          }
        ]
      },
      {
        "name": "Arlen Stuart",
        "nm": 835649,
        "roles": [
          {
            "char": "Harold's Mother"
          }
        ]
      },
      {
        "name": "Craig Huxley",
        "nm": 402137,
        "roles": [
          {
            "char": "Boy #2",
            "as Chris Hundley": true
          }
        ]
      },
      {
        "name": "BooBoo",
        "nm": 4900724,
        "roles": [
          {
            "char": "Dog",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E10",
    "title": "Raffles No. 2",
    "tt": 654540,
    "air_date": "1963-12-08",
    "description": "When Martin almost gets a parking ticket, Tim thinks it might be a good idea if Martin legitimizes his Earthly driving by getting a driver's license. Down at the Department of Motor Vehicles, finger-printless Martin has to do some fancy work when he is about to be finger printed. He steals the prints of another man at the DMV. Unfortunately for Martin, that print matches the only unidentified print at a major jewel robbery the previous year. In a routine cross check, the police find the print in Martin's file. And Tim covered the jewel robbery for the paper, something the police find probably more than just a coincidence. Martin and Tim find out that the police are watching them and the reason, and so Martin thinks it a good idea to flush out the jewel thief: he reads that there is a party where Mrs. Summer Winthrop will be displaying the galaxy diamond necklace around her neck, a lure too irresistible for the thief. At the party, the guests are populated predominantly by police - both in uniform and under cover - and the thief, Brian Henley, and his female accomplice, who Martin recognizes from the DMV office. Henley manages to slip the necklace off Mrs. Winthrop, slip it to his accomplice, who in turn slips it into the crown of the cap of Captain Farrow, the lead police investigator. Henley plans to steal the necklace back after the place has been unsecured, and he is no longer a suspect (he was the only person close the Mrs. Winthrop when the necklace went missing). Martin, seeing where the necklace was stashed, plans to plant it back on Henley. No matter what Henley does to get rid of the necklace Martin plants in his pocket, he is no match for Martin's levitation finger. Henley is quickly apprehended, and Martin and Tim cleared.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Howard Morton",
        "nm": 607990,
        "roles": [
          {
            "char": "Brian Henley"
          }
        ]
      },
      {
        "name": "Pamela Curran",
        "nm": 192863,
        "roles": [
          {
            "char": "Accomplice"
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Madge Blake",
        "nm": 86636,
        "roles": [
          {
            "char": "Mrs. Winthrop"
          }
        ]
      },
      {
        "name": "Norman Alden",
        "nm": 17491,
        "roles": [
          {
            "char": "Detective Harris",
            "as Norm Alden": true
          }
        ]
      },
      {
        "name": "Olan Soule",
        "nm": 815825,
        "roles": [
          {
            "char": "Motor Vehicle Clerk"
          }
        ]
      },
      {
        "name": "George Cisar",
        "nm": 149204,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "John Anderson",
        "nm": 26930,
        "roles": [
          {
            "char": "Capt. Farrow"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E11",
    "title": "The Atom Misers",
    "tt": 654548,
    "air_date": "1963-12-15",
    "description": "Martin needs the hardest substance possible to repair his spaceship, the substance he has in mind is silibalt, an alloy of silicone and cobalt but one that has not yet been invented on Earth. To make some, he needs a cyclotron. Rather than destroy Tim's kitchen making his own, he decides to follow Tim on his latest interview at the university, where there is a cyclotron. At the university, Martin meets Tim's interview subject, Donald Mumford, 13-year old physics genius, and one who is constantly at odds with the ways of Dr. Jackson, his advisor. While Martin and Donald get together to discuss and proceed with the making of silibalt, Tim is preoccupied with Dr. Jackson, who provides a diatribe against the demands of Donald, and Jeanine Carter, Dr. Jackson' pretty assistant and university protector of Donald. They are all looking for Donald and Martin when an explosion caused by some stolen electricity and wrong switch alert them to the Donald and Martin's whereabouts. Dr. Jackson immediately expels Donald, and since no long lasting physical damage was done, only banishes Martin from the university. Martin however fights back and convinces Dr. Jackson that he is quashing a genius mind, albeit one in a 13-year old body, and thus Donald must be treated differently in every respect. Doanld is welcomed back. On his own, Donald does manage to make some silibalt for Martin. Martin's only problem now is that he has no instrument hard enough to cut or mold the silibalt.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Jerome Cowan",
        "nm": 184578,
        "roles": [
          {
            "char": "Dr. Jackson"
          }
        ]
      },
      {
        "name": "Jean Hale",
        "nm": 354933,
        "roles": [
          {
            "char": "Jeanine Carter"
          }
        ]
      },
      {
        "name": "Flip Mark",
        "nm": 548240,
        "roles": [
          {
            "char": "Donald Mumford"
          }
        ]
      },
      {
        "name": "Emil Sitka",
        "nm": 803238,
        "roles": [
          {
            "char": "Workman-1"
          }
        ]
      },
      {
        "name": "Bert Conroy",
        "nm": 175794,
        "roles": [
          {
            "char": "Workman-2",
            "as Burt Conroy": true
          }
        ]
      },
      {
        "name": "Bobby Byles",
        "nm": 125932,
        "roles": [
          {
            "char": "Music Student"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E12",
    "title": "That Little Old Matchmaker, Martin",
    "tt": 654547,
    "air_date": "1963-12-22",
    "description": "Tim is pursuing who seems to be the unattainable Cynthia Parker. Through reading her mind, Martin finds out that Cynthia is passionate about the classical arts whether it be music, literature or art, and she figures Tim is not, which is the truth. However Tim becomes everything she wants in a man. However this façade Tim fears is hurting Cynthia. Rather than hurt her by telling her the truth, he decides the best option is to find her her dream man. To do so, Martin needs to read men's minds to match them up to Cynthia's. Scanning through Tim's office, they find one perfect match: Bill Fisher. As perfect as Bill would be, there is one catch: he is already seeing someone he nicknames \"Angel Face\". Peggy Collins, aka Angel Face, is however as well suited to Bill as Cynthia is to Tim. As a matter of fact, Peggy is better suited to Tim and Cynthia to Bill. At a concert that evening at which all four are scheduled to attend, Martin does a little levitation of tickets so that Bill and Cynthia sit together and Peggy and Tim sit together. Each respective pair hit it off. A month later, Bill and Cynthia get married. Things for Peggy and Tim are also going well, however Tim is a bit freaked when Peggy catches Cynthia's wedding bouquet.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Nancy Rennick",
        "nm": 719672,
        "roles": [
          {
            "char": "Cynthia Parker"
          }
        ]
      },
      {
        "name": "Robert Colbert",
        "nm": 170303,
        "roles": [
          {
            "char": "Bill Fisher"
          }
        ]
      },
      {
        "name": "Jan Moriarty",
        "nm": 605352,
        "roles": [
          {
            "char": "Peggy Collins",
            "as Jan Moriarity": true
          }
        ]
      },
      {
        "name": "Dick Patterson",
        "nm": 666191,
        "roles": [
          {
            "char": "Douglas Ginzer"
          }
        ]
      },
      {
        "name": "Nancy Howard",
        "nm": 397515,
        "roles": [
          {
            "char": "Mary Hogan"
          }
        ]
      },
      {
        "name": "Jan Burrell",
        "nm": 123068,
        "roles": [
          {
            "char": "Usher"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E13",
    "title": "How to Be a Hero Without Really Trying",
    "tt": 654510,
    "air_date": "1963-12-29",
    "description": "The O'Hara's have new neighbors, the Richmonds, within the family being young Stevie and his grown up sister Jennifer. The foursome go on a picnic to Sunset Mountain, since Martin needs to pick up some bling, an alloy located there but that has not yet been discovered by humans. Stevie has a vivid imagination and likes to pretend he's from Mars, which intrigues Martin. That's OK with Tim, as that means he can spend time with Jennifer alone. However Jennifer is concerned with Stevie's ability to discern reality from fantasy. While Martin goes off to collect his bling, Stevie plays a game of pretend and climbs up the mountain, but reality hits when he can't get down on his own. Martin suggests that Tim climb up and get Stevie as an act of heroism, but Tim is afraid of heights. Martin reassures Tim that he will be safe with the assistance of his remote control gravitation machine. Tim bounds up the mountain, but doesn't know that Martin's machine breaks while he's half way up. Tim and Stevie have a couple of close calls, which Tim thinks is Martin just trying to be dramatic. Although Tim faints when he finds out the truth about the gravitation machine, he shows that one just needs to have a little faith to accomplish mountains.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Kathy Kersh",
        "nm": 449947,
        "roles": [
          {
            "char": "Jennifer"
          }
        ]
      },
      {
        "name": "Butch Patrick",
        "nm": 665822,
        "roles": [
          {
            "char": "Stevie"
          }
        ]
      },
      {
        "name": "Richard Reeves",
        "nm": 716279,
        "roles": [
          {
            "char": "Picnicker"
          }
        ]
      },
      {
        "name": "George Cisar",
        "nm": 149204,
        "roles": [
          {
            "char": "Patrolman #1"
          }
        ]
      },
      {
        "name": "Dick Wilson",
        "nm": 933304,
        "roles": [
          {
            "char": "Patrolman #2"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E14",
    "title": "Blood Is Thicker Than the Martian",
    "tt": 654488,
    "air_date": "1964-01-05",
    "description": "Tim's cousin Harvey is coming for a visit, which means Martin is going to have to go into hiding since Harvey would know that Tim has no Uncle Martin. And they have to keep Mrs. Brown away from Harvey since she would definitely spill the beans about Martin. Living in a small apartment, Martin can only keep away from Harvey so much, even if he is in his invisible state. And the sleeping arrangements become an issue. Those are not the only problems about Harvey's visit: Harvey is the biggest mooch in the world. Harvey wants Tim to help him get a job at The Sun as Harvey sees himself as the greatest newspaper writer in the world. Tim reluctantly does get Harvey a try-out in a position at The Sun. When Harvey mentions the high stress of this new job, Martin has an idea: he comes by the apartment posing as an old hard-boiled newspaper buddy of Tim's looking for a job. He mentions that he is looking for work on a small town paper, where newspaper life is more rewarding as high stress jobs, like the one Harvey currently has on The Sun, causes one to see things. That's when Martin starts moving things with his levitation finger, causing Harvey to think he's stressed out from his new job. He quickly returns home to his old job.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Paul Smith",
        "nm": 809525,
        "roles": [
          {
            "char": "Harvey O'Hara"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E15",
    "title": "Poor Little Rich Cat",
    "tt": 654537,
    "air_date": "1964-01-12",
    "description": "The stupidest idea Martin has heard of since he's been on Earth: Rosemary Willis leaving her cat, Max, $650,000 in her will. Morton Beanbecker, the lawyer for the estate, is threatening Tim with a lawsuit if he continues to editorialize about the stupidity of the will and deceased Rosemary Willis. However, Beanbecker also mentions that Mrs. Willis wrote a subsequent will leaving her estate to a children's orphanage, that will which was either never signed or hidden. Martin reads his mind that he really wants the second will to be found despite his threatening words to Tim. Tim and Martin find out that Max's trustees are Rosemary's sister, Aggie, and Aggie's husband, Charles. As Aggie and Charles are lavishing money on Max and themselves in the process, Martin and Tim think Aggie and Charles hid the second will. However Max tells Martin himself that he is miserable with all the money, and it was he himself who hid the second will only because Rosemary did forget to sign it. Max leads Martin to the will. Beanbecker and Martin pour through legal books to find precedent to overturn the first will, without success. As Aggie says she hears from Rosemary in her sleep, they decide to hold a séance, where Rosemary - really Martin - will tell Aggie that she wants the money turned over to the orphanage. The ever obliging younger sister Aggie does as she's told.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Bernie Kopell",
        "nm": 465728,
        "roles": [
          {
            "char": "Morton Beanbecker"
          }
        ]
      },
      {
        "name": "Dub Taylor",
        "nm": 852305,
        "roles": [
          {
            "char": "Charles"
          }
        ]
      },
      {
        "name": "Moyna MacGill",
        "nm": 532256,
        "roles": [
          {
            "char": "Aggie"
          }
        ]
      },
      {
        "name": "Orangey",
        "nm": 1248838,
        "roles": [
          {
            "char": "Max the Cat",
            "as Rhubarb": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E16",
    "title": "RX for a Martian",
    "tt": 654539,
    "air_date": "1964-01-19",
    "description": "Martin can make it back to Mars since Mars has deviated from its regular orbit temporarily and is thus closer to Earth than usual. Martin has a 10 hour window of opportunity. Just as he is about ready to leave, he slips down the stairs and sprains his ankle, which also sprains his disappearing antenna. Mrs. Brown immediately calls an ambulance to the scene. When the ambulance physician takes Martin's vital signs, they rush him to the hospital since his vital signs aren't \"human\". The intern at the hospital has the same reaction. Martin knows that to get them to discharge him from the hospital, he needs to appear humanly normal and thus does everything he can to have normal human vital signs. He passes that test, but when the doctor requires a fluoroscope, Martin is worried since the gamma rays from which will make him explode. Tim manages to take the fluoroscope for Martin, but the doctors keep Martin in the hospital to figure out why the fluoroscope shows that he has the body of a 20-year old. With one hour to spare, Martin regains the use of his disappearing antenna and manages to escape from the hospital. Just as he is ready to leave Earth for the second time, Martin slips down the stairs once again and sprains his other ankle. Nothing can help him this time and he misses his opportunity to get home to Mars. But Martin surmises that home is where you hang your hat, and that just happens to be Earth for the time being.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Yale Summers",
        "nm": 838823,
        "roles": [
          {
            "char": "Intern"
          }
        ]
      },
      {
        "name": "Bill Zuckert",
        "nm": 958451,
        "roles": [
          {
            "char": "Doctor Rothman"
          }
        ]
      },
      {
        "name": "Ray Kellogg",
        "nm": 1107853,
        "roles": [
          {
            "char": "Driver"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E17",
    "title": "Going, Going, Gone",
    "tt": 654501,
    "air_date": "1964-02-02",
    "description": "Something is causing Martin's metabolism to go haywire. In succession, he loses control of his levitation finger, he magnetizes his clothing, he levitates, he becomes electrically charged, he shrinks and then he disappears. He finds out the cause is an increased activity of sunspots, and on Earth there is no way to control their effects on Martians. After five days, the sunspots are still occurring and Martin is still invisible. The authorities, based on a recent insurance policy Mrs. Brown sold Martin with Tim as beneficiary, suspect that Martin's \"disappearance\" is due to Tim killing him for the insurance money. Circumstantial evidence points in that direction. Martin can't let Tim go to jail for this, and Martin decides to tell the authorities the truth about his Martian identity. Just then, the sunspots cease and Martin reappears, just in time to save Tim and protect his own identity.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Robert P. Lieb",
        "nm": 509294,
        "roles": [
          {
            "char": "Lieut. Gibson",
            "as Robert Lieb": true
          }
        ]
      },
      {
        "name": "Henry Beckman",
        "nm": 65798,
        "roles": [
          {
            "char": "Ass't D.A. Ronald Bradley"
          }
        ]
      },
      {
        "name": "Jonathan Hole",
        "nm": 354949,
        "roles": [
          {
            "char": "William Stone"
          }
        ]
      },
      {
        "name": "David Bond",
        "nm": 20200,
        "roles": [
          {
            "char": "Dr. Orville Laird"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E18",
    "title": "Who Am I?",
    "tt": 654579,
    "air_date": "1964-02-09",
    "description": "Martin and Tim are on their way to interview Professor Eugene Downey, the foremost expert on rocket fuel - Martin thinks the professor can assist in getting him back to Mars - when Martin is hit on the head with a monkey wrench. Martin gets amnesia from this concussion. He has no idea that he's a Martian, despite Tim telling him so. The only thing Martin and Tim can agree on is that Martin needs to go see a doctor. At Dr. Gilbert's office, Martin does learn that he has the power of levitation and the ability to disappear, still not quite believing why. The doctor, who witnesses the levitation, is told it's all magic. Back at the apartment, Tim almost has Martin convinced of his true identity when Martin is once again struck on the head, this time by a hammer. That's all he needed as he regains his memory. It's too late however: Professor Downey has already left town for good.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Michael Fox",
        "nm": 289147,
        "roles": [
          {
            "char": "Doctor Gilbert"
          }
        ]
      },
      {
        "name": "Sally Carter-Ihnat",
        "nm": 141804,
        "roles": [
          {
            "char": "Nurse",
            "as Sally Carter": true
          }
        ]
      },
      {
        "name": "Erin O'Donnell",
        "nm": 640754,
        "roles": [
          {
            "char": "Coed"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E19",
    "title": "Now You See It, Now You Don't",
    "tt": 654531,
    "air_date": "1964-02-16",
    "description": "At the museum, Martin discovers that the long-time curator, Wilbur Canfield, is very unhappy. He has just acquired a new expensive Egyptian piece for the museum, but the museum's board is questioning the authenticity and therefore merit of this acquisition. Because of this, Canfield himself is now questioning his own abilities, as he feels he may be getting too old to do his work properly. The board is calling in an independent expert, Pietro Donati. What's worse, Canfield once discredited Donati's evaluation. Martin will know the piece's authenticity, if he can only get a look at it. In doing so, Tim can get an exclusive story and Martin can validate Canfield as an expert in the field. But the artifact is stashed away behind security until Donati's arrival. Since Martin can't get close to it, he decides instead to levitate it to him. After Martin finds that it is indeed authentic, he has to get it back to the museum. However security is aware that it's missing and thus the museum is secured even more than usual while they try to locate the artifact. After some tricky maneuvering, Martin does manage to get it back into place, although to the bewilderment of security. However, Martin forgot to check for the mark of Ra, which definitely identifies the artifact as authentic. When Donati arrives to inspect the piece, he deems it to be a fake since the mark of Ra is not there. However Martin tells him to look a little more closely under the couple thousand years of residue. The mark is indeed there. Therefore it ends well for Canfield and Donati. The only person with an unhappy ending is Tim - his exclusive story was so good, Mr. Burns appoints him editor of culture, which is not exactly his cup of tea.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Cecil Kellaway",
        "nm": 445523,
        "roles": [
          {
            "char": "Wilbur Canfield"
          }
        ]
      },
      {
        "name": "John Qualen",
        "nm": 702798,
        "roles": [
          {
            "char": "Matt"
          }
        ]
      },
      {
        "name": "Harry Lauter",
        "nm": 491591,
        "roles": [
          {
            "char": "John"
          }
        ]
      },
      {
        "name": "Maurice Marsac",
        "nm": 550342,
        "roles": [
          {
            "char": "Donati"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E20",
    "title": "My Nephew the Artist",
    "tt": 654526,
    "air_date": "1964-02-23",
    "description": "Martin wants to help Tim with the household expenses, and without a money earning activity, decides to sell art he's currently painting to relive boredom. Martin can paint in the style of any famous artist. Mr. Green of the Green Gallery notices Martin's first piece is just like a Van Gogh, and eagerly takes and sells it. As such, Mr. Green commissions Martin to paint some more and they sell as quickly as Martin gets them to the gallery. Mr. Green wants to have a showing of Martin's work. When Tim mentions that this might not be a good idea as it may raise questions about Martin himself, Martin offers Tim up as the true artist of the paintings. At the show, Mr. Bentley, the art expert brought in the evaluate the show, is skeptical that Tim painted all the paintings, since they are all in different styles. Mr. Green suggests that Tim provide a real life demonstration of his painting process. Martin assures Tim that with his help, he can indeed paint. However, when Tim's demonstration is supposed to start, Martin has an allergic reaction which is affecting his Tim-assisting painting finger. Martin has to find out what he's allergic to and get rid of the item. Tim is nervously on his own until Martin finds the allergy inducing source. Martin discovers the source is a corsage worn by Mrs. Bentley. Martin manages to get rid of the corsage, and Tim, with Martin's help, proceeds with his painting demonstration to great fanfare. Mr. Bentley deems Tim a major art talent. However Martin announces that Tim has given up on emulating the masters, and will strike out as an artist on his own merit and own style. As such, Tim is a failure. Tim's art career is over, much to his relief.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Richard Deacon",
        "nm": 212586,
        "roles": [
          {
            "char": "Mr. Bentley"
          }
        ]
      },
      {
        "name": "Cyril Delevanti",
        "nm": 216819,
        "roles": [
          {
            "char": "Mr. Green"
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Hazel Shermet",
        "nm": 792619,
        "roles": [
          {
            "char": "Bargaining Woman"
          }
        ]
      },
      {
        "name": "Cathleen Cordell",
        "nm": 179451,
        "roles": [
          {
            "char": "Mrs. Bentley"
          }
        ]
      },
      {
        "name": "Carol Worthington",
        "nm": 941753,
        "roles": [
          {
            "char": "Miss Kane"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E21",
    "title": "Hitch-Hiker to Mars",
    "tt": 654506,
    "air_date": "1964-03-01",
    "description": "The Inter-Galaxy Corporation is launching a rocket to either Mars or Venus. Martin needs to convince them to choose Mars, so that he can stowaway and get home. J.M. Buckley, Inter-Galaxy's President, is an indecisive man, but is highly superstitious and makes many decisions on these superstitions. He is leaning toward sending the rocket to Mars, but two things are distracting him from making the announcement of such: it's Friday the 13th, and he's missing his lucky rabbit's foot. Martin overcomes the date superstition by making Buckley think that Friday the 13th is the luckiest day on the calendar. The missing rabbit's foot on the other hand Martin and Tim need to find. They locate it, but in cat-chewed state. Martin realizes that many rabbit's feet look similar and he uses his powers to recreate it to its original visual state. That's all Buckley needs to make the announcement to send the rocket to Mars, the launch to take place in two days. To thank the corporation, Martin suggests adding a magnetic oscilloscope, an invaluable piece of equipment for the mission, to the rocket. This act of kindness on Martin's part is also his error: with the addition of the oscilloscope, there is no more room for a stowaway.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Herbert Rudley",
        "nm": 748822,
        "roles": [
          {
            "char": "J.M. Buckley"
          }
        ]
      },
      {
        "name": "Alice Backes",
        "nm": 45651,
        "roles": [
          {
            "char": "Miss Maxwell"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Waiter"
          }
        ]
      },
      {
        "name": "Lillian Culver",
        "nm": 191737,
        "roles": [
          {
            "char": "Woman"
          }
        ]
      },
      {
        "name": "Orangey",
        "nm": 1248838,
        "roles": [
          {
            "char": "Herbie",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E22",
    "title": "Uncle Martin's Broadcast",
    "tt": 654573,
    "air_date": "1964-03-08",
    "description": "Tim discovers that Martin's antennae act just like Earthly antennae: he can pick up radio and television signals among other things. Tim decides that while Martin's asleep, he's going to tune into the police frequency for a newspaper scoop. He hears about a robbery, and follows up with a telephone call to the police to find out more information. However the police decide to pick up both Tim and Martin since Tim had just a little too much information, information that only the police or the perpetrators of the crime would know about. Detective Sergeant Seeley, the lead investigator, thinks Tim is committing crimes so that he can report on them. Seeley can keep Tim and Martin in custody for 48 hours without charging them. Martin decides that this is just a little too risky since he has no real Earthly identity, such as a fingerprint, and thus decides to break out of jail, leaving Tim behind. Tim is scared, but Martin goes to the scene of the crime to see if he can figure out who the real criminals are. He picks up clues that lead to Jim and Harry, two lowlifes at a waterfront bar. However reading their minds, Martin ascertains that there was a third party involved, that person being Seeley, who needed a major case to boost his career. Martin returns to the police station and makes a confession, that confession being exactly what Seeley is thinking. Seeley buckles under the pressure and confesses. One would think that Tim would learn from this experience, but later tries once again to turn on Radio Martin while Martin's asleep. However Martin is a little brighter and has locked his radio while he's asleep.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Don Haggerty",
        "nm": 353628,
        "roles": [
          {
            "char": "Sgt. Seeley"
          }
        ]
      },
      {
        "name": "Dick Wilson",
        "nm": 933304,
        "roles": [
          {
            "char": "Charlie"
          }
        ]
      },
      {
        "name": "Paul Sorensen",
        "nm": 814897,
        "roles": [
          {
            "char": "Jim"
          }
        ]
      },
      {
        "name": "Lane Bradford",
        "nm": 103048,
        "roles": [
          {
            "char": "Harry"
          }
        ]
      },
      {
        "name": "Roger Creed",
        "nm": 187220,
        "roles": [
          {
            "char": "Guard"
          }
        ]
      },
      {
        "name": "Len Felber",
        "nm": 270890,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E23",
    "title": "An Old, Old Friend of the Family",
    "tt": 654486,
    "air_date": "1964-03-15",
    "description": "After Martin makes Tim miss a deadline, Martin decides to help Tim get an exclusive interview. Jakobar, the rogue leader of Kobima, is the story's subject matter. Martin is a legend in Kobima and has inside knowledge of Kobiman legend since he was good friends with Jakobar's great-grandfather Kobima, for who the country was named. After displaying the sign of Cocobahn - Martin's name in Kobiman - Jakobar agrees to see Martin. Martin talks Jakobar into making himself accessible to the media, namely Tim, but later reneges since he still has the suspicious mind of an outlaw leader. Martin needs to convince Jakobar to be a more forthright leader for the betterment of Kobima, which will perish as a country otherwise, this strategy which again includes being accessible to the media. Because of Martin's sage advice, Jakobar muses that Martin may actually be Cocobahn.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Charles Maxwell",
        "nm": 561673,
        "roles": [
          {
            "char": "Jakobar"
          }
        ]
      },
      {
        "name": "Henry Corden",
        "nm": 179478,
        "roles": [
          {
            "char": "East Indian"
          }
        ]
      },
      {
        "name": "Bart Conrad",
        "nm": 175609,
        "roles": [
          {
            "char": "Guard #1"
          }
        ]
      },
      {
        "name": "Joseph V. Perry",
        "nm": 675129,
        "roles": [
          {
            "char": "Guard #2",
            "as Joseph Perry": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E24",
    "title": "Super Dooper Snooper",
    "tt": 654545,
    "air_date": "1964-03-22",
    "description": "Mrs. Brown is taking a course on how to be a private detective, and her first assignment is to prepare a dossier on an unsuspecting person. Her choice of subject is Martin. Of course, Martin knows what she's up to, but he is still a bit concerned about her discovering his Martian identity. Mrs. Brown finds Martin's flight log, which is written in Martian, but again Martin is concerned since the uneducated are too dense to know any better. She takes a photograph of it, which Martin is worried she will pass onto authorities, who, when they are unable to decipher it, will suspect him of being a foreign spy. She apparently has mailed the film to her teacher, J. Nathaniel Pierce, who is more shyster than teacher. Martin needs to apprehend the film before Pierce gets a hold of it. At Pierce's office, Martin searches to no avail, and must endure a sales job by Pierce before he finds out that the mailman can't and won't deliver Mrs. Brown's film since she failed to put postage on the package. From there, it's a an easy task of levitation for Martin to get the film and ultimately protect his identity. For Mrs. Brown's own safety, Martin tries to talk her out of taking the course since she will be facing brutish criminals. She heeds his advice: instead of quitting the course however, she decides to protect herself by also taking judo lessons.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Cliff Norton",
        "nm": 636183,
        "roles": [
          {
            "char": "J. Nathaniel Pierce"
          }
        ]
      },
      {
        "name": "Dennis Robertson",
        "nm": 731805,
        "roles": [
          {
            "char": "Charlie"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E25",
    "title": "The Sinkable Mrs. Brown",
    "tt": 654562,
    "air_date": "1964-04-05",
    "description": "Pete Dudley, a real estate salesman, convinces Mrs. Brown that she should sell her ramshackle of a house, which causes a problem for Tim and Martin, especially in hiding the spaceship. Dudley already has prospective buyers, Edgar and Emily Graham, who would be especially interested in the garage since Mr. Graham wants to make it into a workshop. When the Graham's show up unexpectedly for their first visit, Martin has to hide the spaceship. The only thing he can do is to levitate it with his levitation finger, which even for Martin is difficult due to the ship's large size. They manage to hide the ship long enough for the Graham's visit. Dudley makes Mrs. Brown sign a contract for a $100 advance in commission. After doing so, Mrs. Brown is having second thoughts about selling the house. Martin decides the best avenue to take would be to show the Grahams and Dudley just how ramshackle of a house it is, which he does of course with a little help of his Martian powers. As such, Dudley not only loses the sale, but the Grahams as clients. Martin also gets Mrs. Brown's $100 back for her. And as for Dudley, he decides to leave the real estate game due to some frayed nerves.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Allan Melvin",
        "nm": 578510,
        "roles": [
          {
            "char": "Pete Dudley"
          }
        ]
      },
      {
        "name": "George Dunn",
        "nm": 242574,
        "roles": [
          {
            "char": "Mr. Graham"
          }
        ]
      },
      {
        "name": "Elvia Allman",
        "nm": 21519,
        "roles": [
          {
            "char": "Mrs. Graham"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E26",
    "title": "Martin and the Eternal Triangle",
    "tt": 654520,
    "air_date": "1964-04-12",
    "description": "Martin finds himself involved in a romantic love triangle.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Albert Carrier",
        "nm": 140390,
        "roles": [
          {
            "char": "Andre Dupre"
          }
        ]
      },
      {
        "name": "Maya Van Horn",
        "nm": 887186,
        "roles": [
          {
            "char": "Francine Resnay"
          }
        ]
      },
      {
        "name": "Walter Janovitz",
        "nm": 417907,
        "roles": [
          {
            "char": "Lazlo",
            "as Walter Janowitz": true
          }
        ]
      },
      {
        "name": "LaWana Backer",
        "nm": 2099859,
        "roles": [
          {
            "char": "Salesgirl"
          }
        ]
      },
      {
        "name": "Dovima",
        "nm": 235579,
        "roles": [
          {
            "char": "Model",
            "as Dovima Horan": true
          }
        ]
      },
      {
        "name": "Susan Wedell",
        "nm": 917168,
        "roles": [
          {
            "char": "Model Charlotte Higgins"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E27",
    "title": "Danger! High Voltage",
    "tt": 654491,
    "air_date": "1964-04-19",
    "description": "Martin needs to electrically charge himself for his trip back to Mars. However he overcharges himself. He needs to rid himself of the excess electricity, and when he initially tries to discharge it, he blacks out half of Los Angeles. Martin is facing two problems. First, if he is overcharged for an extended period of time, he will exhibit unusual symptoms such as a plaid designed face. A current symptom is his continual sneezing which is causing electrical switches to turn on. And second, the power company is narrowing the source of the blackout to the O'Hara's neighborhood, and have called in the police to investigate the malicious tampering with the power grid. Martin figures the best course of action to discharge the electricity in a hurry is to do it direct at the source: the power house. In his invisible state, Martin hitches ride in the power truck that's come to investigate their neighborhood. After distracting the power man on duty, Martin manages to discharge his excess electricity safely back into the system. But once again, he's missed his opportunity to get back to Mars.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Milton Frome",
        "nm": 296330,
        "roles": [
          {
            "char": "Logan"
          }
        ]
      },
      {
        "name": "Henry Gibson",
        "nm": 2099,
        "roles": [
          {
            "char": "Homer P. Gibson",
            "in credits Olsen Gibson": true
          }
        ]
      },
      {
        "name": "Lee Krieger",
        "nm": 471199,
        "roles": [
          {
            "char": "Officer Walker"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E28",
    "title": "If You Can't Lick 'Em",
    "tt": 654513,
    "air_date": "1964-04-26",
    "description": "Martin is stressed out because neighborhood kid, Horace, won't leave him alone to work on his spaceship. The stress has caused Martin's antennae to be stuck in its up position which in addition causes him to lose his Martian powers. With Horace fast approaching, Martin has nowhere to hide, so fashions a pair of antennae for Tim to wear. As such, Horace will think they're just playing. Horace also wants to play Martian and goes out and buys a pair of antennae. This starts a nation-wide fad of boys playing Martian wearing antennae. A newsmagazine wants to interview Martin, its inventor, and Mr. Barnaby, the person who manufactured Horace's antennae, wants to patent the toy. This publicity will cause problems for Martin in hiding his identity. He solves his first problem, the stuck antennae, with a simple hiccup, which reconnects his short circuit. To solve the publicity problem, Martin figures he has to create a new fad to replace the antennae craze, one that is unpatentable. He does when he designs the nose-mobile, which is made simply of a clothespin, elastic band and some propellers. As with the antennae, Horace thinks the nose-mobile is a toy worth playing with and the new fad is started.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Dennis Rush",
        "nm": 750659,
        "roles": [
          {
            "char": "Horace"
          }
        ]
      },
      {
        "name": "Hal Smith",
        "nm": 808401,
        "roles": [
          {
            "char": "Barnaby"
          }
        ]
      },
      {
        "name": "Irwin Charone",
        "nm": 153407,
        "roles": [
          {
            "char": "Smight"
          }
        ]
      },
      {
        "name": "Danny Krieger",
        "nm": 2106032,
        "roles": [
          {
            "char": "Gloucester"
          }
        ]
      },
      {
        "name": "Jim McCall",
        "nm": 2114244,
        "roles": [
          {
            "char": "Fatso"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E29",
    "title": "Unidentified Flying Uncle Martin",
    "tt": 654574,
    "air_date": "1964-05-03",
    "description": "Martin needs to fly his space ship, which is deteriorating due to inertia. Tim's fear is realized: Martin's flight is spotted as a UFO. Martin needs to take another flight, but Mrs. Brown calls in the authorities - Jack and Jim being their representatives - who use Tim and Martin's apartment as a sighting station. Martin uses the opportunity to take his second flight since Jack and Jim have equipment - a plutron counter - that would be able to locate the space ship parked in the garage. The plutron counter does go off, but Martin slips some plutron into Mrs. Brown's apron pocket, making the plutron counter point in Mrs. Brown's direction. Jack and Jim think the machine has gone haywire. During Jim and Jack's kafuffle with Mrs. Brown, Martin slips away. While in flight, Tim further distracts Jack and Jim with a spoon dangling outside on their tree, which through Jack and Jim's telescope will look like a flying saucer. Martin takes his flight undetected and gets back to the apartment safe and sound. To further protect himself, Martin exposes Tim as the perpetrator of the flying saucer hoax - all in the name of getting a news story - with the spoon on the string as his proof of his claim.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "James T. Callahan",
        "nm": 130210,
        "roles": [
          {
            "char": "Jack",
            "as James Callahan": true
          }
        ]
      },
      {
        "name": "Don Keefer",
        "nm": 444411,
        "roles": [
          {
            "char": "Jim"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E30",
    "title": "How You Gonna Keep Them Down on the Pharmacy?",
    "tt": 654509,
    "air_date": "1964-05-10",
    "description": "The Earthly environment is causing a vitamin deficiency in Martin. He draws on energy and vitamins from everything and everyone around him. The effect on things is for them to go haywire. And if people look him in the eyes, they will fall asleep since they are sapped of their energy. Martin needs some vitamins immediately or else he will grow weaker and weaker to the point of no return. Luckily, the vitamins he needs can be found at any pharmacy, however by prescription. Also it's Sunday and all the stores are closed. But Tim convinces his good friend, Doc Mullen, to open his pharmacy. Martin's plan is that he will try and get the necessary vitamins while Tim distracts Doc Mullen. It does the trick and Martin starts on the course of his vitamins. However, Martin's illness is contagious and Tim gets it, which in turn causes Mrs. Brown, Doc Mullen and then Martin to fall asleep, with no more vitamins from Martin's stash to use. Thus Tim has to wake them all up without Tim or Martin in particular not to look at each other, as that will cause them both to fall asleep forever. With a lot of effort, Tim and Martin manage to do it as well as get the necessary refill of vitamins from Doc Mullen. Although Martin manages to get re-energized by the concoction, he is over-energized due to a higher than required dose, which in turn causes everyone else around him to feel over-energized. This can be cured by a good old everyday nap.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Herbie Faye",
        "nm": 269667,
        "roles": [
          {
            "char": "Doc Mullen"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E31",
    "title": "Miss Jekyll and Hyde",
    "tt": 654525,
    "air_date": "1964-05-17",
    "description": "Mrs. Brown's niece, Paula Clayfield, comes for visit. A former child prodigy, Paula has always relied on her brains to mask insecurities in her personal appearance. Despite her Plain Jane looks, Paula does have a boyfriend, Dr. Edgar Edgarton (her intellectual equal), with whom she has an \"understanding\" - they have a commitment to each other shy of a formal engagement. Paula notices Martin's sketches for a space ship, and insists on helping him to refine his design. Later, she also notices in Martin's possession a piece of a Martian alloy (something not available on Earth) to which she states she cannot identify its contents. These probings of course hinder Martin's progress in fixing his space ship as well as his hiding his Martian identity, so Martin asks a reluctant Tim to ask her out to keep her otherwise occupied. After Paula and Tim's first \"date\", Paula confides to Martin that Tim seems disinterested, which is indeed the case. So to get Tim to ask Paula out again, Martin transforms her into a ravishing beauty without her knowledge. This transformation does the trick on Tim, who continues to take Paula out and eventually asks her to marry him, which convinces her that she can be and is beautiful. Edgar comes for a visit, and after some time he notices the transformation in her appearance, which solidifies their commitment to each other. In the meantime, Paula has accidentally taken Martin's alloy, which she and Edgar are going to get tested. Martin's Martian identity would then be exposed, that is unless Martin and Tim can get the alloy back beforehand.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Marlo Thomas",
        "nm": 5486,
        "roles": [
          {
            "char": "Paula"
          }
        ]
      },
      {
        "name": "Tom Skerritt",
        "nm": 643,
        "roles": [
          {
            "char": "Edgar"
          }
        ]
      },
      {
        "name": "Peter Brooks",
        "nm": 112193,
        "roles": [
          {
            "char": "Young Man"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E32",
    "title": "Who's Got the Power?",
    "tt": 654581,
    "air_date": "1964-05-24",
    "description": "During an electrical storm, Martin gets an affliction called popsy, which causes him to appear and disappear uncontrollably. With Tim's help, Martin needs to long ground himself electrically to cure the popsy. Just as he does so, Mrs. Brown drops by and accidentally completes the grounding. In doing so, she gets Martin's levitation power. Martin temporarily fixes the symptom of appearing and disappearing by a concoction of household cleaners. But that is only in a need to get his levitation powers back from Mrs. Brown, which requires an electrically charged transfer. With much maneuvering and wiring and some hand holding (to control Mrs. Brown's levitation, but which she construes as Martin being affectionate with her), Martin manages to do the transfer successfully. After that, Martin and Tim need to try the grounding procedure once again. Just as they are about to do it, Mrs. Brown comes by once again, which Martin and Tim think will cause the transfer of the levitation power all over again. But Mrs. Brown fakes them out - this time, she doesn't cause a problem, and Martin's popsy is finally cured.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Justin Smith",
        "nm": 808864,
        "roles": [
          {
            "char": "Stanley"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E33",
    "title": "Oh, My Aching Antenna",
    "tt": 654532,
    "air_date": "1964-05-31",
    "description": "Martin finds that he is prematurely aging due to the increased gravity on Earth compared to Mars. Thus he goes through some anti-gravity therapy, which in turn causes havoc for those around him.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Jay Sheffield",
        "nm": 790782,
        "roles": [
          {
            "char": "Ezel"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E34",
    "title": "The Disastro-Nauts",
    "tt": 654551,
    "air_date": "1964-06-07",
    "description": "Martin convinces Tim to use his connections as a reporter to get Martin a tryout as the astronaut for a Mars destined rocket, privately financed by Omar M. Keck. Despite a slew of younger stereotypical astronaut types vying for the job, Martin's obvious advantages as a Martian get him the job. Before Martin is ready to leave, he allows Tim to prepare a story of his uncle \"The Martian\" for publication after Martin is on his way. On his way to the air force base with Martin, Tim leaves the tape of the story on Mr. Burns' desk - based on his usual schedule, Mr. Burns should arrive at the office after Martin and the rocket are safely in space. However the launch of the rocket is delayed, leaving Tim and Martin to rush back to the office to retrieve the tape. They rush back to base to watch the launch happen without Martin in the rocket. At least the launch was picture perfect!",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Alan Hale Jr.",
        "nm": 1308,
        "roles": [
          {
            "char": "Omar M. Keck",
            "as Alan Hale": true
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Buck Taylor",
        "nm": 852076,
        "roles": [
          {
            "char": "Bruce Baker"
          }
        ]
      },
      {
        "name": "Michael Barrier",
        "nm": 56922,
        "roles": [
          {
            "char": "Walt"
          }
        ]
      },
      {
        "name": "Frank De Vol",
        "nm": 6030,
        "roles": [
          {
            "char": "Prof. Crenshaw",
            "as Frank DeVol": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E35",
    "title": "Shake Well and Don't Use",
    "tt": 654543,
    "air_date": "1964-06-14",
    "description": "Tim and Mr. Burns' nephew, Freddie Carson, are in the running for promotion to journeyman reporter at the newspaper. After finding out that Mr. Burns is a gourmet, Martin decides that a way to swing the tide in Tim's favor is to cook Mr. Burns a special meal, one which includes some special Martian condiments. The Martian ingredients however react with the Earth ingredients to cause Mr. Burns to move in slow motion. The effect of the antidote Martin has on hand has the opposite effect of speeding up Mr. Burns' movements. Meanwhile, Freddie arrives on the scene to take Mr. Burns to the airport to meet a newspaper bigwig. Tim and Martin hide Mr. Burns in his catatonic state in the bedroom while Martin works on figuring out the correct antidote to cure Mr. Burns. Freddie, unaware that his uncle is there, shoots himself in the foot in the quest for what he feels is the sure promotion for himself with some disparaging remarks about a certain uncle.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Kip King",
        "nm": 454966,
        "roles": [
          {
            "char": "Freddie Carson"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E36",
    "title": "A Nose for News",
    "tt": 654485,
    "air_date": "1964-06-21",
    "description": "Tim gets mad at Martin for \"disappearing and spying\" on him while he has a date at the apartment. To make up for this, Martin covers for Tim when he goes missing from the office and Mr. Burns calls the apartment looking for him. Martin goes on the story in his place and phones back to Mr. Burns with an exclusive using Tim's voice. Unfortunately, Mr. Burns sees Tim in the office when he is also on the talking to him on the phone; Tim confesses that it is Martin on the phone covering for him. Also unfortunately, the exclusive is regarding an old friend of Mr. Burns', Ambassodor Lloyd Thomas, who decides to sue the paper for invasion of privacy because of the story. Martin finds out that the suit is in part due to some old animosity between Mr. Burns and Ambassador Thomas, and thus Martin decides to try and mend some old wounds.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Mr. Harry Burns"
          }
        ]
      },
      {
        "name": "Sheila Bromley",
        "nm": 111355,
        "roles": [
          {
            "char": "Mrs. Thomas"
          }
        ]
      },
      {
        "name": "Maggie Pierce",
        "nm": 682423,
        "roles": [
          {
            "char": "Linda"
          }
        ]
      },
      {
        "name": "David White",
        "nm": 924668,
        "roles": [
          {
            "char": "Lloyd Thomas"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E37",
    "title": "Uncle Martin's Wisdom Tooth",
    "tt": 654571,
    "air_date": "1964-06-28",
    "description": "A toothache of his \"eye\" tooth causes \"eye\" problems for Martin: he can't see. Tim takes him to see his dentist, although Martin doesn't have typical human teeth. He needs dental expertise and some dental powder without the dentist actually examining him, which is why dentist-phobic Tim takes the place in the dental chair. The remedy causes Martin's eye teeth to go crossed eyed, as does his vision. The only answer is tooth extraction.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Lennie Weinrib",
        "nm": 918396,
        "roles": [
          {
            "char": "Dr. Herbie Little"
          }
        ]
      },
      {
        "name": "Francine York",
        "nm": 948696,
        "roles": [
          {
            "char": "Nurse Norma"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E01",
    "title": "Dreaming Can Make It So",
    "tt": 654496,
    "air_date": "1964-09-27",
    "description": "Martin dreams in 2D: in form but not in substance. By changing her famous brownies to low fat, Mrs. Brown inadvertently changes Martin's constitution as Martians are affected by polyunsaturates; basically she has poisoned him. So his dreams change from being 2D to 3D, and they also don't go away. One of his materializations is a piece of Martian seismonitricite, an explosive. Once Martin finds out what Mrs. Brown did, he tries to detoxify himself before they all get blown to smithereens.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Lillian Buyeff",
        "nm": 4029,
        "roles": [
          {
            "char": "Maggie"
          }
        ]
      },
      {
        "name": "Beatriz Monteil",
        "nm": 599158,
        "roles": [
          {
            "char": "Dancer",
            "as Beatrice Monteil": true
          }
        ]
      },
      {
        "name": "Sandra Lynn",
        "nm": 528797,
        "roles": [
          {
            "char": "Dancer"
          }
        ]
      },
      {
        "name": "Barbara McCall",
        "nm": 2124839,
        "roles": [
          {
            "char": "Dancer"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E02",
    "title": "The Memory Pill",
    "tt": 654560,
    "air_date": "1964-10-04",
    "description": "After Tim shows how overly cluttered his mind is, Martin tells him of the Martian way of storing unneeded memories in an electronic memory box. The box produces a pill, which when swallowed, brings back the memory. Without Martin's supervision, Tim uses the memory box to store away memories of Martin, who he no longer recognizes. When Martin does some Martian trickery, Tim is afraid of this unknown Martian in his midst. He accuses Martin of being a Martian in front of Mrs. Brown, which makes Mrs. Brown think Tim is sick. So she calls in a doctor to examine Tim. In some confusion between the memory pills and some tranquilizers, everyone swallows the wrong pills, so that the doctor and Mrs. Brown obtain some Martian memories. Now all that needs to be done to set everyone straight is to point the memory box in the right direction and to get the right beings to swallow the right pills.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "David White",
        "nm": 924668,
        "roles": [
          {
            "char": "Dr. Nichols"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E03",
    "title": "Three to Make Ready",
    "tt": 654565,
    "air_date": "1964-10-11",
    "description": "Martin creates a neuro cerebral stimulator to help him make up his mind about whether to go home in an unmanned rocket, or continue to stay on Earth with his new family, Tim. A lightning strike to the stimulator causes Martin to split into three: two decisive Martins on either extreme and an indecisive Martin. Once all three Martins come to a consensus on any issue, they will rejoin. While the three Martins talk, Tim tries to hide at least two of the Martins from Mrs. Brown and Mrs. Brown's doctor, who is called in after one of the Martin's hits his head. As the countdown to the rocket launch nears, Tim has to drive the three Martins to the base, however three physically identical Martins is a bit conspicuous. So Tim hides the Martins in a trunk and some bags, the bodies which are seen by the doctor, who calls in the police. Luckily for Tim, the three Martins join together before the police find the three bodies. Unluckily for Martin, the rocket launches before he makes up his mind.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Jan Arvan",
        "nm": 38066,
        "roles": [
          {
            "char": "Doctor Nelson"
          }
        ]
      },
      {
        "name": "Sheldon Allman",
        "nm": 21532,
        "roles": [
          {
            "char": "Patrolman Culbreth"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E04",
    "title": "Nothing But the Truth",
    "tt": 654530,
    "air_date": "1964-10-18",
    "description": "Dulcy, Henry and Stanley - Mrs. Browns' sister and her husband and son - come for a visit. Henry is a computer hardware expert and as such believes that everything has a scientific explanation. Stanley is a typical boy with a vivid imagination, which Henry, with a heavy hand, tries to suppress. Stanley sees Martin's spaceship entering the garage, which he wildly exclaims to his father, who chastises him for making up lies. In Henry's mind, there are no such things as space ships or Martians. Martin feels guilty since Stanley was only telling the truth. To get Henry to be less rigid in his thought, Martin does some unexplainable trickery in Henry's view. Henry then has a better understanding of his son's way of thinking.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Don Keefer",
        "nm": 444411,
        "roles": [
          {
            "char": "Henry"
          }
        ]
      },
      {
        "name": "Rory Stevens",
        "nm": 828747,
        "roles": [
          {
            "char": "Stanley"
          }
        ]
      },
      {
        "name": "Yvonne White",
        "nm": 925616,
        "roles": [
          {
            "char": "Dulcy"
          }
        ]
      },
      {
        "name": "Stafford Repp",
        "nm": 720106,
        "roles": [
          {
            "char": "Police Sergeant"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E05",
    "title": "Dial M for Martin",
    "tt": 654492,
    "air_date": "1964-10-25",
    "description": "While fixing Mrs. Brown's TV antenna, Tim accidentally cuts a live telephone wire which hits Martin, in turn turning him into a live telephone. Martin has to figure out how to disconnect himself back to normal before Mrs. Brown and Det. Brennan (who was called in to find Mrs. Brown's pocketbook) stop buying their explanations for the telephone ringing and mysterious voices. But before he does, Martin and Tim overhear on Martin's telephone a plot to steal the Vandeleer diamond. Now how to pass on the information to Det. Brennan without telling from where the information came.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Edward Colmans",
        "nm": 172909,
        "roles": [
          {
            "char": "Mr. Blackstone"
          }
        ]
      },
      {
        "name": "Lee Krieger",
        "nm": 471199,
        "roles": [
          {
            "char": "Ted"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E06",
    "title": "Extra! Extra! Sensory Perception!",
    "tt": 654498,
    "air_date": "1964-11-01",
    "description": "Tim is working on a series of stories on extra-sensory perception. Martin fears that if he meets the subject of Tim's story, Professor Hammerschlag, the professor will perceive Martin's true identity. When Tim unavoidably brings the professor back the apartment, Martin needs to hide his sensory perception so that the professor can't perceive his thoughts. Unfortunately in the process, Mrs. Brown gets Martin's sensory perception, which in a human causes regression all the way back to babyhood and beyond. The only way for Mrs. Brown to get rid of it is to sneeze it out of her body. To help Mrs. Brown, Martin uses his Martian powers in front of the professor, risking exposure of his identity.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Leonid Kinskey",
        "nm": 455893,
        "roles": [
          {
            "char": "Professor Hammershlag"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E07",
    "title": "My Uncle the Folk Singer",
    "tt": 654528,
    "air_date": "1964-11-08",
    "description": "Martin has been internally recording Earth music for a couple hundred years, and can call up any song within his internal library. At a folk music club, Martin drinks a cappuccino containing cinnamon to which he reacts. It turns on his recorder playback, and a folk song spews out of him. His \"singing\" is a hit with the club patrons. The club is owned by Tim's current flame, Della, who tries to persuade Tim to persuade Martin to sing at the club to help the business. Martin reluctantly agrees. However the fame and adulation quickly go to Martin's head. To snap Martin out of this earthly emotion, Tim tries to break Martin's playback function with a large dose of cinnamon, even if this hurts Della's business. The cinnamon does the trick with the playback mechanism as well as Martin's sensibilities. However they now have to try and fix the playback so that Martin can sing one last time to keep Della's business from going under.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Pat Priest",
        "nm": 697344,
        "roles": [
          {
            "char": "Della Darwell"
          }
        ]
      },
      {
        "name": "Stan Ross",
        "nm": 743829,
        "roles": [
          {
            "char": "Folk Singer"
          }
        ]
      },
      {
        "name": "James Joyce",
        "nm": 431540,
        "roles": [
          {
            "char": "Folk Singer"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E08",
    "title": "The Great Brain Robbery",
    "tt": 654553,
    "air_date": "1964-11-15",
    "description": "In order to earn some money, Martin decides to do some tutoring, his first student being precocious 12-year old Eddie Prescott, the son of a seemingly tough-as-nails air force captain who wants his son to enter into the prestigious air force academy. Eddie's tough exterior masks insecurities of stupidity. During Martin and Eddie's first lesson, disaster strikes because of Eddie's silver braces; Martians are rendered brain dysfunctional when exposed to pure silver. As Eddie begins to learn, Martin begins to forget. In simple terms, Eddie is robbing Martin's brains. Martin has to get his brains back from Eddie before Eddie and his family move to Washington DC that night, while still retaining Eddie's newfound respect for learning and knowledge.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Frank Marth",
        "nm": 551731,
        "roles": [
          {
            "char": "Captain Edward Prescott"
          }
        ]
      },
      {
        "name": "Keith Taylor",
        "nm": 852698,
        "roles": [
          {
            "char": "Eddie Prescott"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E09",
    "title": "Double Trouble",
    "tt": 654495,
    "air_date": "1964-11-22",
    "description": "Martin creates a replicating machine, the duplicates from which only having a limited lifespan. Tim accidentally leaves the machine on, the machine duplicating Mrs. Brown just prior to her date with Det. Brennan. Problems arise when both Mrs. Brown's are waiting for their date, and ultimately Det. Brennan takes out the duplicate. Martin and Tim are not only concerned about Mrs. Brown, but also possible exposure of Martin's identity by Det. Brennan. Martin and Tim decide the best course is to bring the real Mrs. Brown to the restaurant and switch her with the duplicate Mrs. Brown. Two Mrs. Brown's running around the same place causes a lot of confusion and near misses, and of course the still possible disappearance of the duplicate. Matters get worse before they get better when a second Det. Brennan is produced.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Mel Prestidge",
        "nm": 696362,
        "roles": [
          {
            "char": "Maitre d'"
          }
        ]
      },
      {
        "name": "Irene Tsu",
        "nm": 875187,
        "roles": [
          {
            "char": "Leilani"
          }
        ]
      },
      {
        "name": "Chief Sua",
        "nm": 1507168,
        "roles": [
          {
            "char": "Machete and Fire Dancer"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E10",
    "title": "Has Anybody Seen My Electro-Magnetic Neutron Converting Gravitator?",
    "tt": 654503,
    "air_date": "1964-11-29",
    "description": "Six-year old runaway Peter Pendleton comes across Martin's spaceship in the woods while Martin and Tim are off away doing other work for Martin's test flight. Peter actually manages to take a flight on the ship, but after Peter returns home, his family and officials believe his is just a story of fancy. That may change as Peter has taken Martin's Electro-Magnetic Neutron Converting Gravitator, on Earth an anti-gravity device. Martin has to get it back from Peter before nosy reporter Grinnell, who is already suspicious due to some coincidences, gets the truth and the device from Peter.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Todd Baron",
        "nm": 56320,
        "roles": [
          {
            "char": "Peter"
          }
        ]
      },
      {
        "name": "June Dayton",
        "nm": 206761,
        "roles": [
          {
            "char": "Aunt Lily"
          }
        ]
      },
      {
        "name": "Herbert Ellis",
        "nm": 254870,
        "roles": [
          {
            "char": "Reporter Grinnel",
            "as Herb Ellis": true
          }
        ]
      },
      {
        "name": "Bill Quinn",
        "nm": 703767,
        "roles": [
          {
            "char": "Mac",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E11",
    "title": "Don't Rain on My Parade",
    "tt": 654494,
    "air_date": "1964-12-06",
    "description": "During a drought/hot spell, Mr. Baldetti, Mrs. Brown's neighbor, tries his rain dance and rain machine, both of which he swears worked back in the old country. In use of the machine, he blasts Martin with a puff of carbon, the \"smog\" which in turn causes Martin to tear and to accidentally blast a hole in a cloud with his levitating trigger finger, causing it to rain. It rains for 7 days and 7 nights while Martin figures out how to make it stop raining. Mr. Baldetti, distraught that he thinks he caused the rain, makes an off handed comment about plumbing, which triggers in Martin's mind an Earthly solution to the problem, of course with the help of a little Martian ingenuity.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Jan Arvan",
        "nm": 38066,
        "roles": [
          {
            "char": "Mr. Baldetti"
          }
        ]
      },
      {
        "name": "Joseph Walsh",
        "nm": 909715,
        "roles": [
          {
            "char": "Ernest",
            "as Joey Walsh": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E12",
    "title": "Night Life of Uncle Martin",
    "tt": 654529,
    "air_date": "1964-12-13",
    "description": "As a defense mechanism against over fatigue and overwork, Martians appear double when they're tired, which Martin is. When he goes to sleep, his double materializes and has a great time in the old adage \"all work and no play...\", the double being Martin's \"play\" half. His double is a womanizer named Pierre. When Martin realizes what is happening, it is too late: Pierre is engaged to a woman, Flossie, with a thuggish brother who will hurt Martin/Pierre if Pierre hurts Flossie. So how can Martin stop Pierre from marrying Flossie without anyone getting hurt, physically or emotionally.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Hal Baylor",
        "nm": 63113,
        "roles": [
          {
            "char": "Harold"
          }
        ]
      },
      {
        "name": "Dick Wilson",
        "nm": 933304,
        "roles": [
          {
            "char": "Davey"
          }
        ]
      },
      {
        "name": "Clarence Lung",
        "nm": 526693,
        "roles": [
          {
            "char": "Maitre D'"
          }
        ]
      },
      {
        "name": "Diane Libby",
        "nm": 508743,
        "roles": [
          {
            "char": "Tim's Girl",
            "as Dianne Libby": true
          }
        ]
      },
      {
        "name": "Joyce Jameson",
        "nm": 417055,
        "roles": [
          {
            "char": "Flossie"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E13",
    "title": "To Make a Rabbit Stew, First Catch a Martian",
    "tt": 654569,
    "air_date": "1964-12-20",
    "description": "Pammie Goodwin's pet rabbit, Cleo, accidentally swallows one of Martin's vitamins, which causes Chloe to grow into a monster rabbit. Martin has to figure out how to restore Cleo. In the meantime, it's a tough job to hide a 6-foot tall rabbit, one with a 6-foot tall rabbit appetite, from the searching Pammie, Mrs. Brown and Det. Brennan. Before Martin can give Cleo the antidote he concocts, Cleo ingratiates her way into Mrs. Brown's masquerade party, and has such a good time, she doesn't want to take the antidote to become a regular rabbit again. Martin secretly slips Cleo the antidote just in time.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Pamela Goodwin",
        "nm": 329528,
        "roles": [
          {
            "char": "Pammie Goodman"
          }
        ]
      },
      {
        "name": "Ollie O'Toole",
        "nm": 642877,
        "roles": [
          {
            "char": "Man with Dog"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E14",
    "title": "Won't You Come Home, Uncle Martin, Won't You Come Home?",
    "tt": 654582,
    "air_date": "1964-12-27",
    "description": "Martin has a benevolence light bulb that when shone on Martians, permeates them with a \"like me\" glow. Tim gets in front of the bulb for fun, and later finds out from Martin that it has the exact opposite effect on humans: it permeates them with a \"hate me\" glow. Martin needs to find some fluorencium - an unknown substance to humans although Martin knows where to find some - to counteract the bulb's effect on Tim. Beyond Mrs. Brown wanting to evict him, Tim has an important job interview that day, and tries his hardest first to postpone it, and when he can't then second to avoid it. Tim is on the verge of losing his apartment, his girlfriend and his job, when Martin returns with the fluorencium.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Dodie Marshall",
        "nm": 550847,
        "roles": [
          {
            "char": "Imogene"
          }
        ]
      },
      {
        "name": "J. Edward McKinley",
        "nm": 571812,
        "roles": [
          {
            "char": "Mr. Phelps"
          }
        ]
      },
      {
        "name": "Mikki Jamison",
        "nm": 417199,
        "roles": [
          {
            "char": "Debbie"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E15",
    "title": "The Case of the Missing Sleuth",
    "tt": 654550,
    "air_date": "1965-01-03",
    "description": "Martin creates an Ultrasonic Microcosmic Molecular Separator, a device that breaks objects down to their individual molecules - because the molecules are so small, the object is now invisible to the naked eye - and puts them back together. Det. Brennan zaps himself. While Martin and Tim are out in the garage momentarily, Mrs. Brown unknowingly vacuums up his molecules and throws them in the trash. Luckily, Martin is able to retrieve them all. But before Martin can put him back together, the police department starts an investigation on the missing Det. Brennan. However during the mêlée of the investigation, Martin and Tim lose one molecule and need to find it before they can put him back together again.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Michael Constantine",
        "nm": 176073,
        "roles": [
          {
            "char": "Collins"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E16",
    "title": "How Are Things in Glocca, Martin?",
    "tt": 654508,
    "air_date": "1965-01-10",
    "description": "Tim's rich but frugal Uncle Seamus comes for a visit. Obviously he doesn't know of an \"Uncle Martin\" and is suspicious of Tim's permanent house-guest. Seamus inadvertently sees Martin doing some of his Martian trickery, and comes to the immediate conclusion that Martin is a leprechaun. Seamus isn't going to pass up his chance to get a wish from a leprechaun. All he wants is to find his one true love, Eileen, who he hasn't seen in 25 years and who is living somewhere in America. Martin finds Eileen, a plain housemaid, who doesn't want to see Seamus again since he broke her heart when they originally dated. So Martin transforms her into a refined woman. However she confesses she didn't lose him to another woman, but to the quest for money; she being a poor maid makes her scared that he won't love her for who she is. So Martin physically transforms Seamus into a poor slob. When they meet, he thinks she's rich, and she thinks he's poor. When the truth comes out, their old differences surface. It isn't until he agrees to give up everything for her that true love prevails.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Sean McClory",
        "nm": 565887,
        "roles": [
          {
            "char": "Seamus O'Hara"
          }
        ]
      },
      {
        "name": "Virginia Gregg",
        "nm": 339615,
        "roles": [
          {
            "char": "Eileen McGinty"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E17",
    "title": "Gesundheit, Uncle Martin",
    "tt": 775651,
    "air_date": "1965-01-24",
    "description": "Everytime he sneezes, Martin becomes temporarily forgetful. You see, it is sneezaphobia day, the first day of sneezaphobia week, which occurs once every 300 years. Martin describes it as being akin to hay fever season. Luckily, there is a simple remedy; unluckily, Martin can't remember one of the key ingredients. To be safe from his sneezing fits and accidentally identifying himself specifically to Det. Brennan, Tim recommends that Martin hide his spaceship and his Martian belongings, but Martin needs to write down where he hides it in case he sneezes and forgets. Unfortunately he writes it in a book that Tim lends to Mrs. Brown to give to Det. Brennan. Martin needs to retrieve the book and remember how to read his Martian notes before trouble occurs. But just in time, Martin remembers the last ingredient for the remedy.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E18",
    "title": "Martian Report #1",
    "tt": 654517,
    "air_date": "1965-01-31",
    "description": "Much to Tim's horror, Martin suggests that Earth children should be deep-frozen until adulthood. This act, he surmises, would spare them the unhappiness of being relatively unproductive, not fully formed beings. Since Tim says Martin is being unscientific by not having this theory proved, Martin wants to test his theory on an Earth child. He decides to at least observe a child, a problem child at that, and enlists the aid of an orphanage which has an out-child program. His charge, Doris, ends up being someone with whom he has a lot of fun and visa versa. However she eventually sees differently when she stumbles on his report on her/deep-freezing and the fact that she is just an experiment to him. So Doris runs away. But after Martin finds her, he admits that he was wrong about the sadness and non-productivity of children and wrong to use Doris, a precious person, as an experiment.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Katie Sweet",
        "nm": 842275,
        "roles": [
          {
            "char": "Doris"
          }
        ]
      },
      {
        "name": "Mary Gregory",
        "nm": 339889,
        "roles": [
          {
            "char": "Mrs. Perkins"
          }
        ]
      },
      {
        "name": "Olan Soule",
        "nm": 815825,
        "roles": [
          {
            "char": "Investigator"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E19",
    "title": "Uncle Martin and the Identified Flying Object",
    "tt": 654572,
    "air_date": "1965-02-07",
    "description": "Martin's levitation finger is getting uncontrollable due to overexposure to the sun. A Martian sedative will temporarily control the symptom, but Martin needs a longer term solution. But before Martin's finger is put to sleep, it causes some flying objects in Mrs. Brown's apartment, which brings in the services of psychic phenomenon expert Prof. Clemmens. Martin needs to hide his spaceship from the professor while keeping his problem finger under control. Worse, the temporary fix if weakened before a permanent fix, will cause major catastrophe due to the build up of energy. Although Martin accidentally stumbles onto the permanent fix, he still needs to settle Mrs. Brown's fear about her house and provide the professor with an explanation for the weird goings-on.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Vaughn Taylor",
        "nm": 853299,
        "roles": [
          {
            "char": "Professor Clemmens"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E20",
    "title": "A Martian Fiddles Around",
    "tt": 654483,
    "air_date": "1965-02-14",
    "description": "Mrs. Brown's bad violin playing is causing Martin to short circuit and become transparent. Actually, it's the bad violin itself causing the problems. They know they can't convince Mrs. Brown to stop playing, so Martin breaks it so that he can fix the fundamental structure of the violin. He finds that the violin is not as bad as it first seems, it just has a few fundamental flaws. The violin maker is Mrs. Brown's teacher, Signor Almafi, his family violin business in threat of going under due to the poor quality of the instruments. After hearing the new and improved instrument, Amalfi believes he did something right to make such a beautifully sounding instrument, but what? So all Martin has to do is pass on the information to Amalfi without him knowing the real source.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Ernest Sarracino",
        "nm": 765512,
        "roles": [
          {
            "char": "Amalfi"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Johnny"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E21",
    "title": "Humbug, Mrs. Brown",
    "tt": 654511,
    "air_date": "1965-02-21",
    "description": "Martin finds out that Mrs. Brown is in financial straits due to her over generous nature. Through noodle soup, Martin gives her some Martian subliminal messages to save money, the suggestions which have an extreme effect. She no longer trusts banks so she withdraws all her money and keeps it at home, and she kicks Tim and Martin out of the apartment for being late on their rent. But there's a bigger problem: there's a friendly neighborhood cat-burglar, and Mrs. Brown now has a houseful of cash. He does try to steal the money, but in their stopping him, Martin and Tim end up with the money and Tim is charged with theft. So all Martin needs to do is to get the real burglar, Mrs. Brown and some more noodle soup to the police station to set things straight.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Harry Lauter",
        "nm": 491591,
        "roles": [
          {
            "char": "Detective Smithers"
          }
        ]
      },
      {
        "name": "Len Lesser",
        "nm": 504335,
        "roles": [
          {
            "char": "Hank"
          }
        ]
      },
      {
        "name": "Paul Sorensen",
        "nm": 814897,
        "roles": [
          {
            "char": "1st Policeman"
          }
        ]
      },
      {
        "name": "Ray Kellogg",
        "nm": 1107853,
        "roles": [
          {
            "char": "2nd Policeman"
          }
        ]
      },
      {
        "name": "Gloria Marshall",
        "nm": 550900,
        "roles": [
          {
            "char": "Police Dispatcher",
            "as Gloria S. Marshall": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E22",
    "title": "Crash Diet",
    "tt": 654490,
    "air_date": "1965-02-28",
    "description": "Martin needs to lose 3 pounds to be able to fly his weight sensitive spaceship properly. Luckily he has a machine that can collapse the necessary 3 pounds of fat molecules from his body. However, Tim presses the wrong switch and instead shrinks the spaceship to toy size. Fortunately the ship will expand back to its normal size in time, the \"when\" being the question. While Martin is gone on an errand and Tim unavoidably detained, a dog comes by and takes off with the ship. They find the dog, who tells them that their master is a Jolly Toys executive who has patented the design of the new \"boomerang spaceship\". Tim and Martin go down to his office to steal the ship, and think they do so, except it ends up being an actual toy. The real ship has an \"A-flat\" sound sensor which'll help Martin find it among all the mass produced ships in the factory. Unable to find it in the shipping department, they find out that it was in another shipment already gone to a department store. Martin and Tim get to the store just in time to fight a precocious child, his permissive mother and a tough-as-nails sales clerk, for the real ship, which is growing in the child's hands. After they wrestle it away, Martin and Tim have one last obstacle - how to get the growing spaceship home without being obvious.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Cliff Norton",
        "nm": 636183,
        "roles": [
          {
            "char": "Albert Leyton"
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Mother"
          }
        ]
      },
      {
        "name": "Sue Randall",
        "nm": 3711,
        "roles": [
          {
            "char": "Miss Turner"
          }
        ]
      },
      {
        "name": "Bern Hoffman",
        "nm": 388822,
        "roles": [
          {
            "char": "Fred"
          }
        ]
      },
      {
        "name": "Jimmy Gaines",
        "nm": 301331,
        "roles": [
          {
            "char": "Edgar"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E23",
    "title": "Gone But Not Forgotten",
    "tt": 654502,
    "air_date": "1965-03-07",
    "description": "Martin gets a splinter of invisflex in his finger, so that everything he touches becomes invisible. What's worse, in the process, Martin loses his dime-shaped Martian Identity Disk, his so called \"dog tag\" on which contains all his personal information. The disk, when in trouble, sends out a verbal distress signal. Mrs. Brown stops by with some of her world famous brownies when she notices that some of Tim's furniture is \"missing\"; rather than say they're invisible, Tim tells her that they were stolen, which prompts her to call in Det. Brennan. As soon as Det. Brennan arrives on the scene, all the furniture reappears in the yard. During the investigation, he picks up Martin's coat in the pocket of which is his ID Disk. The detective takes the coat and the disk to the police station for his investigation. Upon its return to Martin, the coat is without the ID disk, which the detective took and inserts into a vending machine. Martin has to get it out of the machine before it starts sending out its \"mysterious voice\" distress signal. Martin manages to get it out of the machine, however in front of Det. Brennan. Martin's invisiflexed finger aids in hiding it from the good detective.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Hedley Mattingly",
        "nm": 560321,
        "roles": [
          {
            "char": "Gerald Waley"
          }
        ]
      },
      {
        "name": "Dick Winslow",
        "nm": 935483,
        "roles": [
          {
            "char": "Sgt. Leffler"
          }
        ]
      },
      {
        "name": "Ralph Smiley",
        "nm": 806972,
        "roles": [
          {
            "char": "Roscoe",
            "voice": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E24",
    "title": "Stop, or I'll Steam",
    "tt": 654544,
    "air_date": "1965-03-14",
    "description": "As a Martian, Martin can literally \"let off steam\" when aggravated, and Det. Brennan is aggravating him more than usual. This build up of aggravation and the resulting letting off of steam is causing Martin to dehydrate, and he needs some cold air therapy quickly to normalize his system, otherwise he will turn into, in his own words, \"a cracker\". He thinks he can do so by rigging up a contraption from the refrigerator through him to the oven. The only problem: Det. Brennan has thrown out his back and is temporarily but indefinitely laid up in Tim's bed. Martin figures he can still proceed with his plan if Tim keeps Mrs. Brown preoccupied. Martin meanwhile will \"take care\" of Det. Brennan, a statement which he overhears and thinks is meant in the sinister sense. While Martin is working away on the cold air contraption, the detective becomes mobile and finds what he thinks is incriminating evidence linking Martin to wanting to kill him. The detective and Tim ultimately walk in on Martin as he is rigged up to the refrigerator/oven mechanism. Although the detective is flabbergasted by the sight, Martin tells him the truth - Martin knows that the detective will only think he a little wacko, which is indeed the case.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Harry Lauter",
        "nm": 491591,
        "roles": [
          {
            "char": "Marvin"
          }
        ]
      },
      {
        "name": "Arthur Peterson",
        "nm": 677011,
        "roles": [
          {
            "char": "Doctor"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E25",
    "title": "The Magnetic Personality and Who Needs It",
    "tt": 654555,
    "air_date": "1965-03-21",
    "description": "While helping Martin do some work, Tim accidentally magnetizes Martin, turning him into a living magnet. Martin is able to demagnetize himself, however his magnetized particles are spilled onto the hands of Mrs. Brown's new handyman, reformed pickpocket Andy Fuller. Andy really wants to make it on the outside, but his new magnetized hands are causing some problems when they're attracted to Mrs. Brown's new metal brooch. Andy thinks it's all his fault. His magnetic hands are however mixing with the habitual side of his brain, and are also attracted to non-metalized items of value, such as Det. Brennan's leather wallet. The magnetism is only temporary and thus Martin needs to keep Andy out of trouble for only 1 more hour. If only Mrs. Brown would stop putting Andy into compromising positions, Martin's job would be that much easier.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Herbie Faye",
        "nm": 269667,
        "roles": [
          {
            "char": "Andy Fuller"
          }
        ]
      },
      {
        "name": "Lillian Culver",
        "nm": 191737,
        "roles": [
          {
            "char": "Mrs. Peabody",
            "as Culver Lillian": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E26",
    "title": "We Love You, Miss Pringle",
    "tt": 654576,
    "air_date": "1965-03-28",
    "description": "Miss Pringle, Tim's old no nonsense high school English teacher, stops by his apartment. She was and is the faculty advisor for the school newspaper, she being the one who got Tim first interested in becoming a journalist. The students have chosen him as this year's alumnus to sit on the committee to choose the teacher of the year. She also announces to Tim that she is retiring this year, but Martin finds out that she is not too happy about it despite her outward appearance of happiness. She has in reality been visiting many old students in an attempt to validate her life work. Martin suggests that Tim try and get Miss Pringle nominated, a difficult task because she is and was such a tough teacher. The current students do see Miss Pringle in the same light, and she realizes it. Her doing the Watusi for them does show a different side of the tough as nails teacher, but it's not enough. But in a discussion with the school Principal, Miss Pringle fights for the rights of the students, something that she's always done in private behind closed doors without wanting the credit. This discussion does become public knowledge as Martin broadcasts it over the school's PA system. She does become teacher of the year, and she is surprised and touched. She now knows her life work was not in vain.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Doris Packer",
        "nm": 655481,
        "roles": [
          {
            "char": "Miss Pringle"
          }
        ]
      },
      {
        "name": "Randy Kirby",
        "nm": 456215,
        "roles": [
          {
            "char": "George"
          }
        ]
      },
      {
        "name": "Melinda Plowman",
        "nm": 687496,
        "roles": [
          {
            "char": "Sally"
          }
        ]
      },
      {
        "name": "Harry Holcombe",
        "nm": 390118,
        "roles": [
          {
            "char": "Joseph Arons"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E27",
    "title": "Uncle Baby",
    "tt": 654570,
    "air_date": "1965-04-04",
    "description": "Martin is starting to feel old and needs to go through the typical Martian process of rejuvenation, which is accomplished through a special light. With Tim's help, Martin does go through the process, however he is under the effects of the light too short a time and reverts into the physical equivalent of a baby. Before Tim gets Martin back under the light, Det. Brennan comes by and Tim tells him a story that the baby was abandoned. The detective takes the baby into custody to the hospital nursery as a ward of the state. Tim needs to get the light down to the hospital and change Martin back, but he first has the problems of mistaken baby identities which results in a adult formed baby who goes missing, a gauntlet of nurses protecting baby Martin, and of course a meddlesome Det. Brennan.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Natalie Masters",
        "nm": 557701,
        "roles": [
          {
            "char": "Nurse 1"
          }
        ]
      },
      {
        "name": "Jackie Russell",
        "nm": 751208,
        "roles": [
          {
            "char": "Nurse 2"
          }
        ]
      },
      {
        "name": "Monroe Arnold",
        "nm": 36572,
        "roles": [
          {
            "char": "Doctor"
          }
        ]
      },
      {
        "name": "Page Slattery",
        "nm": 805486,
        "roles": [
          {
            "char": "Junior"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E28",
    "title": "Once Upon a Martian Mother's Day",
    "tt": 654533,
    "air_date": "1965-04-11",
    "description": "It's nearing Martian Mother's Day and Martin is feeling sad in not being with his mother on that day. He even projects a 3D image of her to make himself feel better. On the day, he runs into Miss Cora Darling, a spinster the spitting image of his mother. Martin wants to do something nice for his mother lookalike, so a worthless but sentimental ring she has appraised - the ring from a former lover - Martin temporarily turns into a valuable piece not thinking that she'd sell it to the jeweler, which is what she does. So to get the ring before it reverts back into being a worthless trinket and before the jeweler thinks he was swindled, Martin devises a plan to get the money from Cora by doing the work for which she needed the money, namely some structural renovations to her house, and re-buy the ring from the jeweler.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Madge Blake",
        "nm": 86636,
        "roles": [
          {
            "char": "Cora Darling"
          }
        ]
      },
      {
        "name": "James Millhollin",
        "nm": 589622,
        "roles": [
          {
            "char": "Mr. Hoskins"
          }
        ]
      },
      {
        "name": "Richard Reeves",
        "nm": 716279,
        "roles": [
          {
            "char": "Detective"
          }
        ]
      },
      {
        "name": "Sara Haden",
        "nm": 352774,
        "roles": [
          {
            "char": "Dora Darling"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E29",
    "title": "Uncle Martin's Bedtime Story",
    "tt": 781911,
    "air_date": "1965-04-25",
    "description": "Martin rigs Tim's radio to receive signals from the air force base regarding an impending rocket launch to Mars. This coincides with Mrs. Brown buying a new electric bed, a spring in which matches Martin's brain frequency, so that she can read Martin's mind whenever she's in bed. She and Det. Brennan think she has ESP, and are trying to figure out the meaning of some of Martin's \"Martian\" thoughts. Martin needs to keep Mrs. Brown out of that bed until the launch. Luckily she intends on going to Palm Springs. Unfortunately Det. Brennan stays at her place and will be the occupant of the bed. The detective stays out of the bed just until 20 minutes before the launch. Martin now has to keep the detective preoccupied. This in turn makes Martin miss the launch. But at least the process of doing so bent the culprit bedspring so that it no longer is in contact with Martin.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E30",
    "title": "006 3/4",
    "tt": 654481,
    "air_date": "1965-05-02",
    "description": "Tim inadvertently gets possession of a distress note from Agent 006 of Top Secret, code named TopSecte, an organization to prevent worldwide hostilities. Agent 006 is being tracked by Crush - an international group of cutthroats who are against everything - whose undercover headquarters Agent 006 had found. Tim takes this information to TopSecte headquarters, and since Tim now knows too much, is taken under protective custody by TopSecte. As an alternative, they ask him to assist Agent 004, the only agent of which Crush is unaware, to help defeat Crush and save 006. Despite Tim's apprehensions, Martin tries to talk him into doing it for the good of the planet. Tim ultimately agrees when he sees 004, a gorgeous woman named Kitty. Tim gets code name 006 3/4. Tim goes through some basic training, just barely passing, but is placed in the field with 004 regardless. With invisible Martin's help, Tim and Kitty infiltrate Crush headquarters. With some bumpy paths along the way, they manage to find and save 006 and the world.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Susanne Cramer",
        "nm": 186203,
        "roles": [
          {
            "char": "Kitty"
          }
        ]
      },
      {
        "name": "Dan Seymour",
        "nm": 786811,
        "roles": [
          {
            "char": "Fat Man"
          }
        ]
      },
      {
        "name": "Les Tremayne",
        "nm": 871876,
        "roles": [
          {
            "char": "Mr. Clary"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E31",
    "title": "Never Trust a Naked Martian",
    "tt": 783991,
    "air_date": "1965-05-09",
    "description": "Tim touches one of Martin's antenna, and is thrown into the fourth dimension: he becomes invisible and is in limbo. Martin finds a small crack into the dimension but it's getting smaller and smaller as time goes by. He thinks that Tim can make it through with a running start, but Mrs. Brown comes by the apartment with the handyman and won't leave, which doesn't allow Tim to come through. Meanwhile, the crack closes. Martin goes to Plan B: he remembers that Tim will be able to get out of limbo by actually doing the limbo under a burning broomstick. Despite his fears about being cooked like a goose, Tim tries it as it's his only option.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Bob Jellison",
        "nm": 420604,
        "roles": [
          {
            "char": "Mister Dinkle",
            "as Robert Jellison": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E32",
    "title": "Martin's Favorite Martin",
    "tt": 654522,
    "air_date": "1965-05-16",
    "description": "Martin and Tim are out in Death Valley to fix Martin's ship, damaged by smog. The smog is causing rust-like spots. While Martin is off looking for some restorium, a material he needs to fix the rust spots, Tim tries on his space suit and fools around with his laser gun. Tim is spotted by the Farrow family, who think he's a Martian. Father Daniel is suspicious and fearful of Tim, but children Sally and Gerald are fascinated. Seeing that Tim is in trouble, Martin goes under cover as a prospector. Martin and Tim develop an idea that Tim should act like a Martian so that all the attention is focused on him, which will give Martin time to fix his ship. The problem is that Gerald finds the ship. Martin needs clandestinely to fix the ship then have Tim act like a friendly but powerful Martian who will fly the ship away, of course with Martin's assistance. They show the family that Tim really is a harmless Martian and let him go on his merry way without divulging his secret to the authorities.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Olan Soule",
        "nm": 815825,
        "roles": [
          {
            "char": "Daniel Farrow"
          }
        ]
      },
      {
        "name": "Kim Tyler",
        "nm": 878855,
        "roles": [
          {
            "char": "Gerald Farrow"
          }
        ]
      },
      {
        "name": "Michael Barrier",
        "nm": 56922,
        "roles": [
          {
            "char": "Charles Bradley"
          }
        ]
      },
      {
        "name": "Linda Evans",
        "nm": 2067,
        "roles": [
          {
            "char": "Sally Farrow"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E33",
    "title": "The Martian's Fair Hobo",
    "tt": 654558,
    "air_date": "1965-05-23",
    "description": "Martin thinks he has made contact with a Martian space patrol.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Guy Marks",
        "nm": 548840,
        "roles": [
          {
            "char": "Shorty Smith"
          }
        ]
      },
      {
        "name": "Amzie Strickland",
        "nm": 834351,
        "roles": [
          {
            "char": "Jenny Holbrook"
          }
        ]
      },
      {
        "name": "Hap Holmwood",
        "nm": 392216,
        "roles": [
          {
            "char": "Control Engineer"
          }
        ]
      },
      {
        "name": "Johnny Jacobs",
        "nm": 414479,
        "roles": [
          {
            "char": "Newscaster"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E34",
    "title": "A Martian Sonata in Mrs. B's Flat",
    "tt": 654484,
    "air_date": "1965-05-30",
    "description": "Mrs. Brown has asked Tim and Martin to listen to her piano performance at her woman's club meeting. She is awful. Half way through her performance, she excuses herself to go get her music in Tim's apartment. When she returns, she is now a virtuoso. Apparently she grabbed more than than just her music in Tim's apartment; she also grabbed some of Martin's liquid musical distillate. Martians can transfer musical energy into liquid form and when the distillate comes in contact with humans, it will transfer the energy of music into that person to be able to perform it. Mrs. Brown found some of Martin's distillate in an atomizer bottle she thought was her birthday present perfume. She sprayed on a little too much however as an excessive amount has the opposite effect of sucking the musical energy out of one. Mrs. Brown could only get through half of the music in its virtuosic state. Regardless, Mrs. Wooster, the club chair, suggests that Mrs. Brown be the star attraction at a musical fund-raiser. Wanting to help, Mrs. Brown agrees. However Martin and Tim know she can't carry the concert and they ask a retired concert pianist, Ilya Politnikoff, to perform. It takes some Martian trickery to get him to agree to come out of retirement. Mrs. Wooster is somewhat perturbed at Martin and Tim's interference and the overshadowing of her star find, Mrs. Brown, and suggests the two play a duet. Thus, Martin and Tim are not yet out of the woods in protecting Mrs. Brown. They provide her with some distillate in the form of hand cream, which she in turn gives to Politnikoff for his dry hands. He has put on too much and as a result has become musically incapacitated. Now there are no virtuoso pianists for the concert. So Martin has to take matters into his own hands by disabling the strings in the two pianos and hooking up the mic to himself and having the music come out of him while Politnikoff and Mrs. Brown think they're playing.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Mona Bruns",
        "nm": 116573,
        "roles": [
          {
            "char": "Mrs. Wooster"
          }
        ]
      },
      {
        "name": "Lillian Culver",
        "nm": 191737,
        "roles": [
          {
            "char": "Plump Lady"
          }
        ]
      },
      {
        "name": "Robin Watts",
        "nm": 915229,
        "roles": [
          {
            "char": "Pretty Girl"
          }
        ]
      },
      {
        "name": "Dorothy Keller",
        "nm": 445617,
        "roles": [
          {
            "char": "Short Lady"
          }
        ]
      },
      {
        "name": "Carol Worthington",
        "nm": 941753,
        "roles": [
          {
            "char": "Tall Lady"
          }
        ]
      },
      {
        "name": "Leon Belasco",
        "nm": 67589,
        "roles": [
          {
            "char": "Ilya Politnikoff"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E35",
    "title": "The Green-Eyed Martian",
    "tt": 654554,
    "air_date": "1965-06-06",
    "description": "To get rid of Det. Brennan while he's working on some important and time sensitive fuel for his rocket, Martin decides to use his irresistible serum. A spray of such will render a person irresistible, and he is going to use it on a \"suitable suitor\" for Mrs. Brown so that she'll dump the detective. However, Mrs. Brown sees the liquid in an atomizer bottle, and thinks it's perfume, which she sprays on herself. The next person who sees her is Martin, who falls madly in love with her. Apparently Martin made the spray too strong, so that Mrs. Brown will be attractive to everyone who sees her, including a powerful Martian. This not only includes Martin and Det. Brennan, but also the butcher. The potion has taken too strong a hold on Martin, who wants to whisk Mrs. Brown off to a secluded planet and be alone with her for the rest of their lives. So Tim is on his own to find the book with the antidote. When he does, he then has to find a Martian-English dictionary to translate, which he ultimately does. When he translates, he finds that the antidote is simple everyday aspirin. Now all he has to do is get Mrs. Brown to take an aspirin before Martin reveals his Martian identity to everyone involved.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Henry Corden",
        "nm": 179478,
        "roles": [
          {
            "char": "Mr. Sanders"
          }
        ]
      },
      {
        "name": "Owen Bush",
        "nm": 124184,
        "roles": [
          {
            "char": "Postman"
          }
        ]
      },
      {
        "name": "Jon Silo",
        "nm": 798151,
        "roles": [
          {
            "char": "Ice Cream Man"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E36",
    "title": "El Señor from Mars",
    "tt": 654497,
    "air_date": "1965-06-13",
    "description": "Martin needs to rush to Mexico as a treasure chest that has just been discovered has a tablet inside marking Martin's arrival on Earth during the Aztec era, the tablet complete with a carving of his likeness. He needs to get there before anyone opens it and discovers his Martian origins. Tim decides to accompany him just in case. They find the chest, which is scheduled to be opened at a big festival the following day, in the Police Chief's office, the Police Chief who is guarding it. They run into a further problem when Martin's antenna won't go down, the symptom caused by an excessive consumption of peppers. They solve the two problems with a simple sombrero covering Martin's head and a diversion to get the chief out of his office. Martin gets the tablet out of the chest and disappears just as the chief returns to the office, leaving Tim to deal with the chief. The one problem beyond telling a convincing story to the chief of why he's in the office is the fact that Martin's antenna didn't disappear when he did, thus leaving a \"floating\" pair of antenna. The fact that his antenna won't disappear means that Martin's ailment has reached a critical stage, that he will eventually go invisible forever except for his antenna. He remembers just in time that a certain mineral contained in the chest is an antidote for his ailment, luckily this remembrance just as the chest is to be opened.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Dan Seymour",
        "nm": 786811,
        "roles": [
          {
            "char": "Chief of Police"
          }
        ]
      },
      {
        "name": "Bernie Kopell",
        "nm": 465728,
        "roles": [
          {
            "char": "Senor Pepe Lopez"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E37",
    "title": "Time Out for Martin",
    "tt": 654568,
    "air_date": "1965-06-20",
    "description": "Martin builds a \"CCTBS\", a cathode-ray centrifugal time breakascope: a time machine. He plans to use it to go back to just before he crashed so that he can avert the problem the second time around and fly back to Mars. Tim corrects the clock on the CCTBS to the current hour/minute time of 12:15. However the clock is actually the year calculator and that sends Martin and Tim back to the year 1215 in England, England over where Martin's spaceship malfunction originally happened. The time trip broke the CCTBS, so they have no way of getting \"home\" until Martin fixes it, which he does and has it set to send them back at the stroke of midnight. In the meantime, Tim witnesses a young man being attacked, and Tim comes to his rescue. However with Tim and ultimately Martin's interference, the man drops a parchment and runs off without it. Tim has just altered history as the man, who would have beat off his attacker, would have delivered the parchment to its intended destination. That parchment and its intended destination are the Magna Carta and the Archbishop of Canterbury at Runnymede. Before Martin and Tim can correct history by taking the Magna Carta to the Archbishop, they meet the Duchess of Brimstone, who witnessed the attack. Although the Duchess commends them for their heroic action, she really works for King John, who opposes signing the Magna Carta. The beautiful Duchess distracts girl-crazy Tim and drugs Martin, allowing her henchman, Basil, to get and destroy the parchment. A further problem is that the drug has shrunk Martin to 1 foot high. However Martin still intends of going to Runnymede, where the Duchess and King John are also located, as he needs to get some more of the drug from her as an antidote. Martin also intends on getting the King to sign \"a reasonable facsimile\" of the Magna Carta as he acts as a miniature appearing/disappearing sorcerer. All this needs to be accomplished before midnight when they need to get back to the CCTBS and hopefully back to present day Los Angeles. They do make it back, but the CCTBS doesn't make it back with them in a usable state. Martin is still stranded on Earth, but at least \"home\".",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Anne Wakefield",
        "nm": 906759,
        "roles": [
          {
            "char": "Duchess of Brimstone"
          }
        ]
      },
      {
        "name": "Anthony Eustrel",
        "nm": 262418,
        "roles": [
          {
            "char": "King John",
            "ch": 3913,
            "as Antony Eustrel": true
          }
        ]
      },
      {
        "name": "William Baskin",
        "nm": 59962,
        "roles": [
          {
            "char": "Basil"
          }
        ]
      },
      {
        "name": "Jesse Wayne",
        "nm": 915586,
        "roles": [
          {
            "char": "2nd Swordsman"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E38",
    "title": "Portrait in Brown",
    "tt": 654538,
    "air_date": "1965-06-27",
    "description": "Martin has built a dimensional separator, a machine that turns 3D items into 2D. These 2D items will allow Martin to carry more Earth artifacts back to Mars. Will Mrs. Brown be one of those artifacts? She can be as she inadvertently walks in front of the machine and gets turned into a 2D object. As something organic, the 2D Mrs. Brown will remain permanently so in 18 hours. Martin needs a certain metallic compound to restore her third dimension. While Martin retrieves the compound, he turns Mrs. Brown into a painting to retain her flat shape, i.e. so that she won't break. Det. Brennan comes by and sees the painting. As a surprise for Mrs. Brown, the detective suggests hanging it in a friend's art gallery. Tim is helpless to stop him. Later, while Martin and Tim retrieve the painting \"after hours\", they run into a band of art thieves/smugglers who steal the painting of Mrs. Brown. The smugglers whitewash over the canvasses before they smuggle the pieces to Europe. Despite Martin and Tim being incapacitated during the robbery, they find the thieves' hide-out in a carnival back-room. Now Martin and Tim need to find the covered over painting of Mrs. Brown, and elude the thieves and Det. Brennan, the latter who thinks Tim is the mastermind behind the art theft.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Lisa Seagram",
        "nm": 780465,
        "roles": [
          {
            "char": "Felicia Fratoli"
          }
        ]
      },
      {
        "name": "William Baskin",
        "nm": 59962,
        "roles": [
          {
            "char": "Akbar"
          }
        ]
      },
      {
        "name": "Herb Andress",
        "nm": 28459,
        "roles": [
          {
            "char": "Mechanical Man",
            "as Herbert Andreas": true
          }
        ]
      },
      {
        "name": "Harvey Lembeck",
        "nm": 501183,
        "roles": [
          {
            "char": "Rembrandt Jones"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E01",
    "title": "Go West, Young Martian: Part 1",
    "tt": 654499,
    "air_date": "1965-09-12",
    "description": "Martin rebuilds his CCTBS - cathode-ray centrifugal time breakascope - convinced that if he transports himself to just before the time he crashed, he can fix the problem and fly back to Mars. Det. Brennan inadvertently flips the switch for the delay function, sending Tim and Martin back in time. Instead of 1215 Merry Old England where they were sent last time, they are sent to 1849 St. Louis. Unfortunately the CCTBS didn't make the trip with them. Instead it should still be in the exact same spot in what is the site of Los Angeles in 1849. Unfortunately, they run into Det. Brennan's great-grandfather, also a lawman, who arrest them for passing off \"fake\" money that Tim brought with him from 1965. With some Martian trickery, they break out of jail just in time to catch a riverboat up the Missouri. This marks the start of their trek to Los Angeles. On the riverboat, they run into a woman who happens to be Mrs. Brown's great-grandmother, Loralei Glutz. The unfortunate circumstance of their meeting is that Tim, hearing her cries of a thief who has stolen her pocketbook, punches out the person who was chasing the crooks instead of the crooks themselves. Tim has altered the course of history as the pocketbook contained her dowry, without which she cannot get married which in turn means that Mrs. Brown would never have been born. So they have to catch the crooks and get Loralei Gltuz' dowry back to her. But the crooks turn the tables - they recognize Tim and Martin as the one's who were locked up in St. Louis and plan on turning them in. Before the ship's captain can do so, Tim and Martin abandon ship into the Missouri. They are able to make their way to St. Joseph, to where the crooks, Loralei Glutz (working now as a dance hall girl to earn money to replace her dowry) and Marshal Brennan have also made their way. Still eluding Brennan, their other major task is to get Loralei on the next wagon train heading west. However they forget about the crooks, who ambush them. They tie up Tim and Martin, unfortunately in a way that Martin can't use his magic finger to untie them. But he suggests trying something he saw on television, specifically using his nose instead (à la Samantha Stephens of Bewitched). It works! They help Loralei win back her dowry money in a crooked poker game and she can now go on her way west. But Martin and Tim can't join her just yet as Marshal Brennan has caught up with them. They are once again in handcuffs.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Hal Baylor",
        "nm": 63113,
        "roles": [
          {
            "char": "Red"
          }
        ]
      },
      {
        "name": "Ken Mayer",
        "nm": 562441,
        "roles": [
          {
            "char": "Pete"
          }
        ]
      },
      {
        "name": "James Jeter",
        "nm": 422319,
        "roles": [
          {
            "char": "Waiter"
          }
        ]
      },
      {
        "name": "Emile Meyer",
        "nm": 583093,
        "roles": [
          {
            "char": "Ship's Captain"
          }
        ]
      },
      {
        "name": "Jeff DeBenning",
        "nm": 213393,
        "roles": [
          {
            "char": "Big Jim"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E02",
    "title": "Go West, Young Martian: Part 2",
    "tt": 654500,
    "air_date": "1965-09-19",
    "description": "Loralei Glutz is safely on her way west on a wagon train. However Martin and Tim are once again behind bars. Before Martin breaks them out, he draws Tim a map of where the CCTBS is located just in case they are separated. After they break out, they are ambushed. They awake at the wagon train where Loralei is taking care of them; she found them and feels she owes them for helping her get her money back. The only thing they are missing is the map. Martin deduces that whoever stole it must be on the wagon train and thinks that it is a map of a gold strike in California. They need to get back to the CCTBS before it may be apprehended by whoever stole the map. Of course, it is Tim and Martin's thief nemeses, Red and Pete, who are hiding out on the train. They kidnap Loralei and hold her as hostage in exchange for Tim and Martin forgetting about the map. Martin and Tim manage to find Red and Pete and Loralei - unharmed - and scare off the thieves. Martin and Tim and Loralei are then immediately abducted by some seemingly hostile Indians. So is Marshall Brennan. Martin feels he can better get out of the situation alone, so manages to break free and \"appear\" before the tribe as a spirit warrior, who tells the tribe he needs the three pale faces as a sacrifice. During their escape, which is almost thwarted by Marshal Brennan himself, Martin/Tim and Loralei/Brennan get separated. The Marshall and Loralei make their way to Yuma, where they call in the calvary to apprehend the prisoners, Martin and Tim. Meanwhile Martin and Tim make their way to Los Angeles, to the site of where Mrs. Brown's house should be. They can't find the CCTBS. But before they can continue looking, they have to fend off both the calvary and the expanded tribe of Indians after them. They find the CCTBS to transport themselves back to 1965 just as the calvary and Indians are ready to pounce upon them. Unfortunately, they bring back with them two unintended things: a broken but fixable CCTBS, and an Indian.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Hal Baylor",
        "nm": 63113,
        "roles": [
          {
            "char": "Red"
          }
        ]
      },
      {
        "name": "Ken Mayer",
        "nm": 562441,
        "roles": [
          {
            "char": "Pete"
          }
        ]
      },
      {
        "name": "Richard Gilden",
        "nm": 318400,
        "roles": [
          {
            "char": "Indian Brave"
          }
        ]
      },
      {
        "name": "Eddie Little Sky",
        "nm": 514507,
        "roles": [
          {
            "char": "Medicine Man",
            "ch": 202288,
            "as Eddie Littlesky": true
          }
        ]
      },
      {
        "name": "John Alvin",
        "nm": 23569,
        "roles": [
          {
            "char": "Colonel"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E03",
    "title": "Martin of the Movies",
    "tt": 654521,
    "air_date": "1965-09-26",
    "description": "Martin repairs his CCTBS, but hasn't fined tuned it enough to get precisely back to 1963. The closest he can currently get to is 1945. But it's back to 1925 that he currently has his eye on as he appeared in a silent movie made then - he just couldn't stand the performance of the actor who was scheduled to play the role - that movie which is scheduled to air on television that evening. Since his appearance in the movie would raise questions, he needs to get back to change history and not appear in the movie. Just as Martin is ready to go, Tim gets caught in the path and goes back with Martin. As they arrive on the movie set, Martin cannot control his hatred of the actor's performance and similarly stops production just like he did the first time. The only difference this time is that Martin intends on finding another person to take the actor's place. He finds who he thinks is the perfect person, a waiter named Joe, who with the aid of a Martian pill, exudes stage presence. The one thing that Martin didn't account for is that the leading lady, Viola Normandy, has someone else in mind for the role, namely Tim. Tim get swept up in the moment and gets swept up with Viola. So Martin has to get Joe into see the director while convincing Tim to give up this exciting life he was never meant to experience. Tim may give up the movie career somewhat easily, but it's giving up Viola that may be more difficult.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Arlene Martel",
        "nm": 551458,
        "roles": [
          {
            "char": "Viola"
          }
        ]
      },
      {
        "name": "Leon Askin",
        "nm": 39169,
        "roles": [
          {
            "char": "Von Reinbein"
          }
        ]
      },
      {
        "name": "John Considine",
        "nm": 175912,
        "roles": [
          {
            "char": "Joe"
          }
        ]
      },
      {
        "name": "Howard Morton",
        "nm": 607990,
        "roles": [
          {
            "char": "Irving"
          }
        ]
      },
      {
        "name": "Barbara Perry",
        "nm": 674977,
        "roles": [
          {
            "char": "Miss Hotchkiss"
          }
        ]
      },
      {
        "name": "Doreen McLean",
        "nm": 572537,
        "roles": [
          {
            "char": "Nurse"
          }
        ]
      },
      {
        "name": "Frank Evans",
        "nm": 3344,
        "roles": [
          {
            "char": "Announcer",
            "voice": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E04",
    "title": "Keep Me from the Church on Time",
    "tt": 654514,
    "air_date": "1965-10-03",
    "description": "Martin has a futuroid camera, something takes takes photos of the future. To show Tim how it works, Martin snaps a photo of him 24 hours into the future. Martin and Tim are shocked to see a photo of what looks like Tim the groom in a wedding, the bride whose face is not shown. For the first time in his adult life, Tim is not girl crazy, and wants to avoid women for the next 24 hours. Tim decides to cover a story for the paper in an effort to keep out of girl trouble, but he finds out after he accepts that the story is at the Kitten Club, a men's club. Martin follows him on the story so that he can photograph all the women to see what they're doing in 24 hours. The one woman who he doesn't take photo of is Louise Babcock, an acquaintance of Tim's who hasn't given him the time of day in the past, hence the reason they figure it's not her in the picture. Perhaps they shouldn't have passed her up so easily. She's in love with a man named Sam Evans, who trusts her enough not to be jealous of her. She however wants him to show his love by being more jealous, and threatens him that she will go out with Tim unless he shows her that he loves her by being jealous. She works her magic on Tim, who is still oblivious to the fact that it may be Louise in the photo. She even kisses Tim right in front of Sam, with no reaction from Sam at all. When Tim is at home just having finished his story and feeling good that he is still single, Louise shows up on his doorstep. Martin and Tim do discover that she is indeed the woman in the photograph. Louise's strict father and strong armed brother barge in on them, and threaten Tim that he has to make an honest woman out of her and get married in Tijuana. Martin figures that they need to get Sam back into the picture to get Tim out of this jam. Everything seems to be working against Tim however, as the judge, in Spanish, pronounces a man and wife as Tim and Louise stand there. However, Martin arranged that Tim was only a proxy stand-in for Sam. As a final parting wedding gift, Martin snaps a photo of the newlyweds Louise and Sam for 1 year in the future: twins!",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Yvonne Craig",
        "nm": 186051,
        "roles": [
          {
            "char": "Louise Babcock",
            "ch": 48390
          }
        ]
      },
      {
        "name": "Parley Baer",
        "nm": 46373,
        "roles": [
          {
            "char": "Mr. Babcock"
          }
        ]
      },
      {
        "name": "Don Diamond",
        "nm": 224614,
        "roles": [
          {
            "char": "Judge Juan 'Speedy' Gonzales"
          }
        ]
      },
      {
        "name": "Penny Santon",
        "nm": 763842,
        "roles": [
          {
            "char": "Miss Gonzales"
          }
        ]
      },
      {
        "name": "Shannon Farnon",
        "nm": 267880,
        "roles": [
          {
            "char": "Caroline"
          }
        ]
      },
      {
        "name": "Susan Wedell",
        "nm": 917168,
        "roles": [
          {
            "char": "Kathy"
          }
        ]
      },
      {
        "name": "Noam Pitlik",
        "nm": 685736,
        "roles": [
          {
            "char": "Sam Evans"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E05",
    "title": "I'd Rather Fight Than Switch",
    "tt": 654512,
    "air_date": "1965-10-10",
    "description": "Martin's newest gizmo, a molecular reassembler, switches the psyche of the two subjects to which they are exposed. Martin would like to use it to eliminate all hostility in the world, not to switch his and Mrs. Brown's psyches, which is what happens, just before Mrs. Brown is ready to go out on a date with Det. Brennan. Martin, looking like Mrs. Brown, is especially not looking forward to a date with Det. Brennan, but needs to do so not to attract the detective's suspicion. Martin is even more perturbed that the detective wants to ask Mrs. Brown to marry him. But of utmost importance, Martin needs to change himself and Mrs. Brown back within a couple of hours, or this switch will be permanent. Unfortunately, Martin has run out of the mineral needed to exact the change. Fortunately, Martin thinks that a diamond, which has a similar make-up, will work. The mixed blessing is that neither \"Mrs. Brown\" or Tim have a diamond, however Det. Brennan, ready to propose, has a diamond ring in his possession. Martin, as Mrs. Brown, gets the detective to propose just in time to get the ring and change himself and Mrs. Brown back. However, after the change back, Mrs. Brown has no recollection of any of the evening's events, including the proposal. Martin manages to slip the ring back in the detective's pocket, who ultimately thinks he's losing his mind.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Bill Idelson",
        "nm": 406857,
        "roles": [
          {
            "char": "Mrs. Brown's Brother"
          }
        ]
      },
      {
        "name": "Paul Steyer",
        "nm": 2234024,
        "roles": [
          {
            "char": "Messenger"
          }
        ]
      },
      {
        "name": "Jerry Riggio",
        "nm": 726659,
        "roles": [
          {
            "char": "Head Waiter"
          }
        ]
      },
      {
        "name": "Jack Donner",
        "nm": 232800,
        "roles": [
          {
            "char": "Master of Ceremonies"
          }
        ]
      },
      {
        "name": "Bill Chaudet",
        "nm": 2235716,
        "roles": [
          {
            "char": "Flamand"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E06",
    "title": "Tim, the Mastermind",
    "tt": 654567,
    "air_date": "1965-10-17",
    "description": "Martin has developed some green spots on his skin from taking too many memory pills. He has to take them to aid in his quest to make it back to Mars, but not if it's going to continue making him conspicuous with the spots. An idea: Tim can take the pills instead as he has excess unused brain capacity. Tim reluctantly agrees to do so. Taking the pills makes Tim the smartest man on the face of the Earth. However, to allow him to lead a normal life in this state, Martin has provided him something akin to a post hypnotic suggestion, where the snap of a finger will bring him in and out of the brilliant state, in the normal state without recollection of brilliance. In the middle of helping Martin, Tim is called off to cover a story, that of DeWitt Merrick, an astronomical engineer. Just before meeting Merrick, Tim is in the presence of a flamenco dancer, who is snapping his fingers away leaving Tim in a state of brilliance, which ultimately wows Merrick as Tim was able to solve all Merrick's scientific problems. Tim is drafted to work for the US government on Project Galileo dealing with Mars. Martin has to get to Tim and reverse the effects of the pills before he spills the beans about Martin and Mars. Martin gets to Tim just in time, however exacts too much of Tim's brain power and turns him into the metal equivalent of a child. The scientists think that it is extreme burn-out of a brilliant mind.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Harry Holcombe",
        "nm": 390118,
        "roles": [
          {
            "char": "Arthur Nelson"
          }
        ]
      },
      {
        "name": "Jonathan Kidd",
        "nm": 452252,
        "roles": [
          {
            "char": "1st Scientist"
          }
        ]
      },
      {
        "name": "Dinah Anne Rogers",
        "nm": 736841,
        "roles": [
          {
            "char": "2nd Scientist"
          }
        ]
      },
      {
        "name": "John Zaccaro",
        "nm": 951516,
        "roles": [
          {
            "char": "1st Agent"
          }
        ]
      },
      {
        "name": "Michael Barrier",
        "nm": 56922,
        "roles": [
          {
            "char": "2nd Agent"
          }
        ]
      },
      {
        "name": "Frank Evans",
        "nm": 3344,
        "roles": [
          {
            "char": "Reporter"
          }
        ]
      },
      {
        "name": "Raúl Martín",
        "nm": 554762,
        "roles": [
          {
            "char": "Manuelo"
          }
        ]
      },
      {
        "name": "Lee Bergere",
        "nm": 74261,
        "roles": [
          {
            "char": "DeWitt Merrick"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E07",
    "title": "Martin Goldfinger",
    "tt": 654518,
    "air_date": "1965-10-24",
    "description": "Everything Martin touches is literally turning to gold. Tim is excited, but Martin isn't as it's a symptom that he's not well - he has a gold deficiency in his diet. In addition, he has to be careful what he touches. To fix his problem, Martin figures he needs to eat something that has been grown in gold enriched soil. Where a better place to find such than the area outside of Fort Knox. Martin enlists Tim's help in going to Fort Knox to pick up some greens growing by a stream that runs close to the gold vault. But before Tim can head off, the boys unavoidably have dinner with Mrs. Brown and Det. Brennan. During which, Martin is good, not touching anything, that is until just before he leaves, when he touches his dinner roll. When the detective finds a half burnt piece of paper of a floor plan with the letters \"NOX\", the fact that Tim is leaving on a flight at 8:30 - a flight to Fort Knox does leave at that time - and the gold dinner roll, he puts two and two and two together. On doing some spying, he sees, touches and tries to lift the gold furniture in the O'Hara apartment; he figures they are smuggling gold out of the country disguised as furniture. Tim arrives home with the greens just in time to cure Martin's gold deficiency. But can Martin change the furniture back to wood in front of the detective and before the rest of his police back-up make it to the apartment?",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Harry Lauter",
        "nm": 491591,
        "roles": [
          {
            "char": "Police Captain"
          }
        ]
      },
      {
        "name": "Stan Ross",
        "nm": 743829,
        "roles": [
          {
            "char": "Radio voice",
            "voice": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E08",
    "title": "Bottled Martian",
    "tt": 654489,
    "air_date": "1965-10-31",
    "description": "Martin is too heavy for his spaceship, and he needs to lose 143 pounds. He devises a way to shrink himself to 6 ounces, however the shrinking process is only temporary, too temporary that it won't get him all the way back to Mars. So he needs to devise a way to make it more long lasting. As an experiment, he asks Tim to cork him inside a wine bottle with the necessary gas making the shrinking process longer lasting. Martin intends to stay inside the bottle all day just to make sure it works. However the wine bottle with Martin in it gets collected with an overseas relief package destined for Baghdad. So Tim heads off to Baghdad. The package gets delivered to the home of lovesick Abu, whose girlfriend Nadja is scheduled to marry the Sultan. Abu releases Martin from the bottle, thinking Martin a genie. For releasing him, Martin intends to get Nadja back for Abu.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Linda Gaye Scott",
        "nm": 779489,
        "roles": [
          {
            "char": "Nadja",
            "as Linda Scott": true
          }
        ]
      },
      {
        "name": "Paul Verdier",
        "nm": 893839,
        "roles": [
          {
            "char": "Abu"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Mama"
          }
        ]
      },
      {
        "name": "Howard Caine",
        "nm": 128995,
        "roles": [
          {
            "char": "Sultan"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E09",
    "title": "Hate Me a Little",
    "tt": 654504,
    "air_date": "1965-11-07",
    "description": "Martin fixes his benevolence bulb so that it works on humans. When shone on humans, they turn into the nicest person in the world. Tim tries it on an extra antagonistic Brennan, but the effect is delayed. As much as he hates Brennan, Martin thinks this disastrous as a nice detective could potentially be a dead detective. So Martin uses his futuroid camera to see if/when he gets into trouble. They find that he changes into a nice person just as he enters a bank the following day and meets up with a notorious bank robber, Frank Talbert. So Martin rigs a device to change the good detective back to mean just as he's in the bank. However, Det. Brennan accidentally flicks the switch on the machine on Martin instead. It temporarily turns Martin into a zombie, the effect lasting after the time that he's scheduled to be in the bank. Tim drags Martin down to the bank in his catatonic state hoping for the best. The best does happen, but not the way Martin had planned. He accidentally turns both the security guard and Talbert into nice guys as well, and everyone waltzes down to the police station hand in hand, happy as clams. It's not until the detective and Talbert are sitting in a jail cell reminiscing about the good old days that Martin changes them back to their bad old selves.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Norman Alden",
        "nm": 17491,
        "roles": [
          {
            "char": "Frank Tolbert"
          }
        ]
      },
      {
        "name": "Don Haggerty",
        "nm": 353628,
        "roles": [
          {
            "char": "Bank Guard"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E10",
    "title": "The Girl in the Flying Machine",
    "tt": 654552,
    "air_date": "1965-11-14",
    "description": "While Martin is working on his ship, he overcharges the magnetic field which accidentally pulls in a Slobodian astro-ship and its beautiful female pilot from its space orbit. While he figures out how to solve the dilemma, he erases the pilot's memory placing it on Martian tape, and he brings her back to the apartment. Martin tells her she's his niece, Zelda, and that she has a case of amnesia. Zelda is a naturally suspicious person, which is part of the subconscious memory she still retains. Martin figures he can fix Zelda's ship in 24 hours using his own ship as a parts supplier, but is working against two time factors: the space agency has narrowed down where they figure Zelda's ship has crashed, and Mrs. Brown's psychologist nephew, George, is trying to help Zelda unlock her subconscious memory. One further problem is that Mrs. Brown found Zelda's memory tape and has gained Zelda's memory of being an astro-pilot, turning Mrs. Brown into a split personality. Martin manages to fix Zelda's spaceship and transfer her conscious memory back from Mrs. Brown. But he can't overcome Zelda not finding out the truth of the entire situation before she goes off back into space. But Zelda is overcome with generosity to the kind strangers who helped her fix her ship and vows to keep Martin's Martian secret just that: a secret.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Jill Ireland",
        "nm": 409866,
        "roles": [
          {
            "char": "Zelda"
          }
        ]
      },
      {
        "name": "Bernie Kopell",
        "nm": 465728,
        "roles": [
          {
            "char": "George"
          }
        ]
      },
      {
        "name": "Bella Bruck",
        "nm": 115632,
        "roles": [
          {
            "char": "Mrs. Gallup"
          }
        ]
      },
      {
        "name": "Chick Hearn",
        "nm": 372481,
        "roles": [
          {
            "char": "Radio Announcer",
            "voice": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E11",
    "title": "The Time Machine Is Waking Up That Old Gang of Mine",
    "tt": 654563,
    "air_date": "1965-11-21",
    "description": "Martin is still trying to fix his CCTBS - his time travel machine - but it's stuck on the year 1870, the place the state of Missouri. There is a short circuit in the CCTBS, and instead of Martin and Tim being transported back, it transports two figures from 1870 Missouri into Tim's apartment, namely Frank and Jesse James. The trouble is that the James' hold Martin and Tim and ultimately Mrs. Brown hostage, and want to use the CCTBS to pillage history of all its riches. In the present day in the meantime, the James brothers go back to as familiar territory as possible, looking to hold up a train, the closest one being in a deserted \"western\" town. Using some old hats and some recorded gunshots, Martin is able to trick the James' back to their proper time and place. And a simple mind clearing device solves the problem of Mrs. Brown's remembrance of being held at gunpoint by the infamous James brothers.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Mort Mills",
        "nm": 590123,
        "roles": [
          {
            "char": "Jesse James",
            "ch": 1
          }
        ]
      },
      {
        "name": "L.Q. Jones",
        "nm": 428618,
        "roles": [
          {
            "char": "Frank James",
            "ch": 26654
          }
        ]
      },
      {
        "name": "Stafford Repp",
        "nm": 720106,
        "roles": [
          {
            "char": "Railroad Detective"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E12",
    "title": "Avenue C Mob",
    "tt": 654487,
    "air_date": "1965-11-28",
    "description": "Martin temporarily ages himself four hundred Martian years. He has been studying human old age, and figures one can only fully understand it by experiencing it. The one benefit however is that his mind is still as sharp as a tack, since Martian brains don't deteriorate with age. Martin decides that one of his acts as a senior on earth is to take a job as a warehouse night watchman since seniors don't want to be burden to their families. At work, Martin is interrupted by a couple of intruders, two elder spinster sisters, Tessie and Matilda Harvey. Their story: their estate, the possessions of which stored in the warehouse, is managed by Mr. Filbert. They want the proceeds of the estate to open their dream teahouse, however Mr. Filbert doesn't think it's a good idea. Just then, Mr. Filbert drops by the warehouse. He apparently is a thief of historically significant jewels, which he keeps for his own personal pleasure. One jewel, the Raja sapphire, he stores in one of the Harvey's covered chalices at the warehouse. After Filbert leaves, Martin allows the sisters to leave, but not before they pilfer the chalice with the sapphire, which they don't know is encased inside. The sisters eventually do find the sapphire and after hearing on a radio bulletin that it was stolen, bring it to Martin since they don't know what else to do. Martin devises a plan to ransom the sapphire back to Filbert, and plan to catch him red handed with the jewel when he checks to see if it's still in the chalice. They first need to slip the sapphire secretly back into his possession. The independent Harvey sisters try and help, but almost thwart Martin's plan by accidentally knocking him unconscious. Luckily, Martin regains consciousness just in time to carry out the plan to completion. But after all is said and done, Martin learns that old age is only a state on mind, and one can remain young by being contributing citizens to society, much like the Harvey sisters.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Lurene Tuttle",
        "nm": 878354,
        "roles": [
          {
            "char": "Tessie"
          }
        ]
      },
      {
        "name": "Nydia Westman",
        "nm": 922851,
        "roles": [
          {
            "char": "Matilda"
          }
        ]
      },
      {
        "name": "Jamie Farr",
        "nm": 268026,
        "roles": [
          {
            "char": "Benny"
          }
        ]
      },
      {
        "name": "John Crawford",
        "nm": 186833,
        "roles": [
          {
            "char": "Announcer",
            "voice": true
          }
        ]
      },
      {
        "name": "Murray Matheson",
        "nm": 558569,
        "roles": [
          {
            "char": "Filbert"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E13",
    "title": "Tim and Tim Again",
    "tt": 654566,
    "air_date": "1965-12-05",
    "description": "Martin has transformed his duplicating machine to have the duplicates become permanent instead of just temporary. He unfortunately duplicates Tim. So Martin goes off to get a mineral needed to eradicate the duplicate Tim, leaving the two Tims to fend for themselves. The real Tim has a great idea: he will get the duplicate to go off to work, while the real Tim goes on a beach date. However the duplicate Tim has other ideas. He uses Martin's personality changing machine on himself to transpose himself into an evil Tim, one that takes the real Tim's money, takes the real Tim's girl, wants to expose Martin's Martian identity to the world, but most importantly wants to take the real Tim's life by proving he's the original and not the duplicate. Things are complicated by the presence of George, Mrs. Brown's psychologist nephew, who is snooping around. With George's inadvertent help, the duplicate Tim tries to sell the entire story to a magazine. Tim gets down to the magazine's office just in time possibly to thwart the deal. But just as the duplicate almost convinces the publisher that that was the \"duplicate\" that thwarted the deal, Martin shows up. Now Martin has to figure out which Tim is which and which Tim needs to go.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Lauren Gilbert",
        "nm": 318142,
        "roles": [
          {
            "char": "Mr. Abernathy"
          }
        ]
      },
      {
        "name": "Melinda O. Fee",
        "nm": 270273,
        "roles": [
          {
            "char": "Sylvia",
            "as Melinda Fee": true
          }
        ]
      },
      {
        "name": "Steve Franken",
        "nm": 291266,
        "roles": [
          {
            "char": "George"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E14",
    "title": "Loralei Brown vs. Everybody",
    "tt": 654515,
    "air_date": "1965-12-12",
    "description": "Mrs. Brown is more distracted than usual. To help her concentrate, Martin gives her a concentration pill, which will help her focus solely on the first thing she thinks about immediately after taking the pill. However instead of thinking about where she placed a letter for Martin, which is what he originally wanted her to think about, she thinks about police work. She becomes a civilian one-woman police ticket giving machine, for everything from littering to illegal parking. Unfortunately, there are also more dangerous aspects to police work. She buys a short wave radio to monitor police calls, and although Martin tries to watch her every move, he falls asleep while she goes out on a call. The call involves an armed and dangerous criminal holed up in a house. Mrs. Brown manages to elude Det. Brennan and make her way into the house to arrest the criminal. Det. Brennan follows her, then Martin and Tim. Mrs. Brown, Det. Brennan and Tim are all eventually captured by the criminal. It's up to Martin to save them all. Luckily, after all is said and done, the effects of the pill wear off, and Mrs. Brown reverts back to her old scatterbrain self.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Victor French",
        "nm": 294229,
        "roles": [
          {
            "char": "Mugs Carson"
          }
        ]
      },
      {
        "name": "Roy Engel",
        "nm": 257140,
        "roles": [
          {
            "char": "Police Captain"
          }
        ]
      },
      {
        "name": "Charles Stewart",
        "nm": 829260,
        "roles": [
          {
            "char": "Patrolman"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E15",
    "title": "The O'Hara Caper",
    "tt": 654561,
    "air_date": "1965-12-19",
    "description": "Tim wants to use Martin's CCTBS to go back to today's lunch hour. He missed the biggest news story of the year - a robbery of the Beaudelaire jewels, worth $2.5 million - and has been demoted to writing the obituaries, in his mind only one step above the unemployment line. Martin reluctantly agrees. Once back, Tim makes the big mistake of acting like he knows too much about an impending robbery. So after the real thieves come into the store and steal the jewels, Tim is accused of being their look-out man. In discussion with Det. Brennan, Tim accidentally implicates Martin as the mastermind. Tim also identifies the two real thieves - Slippery Sam and Roger the Rake - who the detective identifies as being currently behind bars. Martin goes undercover as a prisoner to find out how Sam and Roger pulled off the heist if they were supposed to be behind bars. After finding out how they escaped, Martin now has to get them to escape again so that Det. Brennan can catch them red-handed with the jewels.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Howard Morton",
        "nm": 607990,
        "roles": [
          {
            "char": "Roger the Rake"
          }
        ]
      },
      {
        "name": "Robert Doyle",
        "nm": 236482,
        "roles": [
          {
            "char": "Slippery Sam"
          }
        ]
      },
      {
        "name": "Bryan O'Byrne",
        "nm": 639930,
        "roles": [
          {
            "char": "Salesman"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E16",
    "title": "Who's Got a Secret?",
    "tt": 654580,
    "air_date": "1965-12-26",
    "description": "Martin's \"EWS\" or Early Warning System - which is akin to human intuition - is going crazy. He soon finds out the cause is Mrs. Brown's big talking mooching brother, Alvin Wannamaker, who has come for a visit. The visit coincides with Mrs. Brown's woman's club defense league luncheon with a General as a guest speaker. Alvin implies to the General that he is working on a top secret project with \"inventor\" Martin, so the General infers it is something that it is something military related that he should have known about all along. The General leaks to the press that there is a secret Project Jiminy that they are racing to complete ahead of the Russians, Project Jiminy being whatever invention Martin and Alvin have on hand. The Department of Defense wants to place Martin on the payroll for Project Jiminy, whatever it is. But Crush, the terrorist organization, also has interest in Project Jiminy, and has kidnapped Alvin because of it. Martin and Tim locate Alvin at Crush headquarters, but Alvin's big plans get Tim and Martin captured as well. Fat Man and Vincent, the two Crush henchman, plan on going to the O'Hara apartment to find the Project Jiminy plans, which they won't find since they don't exist, but they will find Martin's spaceship among other Martian artifacts. Martin's levitation finger and a suggestion of hallucination get them out of trouble. So now all Martin needs is to come up with something for Project Jiminy. He does show his invention both to the US and Russian governments, the invention which could be the first step in ending the cold war.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Gavin MacLeod",
        "nm": 533891,
        "roles": [
          {
            "char": "Alvin Wannamaker",
            "ch": 311433
          }
        ]
      },
      {
        "name": "Larry D. Mann",
        "nm": 542847,
        "roles": [
          {
            "char": "Fat Man",
            "as Larry Mann": true
          }
        ]
      },
      {
        "name": "Ben Wright",
        "nm": 942220,
        "roles": [
          {
            "char": "Vladimir"
          }
        ]
      },
      {
        "name": "John Newton",
        "nm": 628541,
        "roles": [
          {
            "char": "McCarthy"
          }
        ]
      },
      {
        "name": "Donald Briggs",
        "nm": 109022,
        "roles": [
          {
            "char": "General",
            "as Don Briggs": true
          }
        ]
      },
      {
        "name": "James Sikking",
        "nm": 797725,
        "roles": [
          {
            "char": "Fred"
          }
        ]
      },
      {
        "name": "Allen Jaffe",
        "nm": 415428,
        "roles": [
          {
            "char": "Vincent"
          }
        ]
      },
      {
        "name": "Glenn Eckenroth",
        "nm": 2257335,
        "roles": [
          {
            "char": "Cab Driver"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E17",
    "title": "Heir Today, Gone Tomorrow",
    "tt": 654505,
    "air_date": "1966-01-02",
    "description": "Tim stands to inherent some money from the estate of Martha and Ralph O'Hara. The only things standing in his way are a relative, Clarence O'Hara who would inherit the estate otherwise, and Martin, who Clarence insists should not exist in the rightful O'Hara family. He feels he is an authority as his father was county recorder. Tim truly is the rightful heir, and tries to legitimize Martin. Using the CCTBS (the time machine), Tim suggests that Martin go back to January 15, 1920, the day that Martha and Ralph register the name of their newborn son, Frank, and use his Martian powers to get them to name the baby Martin instead. Martin refuses, so Tim takes the CCTBS and embarks on this mission by himself. He is successful in the getting to the records office when he wants, and successful in convincing at least Ralph to name the baby Martin, but not as successful getting home as he winds up in 1945 Cleveland instead. It is a fateful stop as there he finds out that Frank aka Martin has turned out to be a convicted murderer and bank robber. Back in 1965, Martin is a wanted man. So Tim has to hightail it back to 1920 to get Martha and Ralph to change the name of the baby back to Frank. He makes it back and fails to get them to rename the baby Frank. Rather, they have picked Roger. At least it's not Martin. Tim tries to make it back to 1965, but can't. Tim's good at finding the record's office in 1920 and everywhere else but 1965 Los Angeles. The senior Clarence O'Hara, the records clerk, is getting mighty suspicious of Tim in his narrow lapelled suit, and calls in the police to haul Tim off to the mental institution. After some close calls and some more stop offs, Tim eventually does make it back to his apartment in 1965. He's home, but has given up trying to prove he's the real Tim O'Hara as Martin is worth much more to him. Luckily the entire estate was only $4 worth of depreciated stocks.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Allan Melvin",
        "nm": 578510,
        "roles": [
          {
            "char": "Clarence O'Hara"
          }
        ]
      },
      {
        "name": "Jonathan Hole",
        "nm": 354949,
        "roles": [
          {
            "char": "Walter Poppe"
          }
        ]
      },
      {
        "name": "Bruce Glover",
        "nm": 323098,
        "roles": [
          {
            "char": "Ralph O'Hara"
          }
        ]
      },
      {
        "name": "Suzanne Taylor",
        "nm": 853220,
        "roles": [
          {
            "char": "Martha O'Hara",
            "as Sue Taylor": true
          }
        ]
      },
      {
        "name": "Jon Silo",
        "nm": 798151,
        "roles": [
          {
            "char": "Vendor"
          }
        ]
      },
      {
        "name": "Paul Sorensen",
        "nm": 814897,
        "roles": [
          {
            "char": "First Policeman"
          }
        ]
      },
      {
        "name": "Norman Bartold",
        "nm": 58991,
        "roles": [
          {
            "char": "Second Policeman",
            "as Norm Bartold": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E18",
    "title": "Martin's Revoltin' Development",
    "tt": 654523,
    "air_date": "1966-01-16",
    "description": "Tim is sent on assignment with young photographer, Jimmy McClain. Tim isn't looking forward to the experience as Jimmy is a walking disaster zone. Martin knows however that Jimmy has a self-fulfilling failure complex which stems from his childhood, and thus Martin wants to help him out of it. At the story, Jimmy, with Martin's help, gets an exclusive photograph which does include Martin. However Martin is currently photograph invisible. If the photograph is developed and shown, it may disclose Martin's Martian identity. Martin destroys the photograph, and as a result, Jimmy is fired. Martin feels he owes Jimmy, so uses his futuroid camera is find out tomorrow's newspaper's front page headline. It involves notorious gangster Joey Makin. Tim is hesitant to tell Jimmy only because of the potential danger seeing as to Makin's history, but Martin insists. A problem occurs just prior to going off on the story as Jimmy hits Martin's equilibrium machine, which makes Jimmy lose his balance for a temporary period of time. Down at the scene of the crime, Martin helps Jimmy as much as he can using his levitation finger, however the finger goes on the blink. As Joey arrives on the scene, Jimmy takes the photo of the payoff when he falls over, which results in the three of them being captured by Joey and his gang. Martin has one more trick up his sleeve: Martian's primitive method of levitation through sheer concentration. Martin has just enough energy to free Jimmy. Just as Jimmy is ready to head off to get the police, Martin regains use of his levitation finger which he uses to help Jimmy capture Joey and his gang. Not only does Jimmy save the day and get his job back, but has gained self-confidence for the first time in his life.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Michael Conrad",
        "nm": 175700,
        "roles": [
          {
            "char": "A.C."
          }
        ]
      },
      {
        "name": "Nicholas Colasanto",
        "nm": 170225,
        "roles": [
          {
            "char": "Orville"
          }
        ]
      },
      {
        "name": "Barry Russo",
        "nm": 241189,
        "roles": [
          {
            "char": "Joey Makin",
            "as Harry Russo": true
          }
        ]
      },
      {
        "name": "Duane Grey",
        "nm": 340558,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "Claude Johnson",
        "nm": 424804,
        "roles": [
          {
            "char": "Jimmy McClain"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E19",
    "title": "TV or Not TV",
    "tt": 654546,
    "air_date": "1966-01-23",
    "description": "Martin's internal transmitter is short circuiting. Intermittently, he becomes 'the' television transmitter worldwide, overtaking all regular television programming. His eyes are the camera. In the meantime, he has a special pair of sunglasses to wear that will block the transmitter. He needs some wiring from a television camera to fix the short circuit. Luckily Tim needs to go down to the television station on assignment. He has to interview matinée idol Chad Foster. So Martin tags along with Tim. When Martin is introduced to Chad, Chad admires his sunglasses. Martin thinks it's safe enough to let Chad try on the glasses as his transmitter has been inactive for some time. Chad does try them on, but just as he is about to give them back to Martin, the glasses get caught on his hair and Tim accidentally steps on Chad's robe, which comes off. This exposes Sam Finch, the real identity of Chad Foster. Chad Foster's persona was created in part by a toupee, shoulder/chest/thigh pads, lifts in his shoes and a girdle. Sam Finch is bald, short, not muscular with a slight paunch. Unfortunately, this exposure occurs just as Martin's transmitter turns on, broadcasting the true identity of Chad Foster to the entire television viewing public. Chad's career is now in jeopardy. Martin comes up with a plan to save Chad's show business career. Martin has witnessed Sam Finch's self-deprecating and humorous view of himself and life in general, and wants Tim to interview Chad/Sam once again, and again without Chad's knowledge that it is being broadcast to the world. This interview will recreate the persona of Chad Foster, matinée idol, into Chad Foster, funny-man. Chad's show business career is saved.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Conrad Janis",
        "nm": 417641,
        "roles": [
          {
            "char": "Chad Foster"
          }
        ]
      },
      {
        "name": "Patricia Smith",
        "nm": 809514,
        "roles": [
          {
            "char": "Peggy Reynolds"
          }
        ]
      },
      {
        "name": "Dan Frazer",
        "nm": 292498,
        "roles": [
          {
            "char": "Clete Baxter"
          }
        ]
      },
      {
        "name": "Chick Hearn",
        "nm": 372481,
        "roles": [
          {
            "char": "Announcer"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E20",
    "title": "The Man from Uncle Martin",
    "tt": 654556,
    "air_date": "1966-01-30",
    "description": "Mrs. Brown's brother, Alvin, has another hair-brained, get rich scheme. His new fangled machine, Wannamaker's Widdle Wife Saver, is a housewife's answer to chores - it cleans, it vacuums, it mows lawns among other things. Or so it's supposed to once Martin puts it together. It's a piece of junk that even Martin can't salvage. Martin and Tim decide to try and sell it back to the man from who Alvin bought it, only because Alvin used Loralei's $500 to buy it. Dr. Dunlap ends up being a bigger swindler than Alvin is but pretends not to be, but Martin and Tim convince Dunlap that the machine is a goldmine. They also almost convince Alvin that it really is a piece of junk and he should get the money back. That is until Alvin and Loralei see Martin do some Martian trickery with the machine. Martin goofed big time. So Martin and Tim, pretend to want to act as backers for the machine with Dunlap, but also go incognito as executives of a large electronics firm backing Alvin and the machine in an effort to sell it back to Dunlap without, as Martin and Tim, really wanting to invest as Dunlap's potential backers.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Gavin MacLeod",
        "nm": 533891,
        "roles": [
          {
            "char": "Alvin Wannamaker",
            "ch": 311433
          }
        ]
      },
      {
        "name": "Arthur Malet",
        "nm": 539395,
        "roles": [
          {
            "char": "Dr. Thaddius Dunlap"
          }
        ]
      },
      {
        "name": "John Lasell",
        "nm": 489499,
        "roles": [
          {
            "char": "Mr. Morgan"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E21",
    "title": "Martin, the Mannequin",
    "tt": 654524,
    "air_date": "1966-02-06",
    "description": "Martin is having some problems at a department store: there is a chemical in the cologne, Homme Fatale, that has turned him into a mannequin, a fate that could be permanent unless he gets blasted by some molecular revitalizing rays from his ray gun. The store's floor manager won't let Tim take the mannequin or buy the mannequin at that, so he has to go home and get the gun and bring it to the store. As soon as Tim gets back, Mrs. Brown and Det. Brennan also show up at the department store on a shopping spree. Tim can't shoot Martin in such a visible setting, so tries to get a a young boy to play toy gun with him. Unfortunately he shoots Mrs. Brown instead, turning her into a mannequin as well. Tim manages to unfreeze Martin from his mannequin state, but doing so for Mrs. Brown is a little more complicated as Det. Brennan is also searching for her. Martin has to keep the detective preoccupied, while Tim gives her the antidote: a whiff of Homme Fatale, of which the store has run out. Tim has to track down the last bottle just sold, or else Mrs. Brown will remain frozen forever.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Eve McVeagh",
        "nm": 574670,
        "roles": [
          {
            "char": "Mother"
          }
        ]
      },
      {
        "name": "Teddy Quinn",
        "nm": 704006,
        "roles": [
          {
            "char": "Alfred"
          }
        ]
      },
      {
        "name": "Don Washbrook",
        "nm": 913334,
        "roles": [
          {
            "char": "Howard"
          }
        ]
      },
      {
        "name": "Chanin Hale",
        "nm": 354871,
        "roles": [
          {
            "char": "Sales Girl"
          }
        ]
      },
      {
        "name": "Janie Kelly",
        "nm": 2212045,
        "roles": [
          {
            "char": "Young Woman"
          }
        ]
      },
      {
        "name": "Woodrow Parfrey",
        "nm": 661416,
        "roles": [
          {
            "char": "Floor Manager"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E22",
    "title": "Butterball",
    "tt": 802788,
    "air_date": "1966-02-13",
    "description": "Martin must again go up against the CRUSH organization when Tim is kidnapped by Butterball.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Larry D. Mann",
        "nm": 542847,
        "roles": [
          {
            "char": "Butterball"
          }
        ]
      },
      {
        "name": "Eileen O'Neill",
        "nm": 642149,
        "roles": [
          {
            "char": "Delilah"
          }
        ]
      },
      {
        "name": "Kathryn Minner",
        "nm": 591487,
        "roles": [
          {
            "char": "Mama"
          }
        ]
      },
      {
        "name": "Tony Martinez",
        "nm": 553729,
        "roles": [
          {
            "char": "Glob"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E23",
    "title": "When a Martian Makes His Violin Cry",
    "tt": 654578,
    "air_date": "1966-02-20",
    "description": "Mrs. Brown's purse is stolen at a carnival. Det. Brennan automatically suspects Raymond, a gypsy, only because the detective thinks all gypsies are crooked. Martin knows Raymond didn't do it. But because the detective hauls Raymond off to jail, Raymond places a curse on Mrs. Brown. For her, the curse is a self-fulfilling prophecy. Martin thinks that he can help Mrs. Brown get over the thought of the curse - that everything will slip through her fingers - by becoming invisible and holding onto things for her. Unfortunately, Martin's antenna are temporarily malfunctioning, so he can't disappear. The only other option is to have the curse lifted. Raymond won't do that since the detective won't release him from jail. In fact, he places the same curse on the detective, who scoffs and laughs at the curse on him. Brennan is on a spree of rounding up all gypsies for a recent spate of crimes. This doesn't bode well for Martin, who's next plan is to go undercover as a gypsy and remove the curse from Mrs. Brown. Just before he can do so, Brennan arrests him. Just as Brennan is about to book all the gypsies down at the police station, Martin announces that he has lifted the curse from Mrs. Brown and has placed a curse on the detective. Just hearing that cures Mrs. Brown. However, Martin requires a little Martian trickery to enact the curse on Brennan. Unlike Mrs. Brown, Brennan, a metaphysics junkie, really does believe he has a curse and is happy about it, as he can be observed as a scientific marvel. And the real thief of Mrs. Brown's purse is apprehended and is not a gypsy.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "John Considine",
        "nm": 175912,
        "roles": [
          {
            "char": "Raymond"
          }
        ]
      },
      {
        "name": "Penny Santon",
        "nm": 763842,
        "roles": [
          {
            "char": "Grandmother"
          }
        ]
      },
      {
        "name": "Len Lesser",
        "nm": 504335,
        "roles": [
          {
            "char": "Carlo"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Narita"
          }
        ]
      },
      {
        "name": "Roy Engel",
        "nm": 257140,
        "roles": [
          {
            "char": "The Police Chief"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E24",
    "title": "When You Get Back to Mars, Are You Going to Get It",
    "tt": 654577,
    "air_date": "1966-02-27",
    "description": "Another Martian spacecraft crash lands on Earth. It happens to be Martin's 11-year old nephew, Andromeda, who has come to Earth since he got lost in a cosmic storm. Andromeda is a proud Martian, who can't understand why Martin has taken on so many Earthly attributes, including the name Martin (his real name is Exigius 12-1/2). Andromeda refuses to wear Earth clothes or take on the name \"Andy\". He even tells the truth to Mrs. Brown and Det. Brennan, who think he just has an active child's imagination. But the detective is wary about the O'Hara's ability to raise a child, and threaten to call in the authorities unless he gets a proper education. This means that Andy has to go to school. But Andy again refuses to hide his Martian background and demonstrates his Martian abilities to his teacher and classmates, who are all afraid for their lives by this obvious alien. Andy is hurt by their attitude, but Martin tried to warn him. The military and police force are called out to locate Martin and Andy and Tim, all considered alien and hostile. The only person who still sees them as friendly is Mrs. Brown. But she cannot change the minds of the rest of the world. Luckily, Martin can use his CCTBS - his time machine - to take the three of them back in time to just before Andy heads off to school and when the trouble began. Andy has learned his lesson. In the meantime, Tim has another Martian house-guest and a new \"cousin\".",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Wayne Stam",
        "nm": 2122211,
        "roles": [
          {
            "char": "Andy"
          }
        ]
      },
      {
        "name": "Mary Gregory",
        "nm": 339889,
        "roles": [
          {
            "char": "Miss Thorenson"
          }
        ]
      },
      {
        "name": "Bobby Horan",
        "nm": 394522,
        "roles": [
          {
            "char": "First Boy"
          }
        ]
      },
      {
        "name": "Robert Roter",
        "nm": 1510169,
        "roles": [
          {
            "char": "Second Boy"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E25",
    "title": "Doggone Martian",
    "tt": 654493,
    "air_date": "1966-03-06",
    "description": "Tim finds a lost dog and brings him home hoping that Martin can find out from the dog where he lives. It ends up not being lucky for Martin since the dog, Tutu, drinks Martin, turning Tutu into a talking dog. You see, Martin's new gizmo has the ability to distillate animal and vegetative matter down to their water form, and to reverse the process to return the objects back to the original state. He distillates himself to be light enough to escape Earth's gravity, and with Tim's help in launching his spaceship, to return back to Mars. But first, he now has to separate himself from Tutu. But before that happens, Tutu gets caught by the dog catcher and gets sent down to the dog pound, from where Tutu's real owner picks her up. So when Tim goes down to the pound, he knows he's on the right track when the dog catcher tells tales about hearing voices when only dogs were around. At the home of the Frisby's, Tutu's owners, Tim has to convince them to let him have Tutu if only for a short time, especially since they hear Tutu talk and think she's a goldmine. Tim also has to get over Bernard Frisby's suspicions that Tim is his wife's lover. Tim is ultimately successful in the former but not in the latter, and gets a black eye from Bernard's fist in the process. But at least he gets Tutu and by association Martin home to transform Martin back. It does take a couple of tries, but they do manage to separate Tutu and Martin successfully. Unfortunately in doing so, they used up the rare Martian chemical Martin had on hand needed to distillate. Martin's plan to return back to Mars is once again put on hold.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Sarah Marshall",
        "nm": 551163,
        "roles": [
          {
            "char": "Mrs. Frisby"
          }
        ]
      },
      {
        "name": "James Frawley",
        "nm": 292419,
        "roles": [
          {
            "char": "Bernard Frisby"
          }
        ]
      },
      {
        "name": "Robert Ball",
        "nm": 50451,
        "roles": [
          {
            "char": "Dog Catcher"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E26",
    "title": "Virus M for Martian",
    "tt": 654575,
    "air_date": "1966-03-13",
    "description": "Tim arrives home a day earlier than expected from his Mexican assignment. Despite a Keep Out sign on his apartment door, Tim enters - it is his own apartment - and is exposed to a Martian virus, causing red striping across his face. Before Martin can give him the antidote, Det. Brennan stops by and sees Tim's striping. He automatically assumes that Tim has brought back a tropical virus and calls for an ambulance to take him to the hospital. Martin and Tim manage to elude Brennan once at the hospital, where Tim goes undercover, literally, by wrapping his head with medical bandages. Being unrecognizable, he is mistaken for a missing patient who is supposed to be in surgery, and is given a general anesthetic in prep for surgery. Martin manages to find Tim before he goes under the knife, but Martin now can't give him the antidote because of the possible dangerous side effect from the anesthetic. Tim now has to ride out the course of the virus, additional symptoms include emitting vacillating extreme hot and cold molecules, which in turn affect everything around him. So Martin has to keep Tim in isolation, all the while Brennan is still searching them out.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Gilbert Green",
        "nm": 337872,
        "roles": [
          {
            "char": "Dr. Carson"
          }
        ]
      },
      {
        "name": "Jack Collins",
        "nm": 172355,
        "roles": [
          {
            "char": "Sam"
          }
        ]
      },
      {
        "name": "Jamie Farr",
        "nm": 268026,
        "roles": [
          {
            "char": "Fred"
          }
        ]
      },
      {
        "name": "Paula Stewart",
        "nm": 829723,
        "roles": [
          {
            "char": "Nurse Jones"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E27",
    "title": "Our Notorious Landlady",
    "tt": 654534,
    "air_date": "1966-03-20",
    "description": "Mrs. Brown gets zapped by Martin's personality altercator. There doesn't seem to be any outward effect from the blast, however this façade is part of her personality change. She has absorbed all the contents of Tim's book, The Criminal Mind, and solely has theft on the brain. She shoplifts some small items, not too much of an issue since Martin and Tim plan on taking them all back. But some information Det. Brennan passes along to her regarding his security of the Slotkin Diamond makes her think of the bigger catch. However before she can steal it, someone beats her to the punch. Martin and Tim, and by snooping, Mrs. Brown find out the real thief is the security guard hired to transport the diamond, Jack Plummer. Now all Martin and Tim have to do is beat Mrs. Brown to Jack and the diamond and lead Det. Brennan to the thief without implicating either themselves or Mrs. Brown. And of course, they have to give Mrs. Brown an antidote to cure her of her thieving ways.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Roy Engel",
        "nm": 257140,
        "roles": [
          {
            "char": "The Police Chief"
          }
        ]
      },
      {
        "name": "Hal Baylor",
        "nm": 63113,
        "roles": [
          {
            "char": "Security Guard Jack Plummer"
          }
        ]
      },
      {
        "name": "Peter Brocco",
        "nm": 110480,
        "roles": [
          {
            "char": "Curator"
          }
        ]
      },
      {
        "name": "R.N. Bullard",
        "nm": 120032,
        "roles": [
          {
            "char": "First Guard"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E28",
    "title": "Martin Meets His Match",
    "tt": 654519,
    "air_date": "1966-03-27",
    "description": "Martin is having some troubles with his spaceship, so he calls in some help from an old friend, one of the greatest minds ever on Earth: Leonardo Da Vinci. Da Vinci has other things on his mind than helping Martin. He is dismayed at life in the 20th century: how his inventions have been credited to others, and how his painting, La Gioconda, has been renamed the Mona Lisa. In his mind, all those have been stolen from him. The Mona Lisa is currently on loan to a local museum, for which Det. Brennan is in charge of security. Da Vinci sneaks out of the O'Hara apartment to collect some of what he considers to be his personal belongings, including the painting, all in an effort to take home with him to the 15th century. Martin is afraid that he'll be able to figure out how to use the CCTBS to do so. Martin and Tim find Da Vinci back at the apartment ready to take off back to the 15th century with among other things the Mona Lisa, and in an effort to stop him, Tim destroys the painting. To preserve history, they ask Da Vinci to paint a new version of the painting. Needing a model, they use an unsuspecting Mrs. Brown. Da Vinci completes the painting, in his mind greater than the first, but a Mrs. Brown likeness of the Mona Lisa and not what the world knows as the Mona Lisa. Da Vinci refuses to compromise his artistic integrity, so Martin is forced to recreate the Mona Lisa himself. It may no longer be a true Da Vinci, but it'll fool the world. Da Vinci is satisfied, and takes off back to the 15th century solely with his new masterpiece, the Mona Loralei. Or so Martin and Tim think.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Michael Constantine",
        "nm": 176073,
        "roles": [
          {
            "char": "Leonardo da Vinci",
            "ch": 29220
          }
        ]
      },
      {
        "name": "Joe Higgins",
        "nm": 383414,
        "roles": [
          {
            "char": "First Guard"
          }
        ]
      },
      {
        "name": "Billy M. Greene",
        "nm": 338684,
        "roles": [
          {
            "char": "Second Guard",
            "as Billy Greene": true
          }
        ]
      },
      {
        "name": "David Bond",
        "nm": 20200,
        "roles": [
          {
            "char": "Curator"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E29",
    "title": "Horse and Buggy Martin",
    "tt": 654507,
    "air_date": "1966-04-03",
    "description": "Martin has a mosquito bite, from which he is suffering from symsymsympatheticus. This is an affliction where the next person bitten by the mosquito has a bit of Martin residue in him/her, and Martin is feeling everything that next person is feeling. But what if the next person isn't a person, but a horse? It ends up being not only a horse, but a race horse named Sweet Sister, who is running better than ever. Martin needs a blood sample from Sweet Sister to develop an antidote, and he manages to do so posing as a vet. Mistaking the taking of the blood sample as a doping scam, William, a betting syndicate member, slips Sweet Sister a drugged apple to make her take a fall in the race, which in turn knocks Martin out as well. Despite being drugged, Martin thinks that sheer will power emitted through the molecule of him still in Sweet Sister may be enough to overcome the effects of the drug and have Sweet Sister win the race. Martin is able to do it with a little help from Tim and Sweet Sister's owner, Kerry Green.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Trevor Bardette",
        "nm": 54253,
        "roles": [
          {
            "char": "Grandpa Kelly Green"
          }
        ]
      },
      {
        "name": "Janis Hansen",
        "nm": 360876,
        "roles": [
          {
            "char": "Kerry Green"
          }
        ]
      },
      {
        "name": "Craig Curtis",
        "nm": 193299,
        "roles": [
          {
            "char": "Arnold O'Reilly"
          }
        ]
      },
      {
        "name": "Bern Hoffman",
        "nm": 388822,
        "roles": [
          {
            "char": "Williams"
          }
        ]
      },
      {
        "name": "Joe Hernandez",
        "nm": 379601,
        "roles": [
          {
            "char": "Announcer"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E30",
    "title": "Stop the Presses, I Want to Get Off",
    "tt": 815531,
    "air_date": "1966-04-17",
    "description": "Mrs. Brown once again walks in front of one of Martin's gizmos. This time, Martin was in the process of cleaning out his \"sixth sense\" as humans call it and reinserting it back into his body via his regenerating machine, but now Mrs. Brown is in possession of Martin's sixth sense. Three problems arise: Mrs. Brown is now suspicious of Martin since Martin wants his sixth sense back from her, Brennan breaks the regenerator which will take Martin a couple of days to fix, and the sixth sense becomes stronger over time to a point when Mrs. Brown will become aware of Martin's Martian identity. With her new sixth sense, Mrs. Brown becomes a reporter for Tim's rival newspaper, The Chronicle, scooping Tim and The Sun on all the stories. Out of a job, Tim follows Mrs. Brown on her latest scoop, as does Det. Brennan who figures it has something to do with his latest case of an escaped lion. He's right which means that Tim, Mrs. Brown and Det. Brennan are all in danger. Martin shows up just in time with the repaired regenerator, first placating the lion, then getting his sixth sense back from Mrs. Brown, just before she is ready to spill the beans on him to the detective. With a little Martian trickery, Martin is able to make Mrs. Brown lose her scoop and the detective lose his standing with the Police Chief by turning the lion into a pussycat. Everything is back to normal in their collective worlds.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Roy Engel",
        "nm": 257140,
        "roles": [
          {
            "char": "The Police Chief"
          }
        ]
      },
      {
        "name": "Zamba",
        "nm": 3815917,
        "roles": [
          {
            "char": "The Lion",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E31",
    "title": "My Nut Cup Runneth Over",
    "tt": 654527,
    "air_date": "1966-04-24",
    "description": "Martin's malfunctioning molecular reassembler is what Tim uses to accidentally turn a squirrel into a human being. Martin has to fix the reassembler within 8 hours or else \"Red\" as they've coined him will be permanently changed to that of a human. In the meantime, Red's family moves in with the O'Hara's until he can be changed back to his proper squirrel state. Problems arise when Det. Brennan and Mrs. Brown come for a visit and notice a squirrel entering the apartment. The detective talks about calling in an exterminator to which Red takes offense and runs off. Tim finds him in an obvious location, a nut shop. To explain Red's conviction to the store clerk and the police called in that he's a squirrel, Martin states that they are a singing group called the Squirrels performing at that evening's Police Follies. They do perform at the Follies, much in the same vein as the Chipmunks, before they take Red home to transform him back to his proper state.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Pamela Britton",
        "nm": 110219,
        "roles": [
          {
            "char": "Mrs. Lorelei Brown",
            "ch": 60841
          }
        ]
      },
      {
        "name": "Alan Hewitt",
        "nm": 382003,
        "roles": [
          {
            "char": "Det. Bill Brennan"
          }
        ]
      },
      {
        "name": "Hal England",
        "nm": 257435,
        "roles": [
          {
            "char": "Red Squirrelton"
          }
        ]
      },
      {
        "name": "Lee Krieger",
        "nm": 471199,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "Christine Burke",
        "nm": 121636,
        "roles": [
          {
            "char": "Nancy"
          }
        ]
      },
      {
        "name": "Nora Denney",
        "nm": 219372,
        "roles": [
          {
            "char": "Woman"
          }
        ]
      },
      {
        "name": "Roy Engel",
        "nm": 257140,
        "roles": [
          {
            "char": "The Police Chief"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E32",
    "title": "Pay the Man the $24",
    "tt": 654535,
    "air_date": "1966-05-01",
    "description": "Tim uses Martin's CCTBS to go back to do some research for his historical novel on the 1626 sale of Manhattan from the Indians to the Dutch. Apparently, while back in time, Tim accidentally implied to Chief Buffalo that the $24 or 60 guilder sale price was a steal, the Chief thinking that he meant that Peter Minuit is trying to steal the island. This prevents the sale, so in the present day, what is now New York does not belong to the United States. Martin and Tim need to go back to 1626 Manhattan to rectify the situation. Martin is a good mediator, but the negotiations hit a snag when Chief Buffalo's daughter, Little Feather, takes a liking to Tim. Unbeknownst to Tim, he and Little Feather get engaged, and as a wedding gift, Chief Buffalo wants to give Manhattan to Tim. They need to find Little Feather's true mate to be, Young Deer, to get Tim out of this mess and get the sale of the island back on track. Ultimately, Martin needs to act as the Great Warrior Spirit to convince Chief Buffalo to do all the right things.",
    "cast": [
      {
        "name": "Ray Walston",
        "nm": 1827,
        "roles": [
          {
            "char": "Uncle Martin",
            "ch": 35979
          }
        ]
      },
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tim O'Hara",
            "ch": 35980
          }
        ]
      },
      {
        "name": "Herbert Ellis",
        "nm": 254870,
        "roles": [
          {
            "char": "Chief Buffalo",
            "as Herb Ellis": true
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Little Feather"
          }
        ]
      },
      {
        "name": "Michael Carr",
        "nm": 139801,
        "roles": [
          {
            "char": "Young Deer"
          }
        ]
      },
      {
        "name": "Herb Andress",
        "nm": 28459,
        "roles": [
          {
            "char": "Assistant",
            "as Herb Andreas": true
          }
        ]
      },
      {
        "name": "Gigi Verone",
        "nm": 894778,
        "roles": [
          {
            "char": "Indian Girl"
          }
        ]
      },
      {
        "name": "Leon Askin",
        "nm": 39169,
        "roles": [
          {
            "char": "Peter Minuit",
            "ch": 243522
          }
        ]
      }
    ]
  }
]
