[
  {
    "se": "S01E01",
    "title": "Go, White Lion!",
    "tt": 3613920,
    "air_date": "1965-01-01",
    "description": "Caesar, the great white lion and king of the jungle, wants all animals to live together peacefully. He even releases the villagers' animals so they can live freely.",
    "cast": null
  },
  {
    "se": "S01E02",
    "title": "The Wind in the Desert",
    "tt": 3613798,
    "air_date": "1965-01-01",
    "description": "When Kimba returns home he finds the jungle ruled by a cruel tyrant, Claw. The animals look to him for leadership, but he is captured by a greedy hunter.",
    "cast": null
  },
  {
    "se": "S01E03",
    "title": "A Human Friend",
    "tt": 3613868,
    "air_date": "1965-01-01",
    "description": "Roger and his friend Mary are lost in the jungle. Mary runs off in a panic and meets Geraldine Giraffe. The startled Geraldine loses her footing and breaks her leg.",
    "cast": null
  },
  {
    "se": "S01E04",
    "title": "Great Caesar's Ghost",
    "tt": 3613838,
    "air_date": "1965-01-01",
    "description": "Samson, the water buffalo, does not go along with Kimba's ideas that all animals should enjoy peace and freedom. In fact, he prefers some of them as food!",
    "cast": null
  },
  {
    "se": "S01E05",
    "title": "Fair Game",
    "tt": 3613786,
    "air_date": "1965-01-01",
    "description": "Kimba is puzzled by the behavior of Speedy Cheetah, who is fighting with everyone, particularly Kimba. Speedy believes that Kimba's father was responsible for the death of his grandfather.",
    "cast": null
  },
  {
    "se": "S01E06",
    "title": "Jungle Thief",
    "tt": 3613860,
    "air_date": "1965-01-01",
    "description": "The animals are in trouble! A thief has stolen their emergency food supplies right in the middle of a drought.",
    "cast": null
  },
  {
    "se": "S01E07",
    "title": "Battle at Dead River",
    "tt": 3613852,
    "air_date": "1965-01-01",
    "description": "When Kimba rescues Kitty, a lovely lioness cub, Claw returns with a vengeance! With the help of the leopard Cassius, Claw begins to turn the animals against our hero.",
    "cast": null
  },
  {
    "se": "S01E08",
    "title": "The Insect Invasion",
    "tt": 3613832,
    "air_date": "1965-01-01",
    "description": "Kimba has convinced the meat-eating animals to change to vegetables so that the smaller animals can live without fear of being attacked.",
    "cast": null
  },
  {
    "se": "S01E09",
    "title": "The Flying Tiger",
    "tt": 3613880,
    "air_date": "1965-01-01",
    "description": "When Kimba meets a flying tiger named Flyger, his troubles are just beginning. The result of a crazed experiment, Flyger feels like a freak of nature and has become the terror of the jungle.",
    "cast": null
  },
  {
    "se": "S01E10",
    "title": "Two Hearts and Two Minds",
    "tt": 3613836,
    "air_date": "1965-01-01",
    "description": "Kimba has a dream that Kitty is in danger. Pauley Parrot suggests he travel to Kitty's jungle just to make sure she is all right.",
    "cast": null
  },
  {
    "se": "S01E11",
    "title": "Catch 'Em If You Can",
    "tt": 3613858,
    "air_date": "1965-01-01",
    "description": "Kimba recounts one of the worst battles he ever had: the time when Tonga decided to have a hunting contest and brought to Africa three of the greatest hunters in the world.",
    "cast": null
  },
  {
    "se": "S01E12",
    "title": "The Hunting Ground",
    "tt": 3613818,
    "air_date": "1965-01-01",
    "description": "At \"The Hunting Ground\" hunters are allowed to pay a fee and hunt any of the animals. Their greed has reduced the number of animals available.",
    "cast": null
  },
  {
    "se": "S01E13",
    "title": "The Trappers",
    "tt": 3613828,
    "air_date": "1965-01-01",
    "description": "Viper Snakely and his sidekick masquerade as professors studying animal habits to gain the confidence of the animals and Roger Ranger.",
    "cast": null
  },
  {
    "se": "S01E14",
    "title": "Journey Into Time",
    "tt": 3613878,
    "air_date": "1965-01-01",
    "description": "Kimba plans to attend the Lion Convention but King Specklerex, the leader of the tribe organizing the event, knew Kimba's father and was so jealous of his wisdom and strength that he argues that Kimba with his white fur is not even a lion and banishes him.",
    "cast": null
  },
  {
    "se": "S01E15",
    "title": "Scrambled Eggs",
    "tt": 3613806,
    "air_date": "1965-01-01",
    "description": "Kimba, who is running a school for all the young animals, decides to hold a Spring Cleaning Day.",
    "cast": null
  },
  {
    "se": "S01E16",
    "title": "Diamonds in the Gruff",
    "tt": 3613856,
    "air_date": "1965-01-01",
    "description": "Two nasty and mean diamond smugglers are passengers aboard a plane flying over Kimba's kingdom.",
    "cast": null
  },
  {
    "se": "S01E17",
    "title": "The Magic Serpent",
    "tt": 3613874,
    "air_date": "1965-01-01",
    "description": "Kimba is attempting to teach his schoolmates a lesson in tolerance. Rancid, the Reeky Bird, smells bad only because his diet consists mainly of stinkweed.",
    "cast": null
  },
  {
    "se": "S01E18",
    "title": "The Runaway",
    "tt": 3613782,
    "air_date": "1965-01-01",
    "description": "Gargoyle G. Warthog is so ugly that he's sure that no one wants him around and so he runs away. When Kimba and the others find him, they convince him that they are his friends and his mother loves him.",
    "cast": null
  },
  {
    "se": "S01E19",
    "title": "The Mystery of the Deserted Village",
    "tt": 3613854,
    "air_date": "1965-01-01",
    "description": "Claw has lured Kimba to the \"deserted village\" on the pretext that he wants to make up and be friends.",
    "cast": null
  },
  {
    "se": "S01E20",
    "title": "Restaurant Trouble",
    "tt": 3613812,
    "air_date": "1965-01-01",
    "description": "Because some animals are always fighting over food, Kimba and friends decide that an animal restaurant would solve the problem.",
    "cast": null
  },
  {
    "se": "S01E21",
    "title": "The Bad Baboon",
    "tt": 3613824,
    "air_date": "1965-01-01",
    "description": "Big-0, another mandrill baboon who had been beaten by Daniel many years before, returns to get his revenge. Kimba tries to stop the battle because Daniel Baboon is now too old and the fight would not be fair.",
    "cast": null
  },
  {
    "se": "S01E22",
    "title": "Dangerous Journey",
    "tt": 3613846,
    "air_date": "1965-01-01",
    "description": "The jungle is threatened by an epidemic. The only cure can be found from a tree at the top of a mountain.",
    "cast": null
  },
  {
    "se": "S01E23",
    "title": "The Gigantic Grasshopper",
    "tt": 3613850,
    "air_date": "1965-01-01",
    "description": "Daniel Baboon is wakened by a tremendous earthquake, but none of the other animals feel it.",
    "cast": null
  },
  {
    "se": "S01E24",
    "title": "Gypsy's Purple Potion",
    "tt": 3613792,
    "air_date": "1965-01-01",
    "description": "Cassius, Claw's former henchman, has a plan to destroy Kimba and take over the jungle.",
    "cast": null
  },
  {
    "se": "S01E25",
    "title": "Too Many Elephants",
    "tt": 3613918,
    "air_date": "1965-01-01",
    "description": "Mr. Pompous, Roger Ranger's uncle, has come to the jungle to convince Roger to return to civilization. He tells the Ranger that the animals at the game preserve are no longer safe as the rules have changed.",
    "cast": null
  },
  {
    "se": "S01E26",
    "title": "A Revolting Development",
    "tt": 3613802,
    "air_date": "1967-01-01",
    "description": "Claw and Cassius are stirring up the other animals who are tired of eating only insects and vegetables. It is Calvin Hottage and Kimba who search for the ultimate meat substitute and hopefully everyone can be happy again.",
    "cast": null
  },
  {
    "se": "S01E27",
    "title": "The Chameleon Who Cried Wolf",
    "tt": 3613822,
    "air_date": "1967-01-01",
    "description": "Small and low on the food chain,it is Newton who has taken to making up big stories and spreading them around the jungle.To the dismay of the other animals,Kimba befriends Newton. Newton's many lies are catching up fast and no one wants to believe him when he needs help. Can Kimba convince his friends to help Newton now that he really needs help?",
    "cast": null
  },
  {
    "se": "S01E28",
    "title": "The Wild Wildcat",
    "tt": 3613788,
    "air_date": "1967-01-01",
    "description": "Kimba has to figure out why Wiley Wildcat is making trouble, especially for his friend Dan'l Baboon and his diner. Kimba resolves to stop him but discovers Wiley just may have had a good reason for acting the way he has.",
    "cast": null
  },
  {
    "se": "S01E29",
    "title": "The Nightmare Narcissus",
    "tt": 3613816,
    "air_date": "1967-01-01",
    "description": "Dr Spee's experiment with some flowers goes awry and anyone who smells the strange flower is beset with horrible nightmares. The animals are unsure what is a nightmare and what is reality.",
    "cast": null
  },
  {
    "se": "S01E30",
    "title": "Adventure in the City",
    "tt": 3613790,
    "air_date": "1967-01-01",
    "description": "KItty's uncle Specklerex comes for a visit and challenges Kimba to a series of contests to prove he is worthy of his heritage.",
    "cast": null
  },
  {
    "se": "S01E31",
    "title": "City of Gold",
    "tt": 3613800,
    "air_date": "1967-01-01",
    "description": "KImba makes a journey to the legendary city made entirely of gold. After learning of his nemesis friends,Tom and Tab, have gotten themselves lost, Kimba undertakes the dangerous mission to the city which was buried by massive earthquakes to find them. Kimba faces incredible dangers to save the pair of hyenas from a certain death.",
    "cast": null
  },
  {
    "se": "S01E32",
    "title": "The Last Poacher",
    "tt": 3613808,
    "air_date": "1967-01-01",
    "description": "Seymour Hart is a ranger on a wild life preserve that is believed to be a safe place for animals. His job in protecting the animals is in trouble when poachers invade and Seymour is gravely injured. Bucky and Pauley Cracker allow themselves to be captured by hunters in hopes of finding the location of the poachers leader and ridding the preserve of the hunters once and for all.",
    "cast": null
  },
  {
    "se": "S01E34",
    "title": "Jungle Fun",
    "tt": 3613830,
    "air_date": "1967-01-01",
    "description": "The jungle animals want to start their very own amusement park which proves to be a daunting task. While undertaking the construction of the amusement park Kimba has to contend with his father's arch enemy Claw. To help in his war with Kimba, Claw has help from Cassius, the black panther and the hyenas Tom and Tab.",
    "cast": null
  },
  {
    "se": "S01E35",
    "title": "The Pretenders",
    "tt": 3613872,
    "air_date": "1967-01-01",
    "description": "Claw sabotages Kimba's new amusement park in retaliation for building it on his hunting territory. Kimba is seriously injured when the roller coaster is tampered with and Claw has help with Cassius,Tom and Tab to turn Kimba's friends against him.",
    "cast": null
  },
  {
    "se": "S01E36",
    "title": "The Monster of Petrified Valley",
    "tt": 3613810,
    "air_date": "1967-01-01",
    "description": "Kimba discovers Colosso, the last survivor of a race of giant birds, after rescuing Charlie and Harley Cheetah from Petrified Valley. Colosso is invited to Kimba's jungle but can't fit in.",
    "cast": null
  },
  {
    "se": "S01E37",
    "title": "Legend of Hippo Valley",
    "tt": 3613848,
    "air_date": "1967-01-01",
    "description": "An ancient well has a message for everyone, from ancient human history to the current hippopotamuses who claim it... while the animals' farm is in desperate need of water during the current drought.",
    "cast": null
  },
  {
    "se": "S01E38",
    "title": "Volcano Island",
    "tt": 3613784,
    "air_date": "1967-01-01",
    "description": "While Kimba takes the children at school on a field trip to Volcano Island, Boss Rhino is busy there trying to make way for a female rhino that's about to give birth. Boss Rhino demands that Kimba leaves, but when Kimba refuses, he is forced to accept Boss Rhino's challenge to a match. The two fight, and both end up equally injured.",
    "cast": null
  },
  {
    "se": "S01E39",
    "title": "Running Wild",
    "tt": 3613842,
    "air_date": "1967-01-01",
    "description": "When a heard of antelope start stampeding, Kimba discovers that they are doomed to head straight into a lake. As punishment for assuring the others the farm wouldn't get damaged when it did, Bucky goes off to get the antelope to come back and fix the mess. However, he soon gets caught in the middle, and all of the animals try to save him.",
    "cast": null
  },
  {
    "se": "S01E40",
    "title": "The Troublemaker",
    "tt": 3613864,
    "air_date": "1967-01-01",
    "description": "Kimba meets a young ostrich named Benny, who only wants to hang out with Kimba. However, Benny's uncle, known as Big Ben, disapproves of this action, and always causes problems. Though Kimba tries and tries to shake the ostrich away from him, he just can't seem to get rid of him, causing trouble for Kimba. When Benny gets hurt, Big Ben grows furious and demands that Kimba returns to the jungle.",
    "cast": null
  },
  {
    "se": "S01E41",
    "title": "Destroyers from the Desert",
    "tt": 3613870,
    "air_date": "1967-01-01",
    "description": "With the appearance of the Devil Wind at the sunset, the Destroyers from the Desert show up. They instantly beat up Kimba and force all of the animals to obey them. Daniel knows the truth though, he knows that once their is no moe food left, the destroyers will eat all of the animals. Against Daniel's orders, Pauley begins training Kimba in a new art of fighting to defeat them.",
    "cast": null
  },
  {
    "se": "S01E42",
    "title": "The Balloon That Blows Up",
    "tt": 3613834,
    "air_date": "1967-01-01",
    "description": "After stopping Tom and Tab from stealing some humans' balloon, Kimba discovers Dot, Dash, and Dinky playing in it. Despite knowing not to, Kimba joins in the fun, and the balloon is accidently started up. The four are awestruck by the view, and enjoy themselves. Meanwhile, the humans have realized the balloon has been taken, and they want it shot down.",
    "cast": null
  },
  {
    "se": "S01E43",
    "title": "Monster of the Mountain",
    "tt": 3613820,
    "air_date": "1967-01-01",
    "description": "A \"chimera\" from the Atlas Mountains is terrifying a peaceful little village by appearing in the middle of the night and stealing cattle. Kimba is called for aid; the monster turns out to be a bear and her cub.",
    "cast": null
  },
  {
    "se": "S01E44",
    "title": "A Friend in Deed",
    "tt": 3613884,
    "air_date": "1967-01-01",
    "description": "Roger Ranger is taken captive by the elephants when he asks them for passage through their graveyard to get to a place known as Rainbow Valley. If Kimba wants him back, he and a few other animals must swim in a swamp, where if you stop moving you'll drown, for 10 days without stopping for anything. While doing this, Kimba recaps the events of how he first met Roger Ranger long ago.",
    "cast": null
  },
  {
    "se": "S01E45",
    "title": "Such Sweet Sorrow",
    "tt": 3613826,
    "air_date": "1967-01-01",
    "description": "Tonga once again tries capturing Kimba, this time through the use of tanks disguised as Hippos. Her plan soon fails, thanks to Roger, and she flees. When Pompus is taken captive by Tonga, Roger sets out alone to save him, but he is also captured. Tonga prepares for another invasion, while Kimba prepares the animals for war.",
    "cast": null
  },
  {
    "se": "S01E46",
    "title": "The Return of Fancy Prancy",
    "tt": 3613866,
    "air_date": "1967-01-01",
    "description": "While Kimba and some of ther other animals are playing a game, a car drives up and Kimba and the others hide. To their surprise, the human woman in the car calls for a cheetah named Prancy to hop out of the car. The lady tells Prancy that she's too big to keep now, so she brought her back to where she was found. The car drives off and Prancy finds Speedy stuck in the ground.",
    "cast": null
  },
  {
    "se": "S01E47",
    "title": "The Cobweb Caper",
    "tt": 3613862,
    "air_date": "1967-01-01",
    "description": "A giant spider threatens the jungle, and not even Kimba can defeat it. Regardless, Kimba seems to be the only one who can stop the menace. However, when Kimba gets bit by a tsetse fly, he becomes very ill and has a hard time distinguishing friend from foe. With Kimba unable to help, Dan'l Baboon devises a plan to defeat the spider once and for all. But, can they really do it without Kimba's help?",
    "cast": null
  },
  {
    "se": "S01E48",
    "title": "The Red Menace",
    "tt": 3613876,
    "air_date": "1967-01-01",
    "description": "Wildfires in the surrounding area leave a herd of elephants without food. Kimba brings them to his jungle, where the resident elephants resent sharing their food. Kelly Funt imprisons Kimba in an old tower, which becomes the inspiration for protecting their own jungle from the encroaching fire.",
    "cast": null
  },
  {
    "se": "S01E49",
    "title": "The Sun Tree",
    "tt": 3613844,
    "air_date": "1967-01-01",
    "description": "Dan'l receives a message from his old great great grand-uncle Scratch who wants help to save the oldest and tallest tree in the world, the \"sun tree\". Muffy, a young cousin of Dan'l's, resents their intrusion, because he's convinced the tree will die and wants all the animals living in it to save themselves by moving to a new home.",
    "cast": null
  },
  {
    "se": "S01E50",
    "title": "Soldier of Fortune",
    "tt": 3613886,
    "air_date": "1967-01-01",
    "description": "Kimba and a few other animals meet an otter named Flappo. Flappo is an otter who loves to explore the world. Curious, Kimba and the few animals join him on an adventure. However, before the journey's over, Kimba may the one who wants to quit.",
    "cast": null
  },
  {
    "se": "S01E51",
    "title": "The Day the Sun Went Out",
    "tt": 3613796,
    "air_date": "1967-01-01",
    "description": "After a brutal storm damages the shrine, Kimba's sister, Leona, realizes that the hides of her ancestors are no longer safe. She enlists the help of Kimba to help her move them to a safe location. However, many hides are lost after Kimba's selfless actions save some of the animals helping out. Furious, Leona scolds him and goes off alone. Kimba too wants nothing to do with her anymore.",
    "cast": null
  },
  {
    "se": "S01E52",
    "title": "Silvertail The Renegade",
    "tt": 3613840,
    "air_date": "1967-01-01",
    "description": "Silvertail is an old renegade lion who stumbles out of the jungle needing Kimba's help in hiding out from his enemies. But Silvertail needs to learn to be less aggressive with the jungle residents before they will agree to help him.He must also ask to be forgiven in order to stay and live out the rest of his life with Kimba and his friends.",
    "cast": null
  }
]
