[
  {
    "se": "S01E01",
    "title": "The Force Phantom/The Spy from Outer Space: Part I/The Mermen of Emor",
    "tt": 796135,
    "air_date": "1966-09-10",
    "description": "(1.1A) {The Force Phantom}: Invaders from a moon around Mars are intent on using their Force Phantom creature to destroy Earth's defenses. Superman comes to the rescue and attempts to stop the energy creature and destroy the invader's spaceship. (1.1B) {The Spy From Outer Space - Part 1}: An alien from another galaxy appears on earth causing volcanoes and severe weather changes. Superboy and Krypto are able to stop him, but the creature warns of a coming invasion and vanishes. Superboy quickly pursues him only to find his powers are beginning to diminish. Alas, Krypto can only look on as his master is captured. (1.1C) {The Mermen of Emor}: While scuba diving, Jimmy is captured by a group of strange Mermen intent on making him a part of their gladiatorial games. Upon hearing Jimmy's signal watch, Superman comes to the rescue of Jimmy and others captured before him. Will he make it in time to save his friend and banish the Mermen once again to their underworld home of Emor?",
    "cast": null
  },
  {
    "se": "S01E02",
    "title": "The Prehistoric Pterodactyls/The Spy from Outer Space: Part II/Merlin's Magic Marbles",
    "tt": 818036,
    "air_date": "1966-09-17",
    "description": "(1.2A) {The Prehistoric Pterodactyls} An antarctic earthquake looses two prehistoric Pterodactyls. Soon, an American fighter pilot comes in contact with one, while the other menaces San Francisco. Superman saves the pilot and uses some cable to lasso the first of the flying creatures. With the beast in tow, Superman sets off for San Francisco where, after a short tussle, he uses a large net to capture the second Pterodactyl. Superman then flies both creatures to a distant planet to live out the rest of their days. (1.2B) {The Spy From Outer Space - Part 2}: At his master's suggestion Krypto spills a paint-like substance over a clear dome holding Superboy captive. This serves to shade Superboy from the planet's red sun which has drained his powers. Once freed, he quickly overpowers his captors and, together with Krypto, heads back to Earth to defeat the invading army. (1.2C) {Merlin's Magic Marbles}: Luthor uses a time travel viewer to fool Merlin into supplying magic marbles that assist him with crimes. One set will temporarily make him look like an 8 year old, while another turns him into a shadow. What can Superman do to stop the crafty Luthor?",
    "cast": null
  },
  {
    "se": "S01E03",
    "title": "The Threat of the Thrutans/Krypto's Calamitous Capers/The Wicked Warlock",
    "tt": 1089388,
    "air_date": "1966-09-24",
    "description": "(1.3A) {The Threat of the Thrutans}: Thrutan astronauts find themselves stranded on Earth and threaten to blow up a rocket base if they don't get a rocket provided to get them back to their galaxy. They demonstrate their powers by causing massive earthquakes to hit Metropolis. Can Superman stop their earthquakes and bombs, and ultimately rid earth of their threat? (1.3B) {Krypto's Calamitous Capers}: A trio of villains cause trouble in Smallville, but every time Superboy tries to stop them Krypto attacks him! Superboy realizes the villains have a gadget that causes Krypto's strange behavior and blocks Krypto's ears, together they quickly round up the crooks. (1.3C) {The Wicked Warlock} With his magical gem stone almost exhausted, the sinister Warlock robs an armored truck to steal a new stone to replace his aging one. Each time Superman attempts to grab him, the Warlock turns himself invisible and escapes. Superman tricks him into holding the magical wand above his head, and grabs it out of his hand just as the Warlock turns invisible.",
    "cast": null
  },
  {
    "se": "S01E04",
    "title": "The Chimp Who Made It Big/The Man Who Knew Superboy's Secret/The Deadly Icebergs",
    "tt": 847677,
    "air_date": "1966-09-17",
    "description": "(1.4A) {The Chimp Who Made It Big}: A monkey sent into outer space in an experimental space flight is bombarded by rays when a piece of kryptonite smashes against a nearby meteorite. This causes the monkey to grow into a large ape-monster causing destruction on earth and giving Superman a hard time with its kryptonite vision. (1.4B) {The Man Who Knew Superboy's Secret}: Superboy changes to Clark and is surprised by a costumed figure who reveals that he knows Clark is Superboy. The man says he is from Krypton too but grew up on another planet. He has Superboy meet him later and then claims he knows of an antidote to kryptonite. He is really an alien from another planet who Superboy has previously thwarted, and hopes to trick Superboy into losing his powers and being captured. How can Superboy defeat him again and maintain his secret? (1.4C) {The Deadly Iceburgs}: A band of hi-tech pirates set loose three magnetic powered icebergs which are set to detonate explosives upon impact with a large nuclear powered ship. On board, Clark excuses himself from a suspicious Lois Lane, and flies off as Superman to capture the villains and stop the deadly icebergs.",
    "cast": null
  },
  {
    "se": "S01E05",
    "title": "The Robot of Riga/The Deep Sea Dragon/The Invisible Raiders",
    "tt": 1352138,
    "air_date": "1966-10-08",
    "description": "(1.5A) {Robot of Riga}: Jimmy and Lois are abducted by a UFO and flown into space. After receiving a signal from Jimmy, Superman gives chase and follows them to the planet of Riga. There Superman encounters the fire-breathing Robot of Riga, but has he arrived in time to save his friends? (1.5B) {The Deep Sea Dragon}: What is thought to be a giant pearl is discovered by a deep sea expedition team, who are quickly then attacked by a strange sea monster. They issue a distress signal which catches the attention of Superboy, who heads out to sea with Krypto at his side. It is soon discovered that the treasure isn't a pearl at all, but an egg, which the sea creature is merely trying to protect. Soon, pirates eye the egg and steal it from the slumbering Sea Dragon, who awakens and goes on a rampage. Superboy pursues the pirates in hopes of returning the egg to its mother. (1.5C) {The Invisible Raiders}: After robbing a museum, The Sorcerer and his two hooded henchmen kidnap Jimmy, and while invisible, escape from Superman. From their hideout cave, Jimmy signals for Superman. Can our hero arrive in time to free Jimmy and thwart the evil Sorcerer?",
    "cast": [
      {
        "name": "Bud Collyer",
        "nm": 172872,
        "roles": [
          {
            "char": "Clark Kent",
            "ch": 118677,
            "voice": true
          },
          {
            "char": "Superman",
            "ch": 196,
            "voice": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E06",
    "title": "Superman Meets Brainiac/Devil of a Time/Seeds of Disaster",
    "tt": 1440692,
    "air_date": "1966-12-31",
    "description": "Brainiac raids Earth to gather creatures to repopulate a planet devastated by atomic wars. Alien seed pods grow plants that destroy other objects.",
    "cast": null
  },
  {
    "se": "S01E07",
    "title": "The Magnetic Monster/The Visitor from the Earth's Core/The Toys of Doom",
    "tt": 1440696,
    "air_date": "1966-10-22",
    "description": "The Magnetic Monster/The Toys of Doom",
    "cast": null
  },
  {
    "se": "S01E08",
    "title": "Iron Eater/The Beast That Went Berzerk/The Ape Army of the Amazon",
    "tt": 1440688,
    "air_date": "1966-10-29",
    "description": "The Iron Eater/The Ape Army of the Amazon",
    "cast": null
  },
  {
    "se": "S01E09",
    "title": "The Fire Phantom/Superboy's Strangest Foe/The Deadly Dish",
    "tt": 1440695,
    "air_date": "1966-11-05",
    "description": "A living flame from Earth's core appears and sets off a mammoth forest fire. Lex Luthor traps Lois, Jimmy, and Perry White so he can lure Superman into range of a Kryptonite Transmitter.",
    "cast": null
  },
  {
    "se": "S01E10",
    "title": "The Insect Raiders/The Capricious Crony/Return of the Warlock",
    "tt": 1440687,
    "air_date": "1966-11-12",
    "description": "Criminals who have perfected insect powers must stop Superman from foiling their wave of crime. The Warlock steals a magic gem to wreak havoc on Superman's friends.",
    "cast": null
  },
  {
    "se": "S01E11",
    "title": "The Abominable Ice-Man/Krypto, Super Seeing-Eye Dog/The Men from APE",
    "tt": 1440694,
    "air_date": "1966-11-19",
    "description": "An ice being freezes tropical Hawaii where Lois Lane is having her vacation. Lex Luthor, The Warlock, Toyman, and Prankster form the organization A.P.E. (short of Allied Perpetrators of Evil) and combine their powers to defeat Superman.",
    "cast": null
  },
  {
    "se": "S01E12",
    "title": "The Tree Men of Arbora/The Black Knight/The Image Maker",
    "tt": 1440698,
    "air_date": "1966-11-26",
    "description": "A tree being brought to life near a meteor crater consumes enormous quantities of water. A master criminal scientist named Luna captures Lois in order to send her into space within his 4D movie as his revenge on her for sending him to prison 7 years ago.",
    "cast": null
  },
  {
    "se": "S01E13",
    "title": "Superman's Double Trouble/Operation Counter Invasion/The Deadly Super-Doll",
    "tt": 1440693,
    "air_date": "1966-12-03",
    "description": "A mid-ocean earthquake releases a giant lobster and a giant alligator. The Sorcerer uses a voodoo doll to stop Superman.",
    "cast": null
  },
  {
    "se": "S01E14",
    "title": "Lava Men/The Jinxed Circus/Luthor Strikes Again",
    "tt": 1440689,
    "air_date": "1966-12-10",
    "description": "In Mexico, a volcano creates living beings of lava. Lex Luthor uses Jimmy Olsen as bait to use Kryptonite laser beam weapons against Superman in a paint factory.",
    "cast": null
  },
  {
    "se": "S01E15",
    "title": "Mission to Planet Peril/Hurricane Fighters/The Pernicious Parasite",
    "tt": 1440690,
    "air_date": "1966-12-17",
    "description": "Alien raiders forced to Earth recruit Superman to rescue hostages on their home world. While breaking into a science lab, a petty criminal named I.C.",
    "cast": null
  },
  {
    "se": "S01E16",
    "title": "The Two Faces of Superman/Superboy's Super-Dilemma/The Imp-Practical Joker",
    "tt": 1440699,
    "air_date": "1966-12-24",
    "description": "Toyman creates a robot doppelganger of The Man Of Steel. A carnival is raided by an extra-dimensional prankster known as Mister Mxyzptlk.",
    "cast": null
  },
  {
    "se": "S01E17",
    "title": "Neolithic Nightmare/Super Clown of Smallville/The Return of Brainiac",
    "tt": 1440691,
    "air_date": "1966-10-15",
    "description": "Jimmy Olsen falls into an underground pocket populated by malevolent creatures. An alien computer named Brainiac has been capturing different kinds of animals by shrinking them.",
    "cast": null
  },
  {
    "se": "S01E18",
    "title": "The Malevolent Mummy/The Revolt of Robotville/The Birdmen from Lost Valley",
    "tt": 1440697,
    "air_date": "1967-01-07",
    "description": "An Egyptian sorcerer in mummified form attacks Lois and Superman. Avian beings must raid outside farmlands for survival because a gold raider named Trask and his henchmen hold their populace hostage.",
    "cast": null
  }
]
