[
  {
    "se": "S01E01",
    "title": "The Flying Nun",
    "tt": 580860,
    "air_date": "1967-09-07",
    "description": "Located atop a hill in old San Juan, Puerto Rico, the Convent San Tanco is populated by, among others, the stern and traditional Reverend Mother Superior Plaseato, straightforward Sister Jacqueline, English challenged Sister Sixto who is always mixing her English slang around, young innocent novice Sister Ana, Sister Teresa and Sister Marguerita. The convent is an old, beautiful building but is showing its age and is need of major repairs - as is everything the sisters own - money for which the sisters do not have. Into their world enters Sister Bertrille, a new novice from New York, who is to teach kindergarten. Sister Bertrille is an ex-surfer girl hippie with tons of enthusiasm who will go to any means to achieve what she wants and what she thinks the convent needs. This includes striking up a friendship with local entrepreneur and playboy, Carlos Ramirez, the owner of the Carlos A-Go Go Discotheque and Casino in San Juan. Carlos own a piece of property that would be perfect for a new school for the convent, and Sister Bertrille thinks it would be perfect for Carlos to donate it to the convent. This approach goes against the wishes of the Reverend Mother, who considers it undignified and uncouth. Above all of this, Sister Bertrille discovers that the strong winds of San Juan coupled with the wing-like coronet of the nun's habit can make her go airborne. She quickly learns how to fly by raising and turning her head and the associated coronet. Among those that see her fly is Carlos, who thinks he has seen a vision and as such, decides to donate his property to the convent and the sisters. But those that do not see her fly are the men of the restricted military base into which she accidentally flies. It takes some convincing for them to believe she's not a spy. But the person who may need even more convincing is the Reverend Mother, who must decide what to do with her new flying novice.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Stanley Beck",
        "nm": 65282,
        "roles": [
          {
            "char": "Guard"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Serena Sande",
        "nm": 761339,
        "roles": [
          {
            "char": "Sister Marguerita"
          }
        ]
      },
      {
        "name": "Dennis Cooney",
        "nm": 177753,
        "roles": [
          {
            "char": "Lt. Carmichael"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Captain Dominic Lopez"
          }
        ]
      },
      {
        "name": "Dabney Coleman",
        "nm": 1056,
        "roles": [
          {
            "char": "Sub. Captain"
          }
        ]
      },
      {
        "name": "Dick Balduzzi",
        "nm": 49845,
        "roles": [
          {
            "char": "Korman"
          }
        ]
      },
      {
        "name": "Jean Marie Ingels",
        "nm": 408731,
        "roles": [
          {
            "char": "Maria",
            "as Jean Marie": true
          }
        ]
      },
      {
        "name": "Lois Jewell",
        "nm": 1599909,
        "roles": [
          {
            "char": "Louise"
          }
        ]
      },
      {
        "name": "Margarita Cordova",
        "nm": 179654,
        "roles": [
          {
            "char": "Consuela"
          }
        ]
      },
      {
        "name": "Arlene Charles",
        "nm": 152977,
        "roles": [
          {
            "char": "Julie"
          }
        ]
      },
      {
        "name": "Henry Beckman",
        "nm": 65798,
        "roles": [
          {
            "char": "Major Overland"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E02",
    "title": "The Convert",
    "tt": 580855,
    "air_date": "1967-09-14",
    "description": "Sister Bertrille is getting better at flying and takes the occasional practice flight. During one of her flights, she is seen by Carlos Ramirez, who thinks he has seen a religious vision. Because of it, he gives up drinking, gambling and girls, while taking up meditating and going to mass. Carlos' current girlfriend, Dottie, is concerned and goes to Sister Bertrille for help, telling her the story. Although Sister Bertrille is as happy as any of the sisters to see agnostic Carlos going to church, she doesn't want him going on false pretenses, and tells and shows him the truth about her ability to fly. Relieved, he goes back to his old carousing ways and tries to make up for lost time. In a poker match, he loses everything except his yacht. Lou and Tony, his gambling buddies, say that they will let Carlos bet them in any way: the yacht against his losings that night. He goes for what he considers a sure thing: that they will see Sister Bertrille fly unaided. Unbeknowst to Carlos, the Reverend Mother has forbid Sister Bertrille from flying while Bishop Dillon is in town. Carlos tries to convince Sister Bertrille to do this for him, he saying that in a way she is responsible for his predicament. He even threatens to take back the property he donated to the convent, as he has not yet signed the papers. Sister Bertrille goes to Reverend Mother for guidance on this issue. Without hearing the specific issue, the busy Reverend Mother tells her to use her own judgment and do what's best for the convent. So Sister Bertrille flies, just as the Reverend Mother and Bishop Dillon go to visit Carlos at his yacht, Carlos the man who so generously donated the land to the convent. A convenient shove of the Bishop into the water saves Sister Bertrille's secret from the Bishop.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Ivor Barry",
        "nm": 58019,
        "roles": [
          {
            "char": "Bishop Dillion"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Noam Pitlik",
        "nm": 685736,
        "roles": [
          {
            "char": "Lou Cottrell"
          }
        ]
      },
      {
        "name": "John Gabriel",
        "nm": 300235,
        "roles": [
          {
            "char": "Tony Petroni"
          }
        ]
      },
      {
        "name": "Arlene Golonka",
        "nm": 326626,
        "roles": [
          {
            "char": "Dottie"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E03",
    "title": "Old Cars for New",
    "tt": 580840,
    "air_date": "1967-09-21",
    "description": "Even mechanically inclined Sister Bertrille can't fix their jalopy of a station wagon, which they need to transport the children to the Feast of St. Anthony Carnival that day. The sisters talk the Reverend Mother into letting them trade in the jalopy and buy another used car with the $800 they have on hand. Sister Bertrille turns to Money Back Hernando, the most notorious used car dealer in San Juan. They strike a deal for a station wagon for $800, plus the trade-in. The new car ends up being a lemon. But luckily, it breaks down next to where Carlos is picnicking with his latest conquest, Diane. He manages to fix it to the best of his ability, but he suggests the sister take the car back to Hernando and get her money back. Money Back is not true to his name, and they negotiate $500 for the buy-back, but she has to come back later for the money. Vehicleless, Sister Bertrille talks Carlos into letting her use his station wagon to drive the children to the carnival. So Sister Bertrille drops Carlos' station wagon off at the convent, and tells the kids to tell the other sisters that she'll be back shortly and will explain the situation, while she heads back into town to pick up the $500. The sisters see the beautiful station wagon and assume it's the one Sister Bertrille bought with the $800. However just as the kids go off, the water heater in the convent falls apart, and they're going to need the $800 back. So Sister Jacqueline takes Carlos' car back to Money Back and sells it to him for $800. Money Back, never one to pass up a good deal however shady, agrees despite not knowing anything about Sister Jacqueline's story but indeed knowing that the car is well worth more than $800. He turns around and lists it for $1,500. So Sister Bertrille needs to go to Carlos to ask for a loan of $1,000, which added to her $500 will allow her to buy his car back. She is reluctant to tell him what she needs the money for, and he explodes when he finds out the reason. However, he comes up with a plan. Sister Bertrille is to go back and buy the old jalopy from Money Back, which she does for $15. Then Carlos goes to Money Back asking to buy the jalopy, implying that a wealthy investor is in town looking for old vehicles such as that and paying a fortune for such. So Carlos and Money Back go to the convent to bid on the jalopy. Money Back eventually buys it back for $3,000, at which time Carlos infers that the investor, while real, is not in town nor might he ever be. Money Back realizes that he has been had at his own game.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Thomas Anthony",
        "nm": 1580880,
        "roles": [
          {
            "char": "Charlie"
          }
        ]
      },
      {
        "name": "Carmelita",
        "nm": 138360,
        "roles": [
          {
            "char": "Little Girl"
          }
        ]
      },
      {
        "name": "Gino Conforti",
        "nm": 174581,
        "roles": [
          {
            "char": "Money Back Hernando"
          }
        ]
      },
      {
        "name": "Susan Howard",
        "nm": 397622,
        "roles": [
          {
            "char": "Sister Susan"
          }
        ]
      },
      {
        "name": "E.J. Peaker",
        "nm": 668855,
        "roles": [
          {
            "char": "Diane"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E04",
    "title": "A Bell for San Tanco",
    "tt": 580808,
    "air_date": "1967-09-28",
    "description": "The bell at San Tanco is showing its age. Originally meant only to be temporary, the replacement bell sunk on the ship, the Hidalgo, off the coast of Puerto Rico when it was being shipped from Belgium 200 years prior. When Sister Bertrille can't fix the bell, she suggests looking for the wreck of the Hidalgo. She goes to the one person with the money and the boat to even attempt the location and salvage process: Carlos. Carlos agrees, but he really has other things on his mind. He is doing all of this in an attempt to woo his latest girlfriend, Binkie Worsley. He plans to plant a false treasure map, and buy a new bell for the convent, while taking Binkie out for a supposed sailing adventure to locate the wreck and the bell. His plans are thwarted when Sister Bertrille, with the Reverend Mother's reluctant blessing, insists on tagging along. But at least Carlos can still find his planted new bell and act the hero in front of Binkie, that is until Carlos's assistant, Pedro, spills wine on the map he drew with water soluble ink. Carlos dives again and again and again with no luck in finding the exact spot where Pedro planted the bell. Finally, Carlos finds the bell, just as Binkie goes overboard. They lose her. Sister Bertrille suggests she be the flying scout looking for Binkie from a hundred feet up. They find Binkie, on the most part all right. Carlos has become her savior and again plays the hero. However, Carlos' romantic plans are once again laid to rest as Binkie saw Sister Bertille flying while she was on death's edge out in the water, seeing it as a religious vision to change her ways. As for the bell, Pedro is having a hard time removing all the fake barnacles he placed on it because what they found was the real 200 year old bell.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Caterer",
            "ch": 188427
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Pedro"
          }
        ]
      },
      {
        "name": "Louise Sorel",
        "nm": 814798,
        "roles": [
          {
            "char": "Binkie Worsley"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E05",
    "title": "The Fatal Hibiscus",
    "tt": 580859,
    "air_date": "1967-10-05",
    "description": "As much as she loves Sister Bertrille, the Reverend Mother believes that the high winds of San Juan create an environment not suitable for Sister Bertrille. This is highlighted by the fact that Sister Bertrille flew threw a new stained-glass window with her errant flying. So the Reverend Mother makes the difficult decision to transfer her to another convent, possibly in Rome. As exciting as that may be, Sister Bertrille is devastated about leaving, and openly shows that. Her frequent bouts of tears are due to this, but she attributes it to her allergy to hibiscus flowers. Sister Bertrille asks that the Reverend Mother not tell the other sisters until just before her scheduled departure. But the sister does tell Carlos, who is also disheartened by the news, but would not dare question the Reverend Mother's decision. But Carlos works behind the scenes with the children of the convent to organize a protest to keep Sister Bertrille at San Tanco. Sister Ana overhears the news of Sister Bertrille's departure, thinking that Sister Bertrille is dying. So the sisters treat her with kid gloves. They also see the Reverend Mother is treating Sister Bertrille with her regular sternness, the sisters thinking her cold-hearted in light of Sister Bertrille's imminent 'passing'. Thus the sisters embark on a cold shoulder campaign toward the Reverend Mother, who thinks it was orchestrated by Sister Bertrille as defiance against the transfer. This strengthens Reverend Mother's resolve to transfer her. The misunderstanding becomes known and is resolved, and everyone becomes clear as to Sister Bertrille's real fate. The sisters also find out about Carlos' campaign; the sisters suggest to him that that may not be the best approach to take with the Reverend Mother, and Carlos calls off the campaign. However, the campaign takes on a life of its own extending to the people of the community; this shows the Reverend Mother what a truly profound effect Sister Bertrille has had in her short time at San Tanco. The sister can stay.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Joe Abdullah",
        "nm": 8286,
        "roles": [
          {
            "char": "Toué"
          }
        ]
      },
      {
        "name": "Jackie Brown",
        "nm": 2045712,
        "roles": [
          {
            "char": "Miguel"
          }
        ]
      },
      {
        "name": "Cherie Latimer",
        "nm": 490193,
        "roles": [
          {
            "char": "Go-Go Girl #1"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Señor Trotto"
          }
        ]
      },
      {
        "name": "Miguel Monsalve",
        "nm": 2046767,
        "roles": [
          {
            "char": "Pedro"
          }
        ]
      },
      {
        "name": "Judy Pace",
        "nm": 655142,
        "roles": [
          {
            "char": "Go-Go Girl #2"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "Irene Tedrow",
        "nm": 853792,
        "roles": [
          {
            "char": "Mother Provincial David"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E06",
    "title": "Flight of the Dodo Bird",
    "tt": 580823,
    "air_date": "1967-10-12",
    "description": "On a flight, Sister Bertrille suddenly gets dizzy and has double vision, forcing a crash landing. After being checked out by Dr. Tapia, he discovers she has an ear infection that will clear up in a couple of days. He is more concerned about the condition of the Reverend Mother. She is a bit anxious about Sister Bertrille in general but more so now with Sister Bertrille's ailment. The doctor however attributes the Reverend Mother's anxiety to work stress and thus calls in Father Lundigan, the church's psychologist, to allay the Reverend Mother's anxiety. The Reverend Mother makes the mistake of telling Father Lundigan that the source of her anxiety is the flying nun, or rather the landings of the flying nun. The father promptly thinks the Reverend Mother is going crazy. Perhaps it's something in the water at the convent Sister Jacqueline and Sister Bertrille herself support the Reverend Mother's story. The only way to convince Father Lundigan is for Sister Bertrille to fly for him. However her ear infection is causing Sister Bertrille to be grounded. One by one, all the sisters support the Reverend Mother's story. Father Lundigan thinks he's surrounded by a convent full of deranged nuns, this further supported when the sisters try everything in their power to keep the father at the convent until Sister Bertrille's ear infection clears and she can fly again for the father. Father Lundigan manages to \"escape\" from the convent just as soon as Sister Bertrille's infection clears and she's able to fly again. Sister Bertrille finally manages to convince Father Lundigan when she flies next to the airborne plane which he's aboard. Or perhaps she's only convinced him that he's as crazy as all the nuns at the convent.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028,
            "credit only": true
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Don Diamond",
        "nm": 224614,
        "roles": [
          {
            "char": "Dr. Tapia"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Alex Gerry",
        "nm": 314778,
        "roles": [
          {
            "char": "Dr. Norman Loomis"
          }
        ]
      },
      {
        "name": "John Astin",
        "nm": 40014,
        "roles": [
          {
            "char": "Father Lundigan"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E07",
    "title": "Polly Wants a Cracked Head",
    "tt": 580843,
    "air_date": "1967-10-19",
    "description": "Exasperated with the sharp tongue of her talking parrot Junior his vocabulary learned in her saloon, Rose Dolan threatens to fricassee him unless Sisters Bertrille and Jacqueline take him off her hands. Seeing that the convent does not allow pets, the sisters need to find Junior a good home. Unable to do so, they clandestinely take Junior back to the convent. However, Junior's big mouth gives him away. They try and reform his language to convince the Reverend Mother to let him stay, but they fail in their task. As a last resort, Sister Bertrille tries Carlos, who does end up taking Junior. But when Junior's language ruins a date, Carlos wants to get rid of him. Junior has the same idea and flies out the window. It's then that Rose changes her mind - she misses Junior and wants him back. She's heartbroken when she learns of Junior's fate. To help Rose, Sister Bertrille goes out looking for Junior. Miraculously. she finds him, just before a couple of ornithologists are about to nab Junior themselves. Rose and Junior live happily ever after.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Chet Stratton",
        "nm": 833628,
        "roles": [
          {
            "char": "1st Ornithologist"
          }
        ]
      },
      {
        "name": "Jonathan Hole",
        "nm": 354949,
        "roles": [
          {
            "char": "2nd Ornithologist"
          }
        ]
      },
      {
        "name": "Venita Wolf",
        "nm": 937957,
        "roles": [
          {
            "char": "Cecilia"
          }
        ]
      },
      {
        "name": "Jeremy Vernon",
        "nm": 1561852,
        "roles": [
          {
            "char": "Husband"
          }
        ]
      },
      {
        "name": "Carol Locatell",
        "nm": 479841,
        "roles": [
          {
            "char": "Wife",
            "as Carol Lawson": true
          }
        ]
      },
      {
        "name": "Norma Crane",
        "nm": 186408,
        "roles": [
          {
            "char": "Rose Dolan"
          }
        ]
      },
      {
        "name": "Mel Blanc",
        "nm": 305,
        "roles": [
          {
            "char": "Junior",
            "voice": true
          }
        ]
      },
      {
        "name": "Junior",
        "nm": 3125638,
        "roles": [
          {
            "char": "Parrot",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E08",
    "title": "Ah Love, Could You and I Conspire?",
    "tt": 580814,
    "air_date": "1967-10-26",
    "description": "Bobbye Starr is trying to get away from her mobster boyfriend Al Caine, who she wants to get a legitimate job and ask her to marry him. In her getaway, she stows away in the convent's station wagon and isn't discovered by the sisters until they reach the convent. Sisters Bertrille and Jacqueline think that Bobbye's arrival is timely, as she mentioned her job was as a 'private secretary' and the Reverend Mother probably needs help while her regular secretary, Sister Ana, is off sick. However regular secretarial work is not Bobbye's strength in life. Despite her secretarial failings, she endears herself to everyone at the convent and is allowed to stay as long as she feels she needs. Although Bobbye resigns herself to go back to Al, Sister Bertrille suggests that to nab Al, Bobbye needs to make him jealous. The sister suggests Carlos as the perfect pretend suitor. Carlos agrees after he lays eyes on the glamorous Bobbye. They make it as obvious to Al as possible, and it isn't until after the sisters tell Al about Carlos and Bobbye's whereabouts that the sisters discover Al's shady background. Sister Bertrille flies off to warn Carlos and Bobbye of Al's impending arrival. However Al arrives before her and threatens Bobbye and Carlos with a gun in hand. Sister Bertrille calls in the police, and with the siren wailing, Al is placed in a position of either having Bobbye testify against him, or marry him. He reluctantly concedes to the latter.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Jack Riley",
        "nm": 727051,
        "roles": [
          {
            "char": "Leo",
            "as Jack B. Riley": true
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "Tony Davis",
        "nm": 205575,
        "roles": [
          {
            "char": "Pedro"
          }
        ]
      },
      {
        "name": "Maureen Arthur",
        "nm": 37802,
        "roles": [
          {
            "char": "Bobbye Starr"
          }
        ]
      },
      {
        "name": "Herb Edelman",
        "nm": 248983,
        "roles": [
          {
            "char": "Albion 'Al' Caine"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E09",
    "title": "Days of Nuns and Roses",
    "tt": 580821,
    "air_date": "1967-11-02",
    "description": "Unable to raise enough money through donations, Sister Bertrille thinks they should go into business. With the donation of the raw materials, Sister Bertrille thinks they should produce what she calls the Nectar of San Tanco: sea grape juice. Out of faith, Carlos and one of his business associates, Luis Fiero, agree to exclusive distribution rights of the product without even knowing what it is. When Carlos finds out it's sea grape juice, he pulls out. The business is in trouble when the creditors come for payment and the sisters haven't sold a bottle's worth. Luis Fiero changes his mind and decides to distribute after sampling the product and seeing Sister Bertrille fly, thinking that the strength of the nectar was the reason for his vision. But because the bottles of juice have been sitting around, they have also been fermenting and turning into wine. So when Carlos delivers the bottles to Luis and needs to go through customs, he is arrested for trying to smuggle sea grape wine. The customs inspector raids the convent. However in the meantime, the juice and the wine has made yet another transformation, this time into vinegar. Fiero buys all the bottles of vinegar anyway, the sisters stop production and after paying the creditors, end up twenty-five cents in the red, the twenty-five cents paid by Carlos. He knew this venture would cost him something.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Steve Peck",
        "nm": 669488,
        "roles": [
          {
            "char": "Luis Fiero",
            "as Steven Peck": true
          }
        ]
      },
      {
        "name": "Danny Kulick",
        "nm": 1581313,
        "roles": [
          {
            "char": "Fernando"
          }
        ]
      },
      {
        "name": "C. Lindsay Workman",
        "nm": 941454,
        "roles": [
          {
            "char": "Inspector",
            "as Lindsay Workman": true
          }
        ]
      },
      {
        "name": "Frank Ramírez",
        "nm": 709236,
        "roles": [
          {
            "char": "Sergeant"
          }
        ]
      },
      {
        "name": "Martin Garralaga",
        "nm": 307986,
        "roles": [
          {
            "char": "Farmer"
          }
        ]
      },
      {
        "name": "Danny Francis",
        "nm": 290125,
        "roles": [
          {
            "char": "License Man"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E10",
    "title": "With Love from Irving",
    "tt": 580886,
    "air_date": "1967-11-09",
    "description": "Sister Bertrille rescues a pelican which is trying to fly but has an injury. She nurses the bird back to health, but the pelican seems content to say with Sister Bertrille.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Serena Sande",
        "nm": 761339,
        "roles": [
          {
            "char": "Sister Marguerita"
          }
        ]
      },
      {
        "name": "Nate Esformes",
        "nm": 260559,
        "roles": [
          {
            "char": "Dr. Leonard"
          }
        ]
      },
      {
        "name": "Harold Gould",
        "nm": 332390,
        "roles": [
          {
            "char": "Father Sweeney"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E11",
    "title": "It's an Ill Wind",
    "tt": 580830,
    "air_date": "1967-11-16",
    "description": "The Reverend Mother is speaking at an educational seminar in St. Thomas, and has forgotten her notes. Sisters Bertrille and Jacqueline brainstorm about how to get the information to her. Sister Bertrille asks Carlos if he would fly his private plane to St. Thomas, but he refuses. So Sister Bertrille takes matters into her own hands and flies there herself. En route, she gets lost and the wind is dying so she's forced to make an emergency landing on a small island. On the island, Talc and his band of gangsters - Moon, Ben, Joe and Angie - are discussing business matters, namely how to dismiss of their partners, the Schwimmer brothers, when Talc sees Sister Bertrille land. He thinks she is a saint who has come to help him redeem his ways. Because of Talc's odd behavior, Moon and Ben think he's gone crazy and figure they'll support the Schwimmers, while Joe and Angie will follow Talc in whatever he wants to do. Meanwhile, Sister Bertrille has accidentally dropped the Reverend Mother's notes and mistakenly picked up some of Talc's notes. When contract killer Louie LaRue lands on the island, Moon and Ben take off with him to contact the Schwimmers, stranding Talc, Joe, Angie and Sister Bertrille. Before those on the plane can bring back the Schwimmers to the island to dispose of Talc and the others, Sister Bertrille manages to fly off with Talc's papers. As she does, Talc, Joe, Angie, and Moon, Ben, Louie and the Schwimmer Brothers in the plane all see Sister Bertrille fly. Like Talc, they all now believe she's a saint sent to help them redeem their ways. The pilot too is so overwhelmed, that he crashes the plane. When Sister Bertrille returns to the convent and sees that she has incriminating evidence of Talc's, the federal authorities take her back to the island, expecting a tense stand off with Talc and the Schwimmers. Instead, Talc and everyone on the island surrender to their new saint.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Lew Palter",
        "nm": 658817,
        "roles": [
          {
            "char": "Joe"
          }
        ]
      },
      {
        "name": "Pepper Davis",
        "nm": 205278,
        "roles": [
          {
            "char": "Beaumont"
          }
        ]
      },
      {
        "name": "David M. Frank",
        "nm": 1721099,
        "roles": [
          {
            "char": "Fremling",
            "as David Frank": true
          }
        ]
      },
      {
        "name": "Noam Pitlik",
        "nm": 685736,
        "roles": [
          {
            "char": "Talc Edwards"
          }
        ]
      },
      {
        "name": "William Kendis",
        "nm": 447684,
        "roles": [
          {
            "char": "Owens"
          }
        ]
      },
      {
        "name": "Robert F. Lyons",
        "nm": 529150,
        "roles": [
          {
            "char": "Louie LaRue"
          }
        ]
      },
      {
        "name": "Larry Vincent",
        "nm": 898691,
        "roles": [
          {
            "char": "Ben"
          }
        ]
      },
      {
        "name": "Hollis Morrison",
        "nm": 607163,
        "roles": [
          {
            "char": "Angie"
          }
        ]
      },
      {
        "name": "Arthur Julian",
        "nm": 432188,
        "roles": [
          {
            "char": "Moon"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E12",
    "title": "Young Man with a Cornette",
    "tt": 580889,
    "air_date": "1967-11-23",
    "description": "Before the Reverend Mother goes off on a cruise vacation, she makes Sister Bertrille promise her that she will not not tell anyone else about her ability to fly. At the hospital pediatric wing, Sisters Bertrille and Jacqueline encounter Charlie Webster, a problem orphan who is self-absorbed and prone to telling tales. As such, he is a loner without friends and is hard for the authorities to find adoptive parents. Sister Bertrille thinks she can get through to Charlie, especially since they have the love of flying in common. Sister Bertrille does get through to Charlie. She finds out that his selfishness stems from the fact that everything he has loved has been taken away from him. However one day when they're out flying a kite, Sister Bertrille takes an unscheduled flight. As usual, Charlie tells all back at the hospital, who think he is once again lying. Much to his dismay, Sister Bertrille can't and won't support his story because of her vow to the Reverend Mother. Fearing that she has lost touch with Charlie, Sister Bertrille flies out to the cruise ship that the Reverend Mother is on for some advice. The Reverend Mother leaves it up to Sister Bertrille's better judgment. In the middle of the night, Charlie steals Sister Bertrille's cornette. The sisters put two and two together and learn from the other children that he indeed is going to try to fly, his reasoning being that he's half a light as Sister Bertrille and thus should be able to fly twice as high. What's worse is that he plans to take flight from the top of his favorite climbing tree. Sister Bertrille and the others get to him just in time. She convinces him that he won't be able to fly and that she is his friend. She also tells him the reason for not supporting his story - which she can now with the Reverend Mother's blessing - and the reason why the convent in general keeps her flying a secret. Charlie tells the others that he indeed was lying - this is the first unselfish act he has done in a long time, and begins the new phase of his childhood.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Brian Nash",
        "nm": 621683,
        "roles": [
          {
            "char": "Charlie Webster"
          }
        ]
      },
      {
        "name": "Don Diamond",
        "nm": 224614,
        "roles": [
          {
            "char": "Dr. Tapia"
          }
        ]
      },
      {
        "name": "Dick Wilson",
        "nm": 933304,
        "roles": [
          {
            "char": "Joe"
          },
          {
            "char": "Man #1"
          }
        ]
      },
      {
        "name": "Dick Balduzzi",
        "nm": 49845,
        "roles": [
          {
            "char": "Man #2"
          }
        ]
      },
      {
        "name": "Marcelle Fortier",
        "nm": 1553557,
        "roles": [
          {
            "char": "Nurse Delgado"
          }
        ]
      },
      {
        "name": "Mercedes Alberti",
        "nm": 16666,
        "roles": [
          {
            "char": "Stewardess"
          }
        ]
      },
      {
        "name": "Danny Kulick",
        "nm": 1581313,
        "roles": [
          {
            "char": "Kenny"
          }
        ]
      },
      {
        "name": "Sylvia Marino",
        "nm": 1648289,
        "roles": [
          {
            "char": "Barbara"
          }
        ]
      },
      {
        "name": "Rick Natoli",
        "nm": 622371,
        "roles": [
          {
            "char": "Manuel"
          }
        ]
      },
      {
        "name": "Foster Brooks",
        "nm": 111983,
        "roles": [
          {
            "char": "Passenger"
          }
        ]
      },
      {
        "name": "Gary Domasin",
        "nm": 2747544,
        "roles": [
          {
            "char": "Pablo"
          },
          {
            "char": "Boy in Hospital"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E13",
    "title": "The Patron of Santa Thomasina",
    "tt": 580873,
    "air_date": "1967-11-30",
    "description": "Santa Thomasina is a small remote village in the hills overlooking San Juan. In reality, it is not one but two villages, since the inhabitants of both have been feuding for years as to which has the rightful claim to being 'the' Santa Thomasina. Sister Bertrille and Sister Jacqueline are caught within the feud when they are invited by one of the communities, but end up in the other. Manifestation of the feud includes stealing pigs and stealing the statue of Saint Thomasina, the matron saint of the villages. The residents of the one Santa Thomasina's sees Sister Bertrille fly, thinking she the reincarnation of their beloved matron Saint, and who they believe will lead them to victory in battle against the other village. Despite Sister Bertrille's urgings against doing so, the villagers go to the fork in the trail to battle the rapers and pillagers from the other village, whom they portray as well armed guerrillas. In reality, the 'army' of the other Santa Thomasina are similarly just villagers armed with shovels and brooms as weapons. In the midst of battle, Sister Bertrille first thinks that a drastic measure is required to show them how futile their battle is: she threatens to chop the statue in half to give to each village. When they shudder at the thought, the villagers accept Sister Bertrille's more practical second suggestion of keeping the statue at the fork of the trail and to name the respective communities East Santa Thomasina and West Santa Thomasina. They have achieved peace.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Pedro Caracol"
          }
        ]
      },
      {
        "name": "Renata Vanni",
        "nm": 889245,
        "roles": [
          {
            "char": "Maria"
          }
        ]
      },
      {
        "name": "Victor Millan",
        "nm": 587637,
        "roles": [
          {
            "char": "Pablo"
          }
        ]
      },
      {
        "name": "Tony Davis",
        "nm": 205575,
        "roles": [
          {
            "char": "Juanito"
          }
        ]
      },
      {
        "name": "Andres Oropeza",
        "nm": 1561698,
        "roles": [
          {
            "char": "Workman #1"
          }
        ]
      },
      {
        "name": "Bert Santos",
        "nm": 763995,
        "roles": [
          {
            "char": "Workman #2"
          }
        ]
      },
      {
        "name": "Harry Davis",
        "nm": 204687,
        "roles": [
          {
            "char": "Francisco"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E14",
    "title": "If You Want to Fly, Keep Your Cornette Dry",
    "tt": 580829,
    "air_date": "1967-12-07",
    "description": "Sister Bertrille, Sister Sixto and the kids are on their way to rendezvous with a friend of Carlos' for a day outing at his plantation. However the sisters get lost on their way. After a day picnicking at the spot which they stopped their journey, the gang are ready to head back to the convent. However their station wagon isn't being cooperative. So Sister Bertrille decides that she will fly to a pay telephone and call Carlos to come pick them up. But the stormy weather causes Sister Bertrille to be grounded as her cornette becomes sopping wet and limp. Now that it's getting dark, the Reverend Mother, Sister Jacqueline and Carlos are worried about the gang not making it to the plantation nor yet making it back to the convent. Despite the storm, Carlos decides to take his plane up and look for them. He finds them and radios for help, immediately after which his plane experiences some mechanical problems and he is forced to make an emergency landing. The gang is rescued but now it's Carlos who needs rescuing. Or does he?! Sister Bertrille joins the search for Carlos, and she finds him at lush plantation owned by the beautiful Gina. Carlos was doing just fine with Gina, and wished that Sister Bertrille had never found him.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Bara Byrnes",
        "nm": 126306,
        "roles": [
          {
            "char": "Paula"
          }
        ]
      },
      {
        "name": "Sharon DeBord",
        "nm": 207527,
        "roles": [
          {
            "char": "Gina"
          }
        ]
      },
      {
        "name": "Carmelita",
        "nm": 138360,
        "roles": [
          {
            "char": "1st Little Girl"
          }
        ]
      },
      {
        "name": "Fabian Grijalva",
        "nm": 1561538,
        "roles": [
          {
            "char": "1st Little Boy"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E15",
    "title": "The Dig In",
    "tt": 580857,
    "air_date": "1967-12-14",
    "description": "While out flying, Sister Bertrille loses the wind and lands near a mine. She gets trapped in the mine with an ex-convict.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392,
            "voice": true
          }
        ]
      },
      {
        "name": "Henry Jaglom",
        "nm": 415617,
        "roles": [
          {
            "char": "Bill Watkins"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E16",
    "title": "Wailing in a Winter Wonderland",
    "tt": 580883,
    "air_date": "1967-12-21",
    "description": "Convent San Tanco's nuns draw names to provide Christmas presents for one another and Sister Bertrille draws Sister Olaf, an elderly nun from Scandanavia who's one wish is to see snow fall again before she dies. The young nun connives with the U.S. Weather Bureau to produce a snowstorm over the convent with disastrous results.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Celia Lovsky",
        "nm": 522767,
        "roles": [
          {
            "char": "Sister Olaf"
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "1st Businessman"
          }
        ]
      },
      {
        "name": "Ceil Cabot",
        "nm": 127679,
        "roles": [
          {
            "char": "Woman Tourist"
          }
        ]
      },
      {
        "name": "Joanie Larson",
        "nm": 1828103,
        "roles": [
          {
            "char": "Girl Tourist"
          }
        ]
      },
      {
        "name": "Jack Bernardi",
        "nm": 76022,
        "roles": [
          {
            "char": "Man Tourist"
          }
        ]
      },
      {
        "name": "Jack Fife",
        "nm": 1338868,
        "roles": [
          {
            "char": "2nd Businessman"
          }
        ]
      },
      {
        "name": "Woodrow Parfrey",
        "nm": 661416,
        "roles": [
          {
            "char": "Weatherman"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E17",
    "title": "With a Friend Like Him, Who Needs?",
    "tt": 580887,
    "air_date": "1967-12-28",
    "description": "On the request of the Reverend Mother to bring someone in to organize the library, the bishop sends the only qualified librarian available on staff, accident-prone Brother Paul Bernardi. And the Reverend Mother assigns Sister Bertrille to assist Brother Paul in her hope that \"two wrongs will make a right\". Among the accidents caused by Brother Paul are the burning of the bookshelves by his magnifying glass and creating a hole in the library wall while pulling out a nail. With the latter however, he and Sister Bertrille discover some old parchments inside the wall, the parchments which end up being the priceless San Tanco scrolls. In his absentmindedness, Brother Paul places the parchments on the pile of books that are to be discarded. In an effort to get new bookshelves, Sister Bertrille deals with \"Swapping Salvador\", new bookshelves for the old books that were to be discarded anyway. Salvador plans to grind the books into pulp, and with the old books are the parchments. When Brother Paul and Sister Bertrille discover the possible fate of the parchments, Sister Bertrille quickly flies to Salvador's just in time to save the parchments. The two wrongs eventually do make a right as the library comes together beautifully and Brother Paul is assigned to work at the Vatican library.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Rich Little",
        "nm": 514648,
        "roles": [
          {
            "char": "Brother Paul Bernardi"
          }
        ]
      },
      {
        "name": "Peter Mamakos",
        "nm": 540992,
        "roles": [
          {
            "char": "Salvador"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E18",
    "title": "Tonio's Mother",
    "tt": 580881,
    "air_date": "1968-01-04",
    "description": "Widower Luis Armejo and Manuela Garcia are getting married, and everyone in Esperanza, the town in which they live, are happy for them. Among the happy are Luis' son, Tonio. However the attention of his affection changes quickly to Sister Bertrille, who Tonio believes is his mother. He believes so because she came out of the sky - he infers from heaven - and Sister Bertrille really is the spitting image of Luis' first wife. Sister Bertrille, the understanding Manuela and Father Dominic - the town's sage - feel that they can't tell Tonio the truth because it would both destroy Tonio's psyche as well as cause a ruckus due to the incredulity of Sister Bertrille's flight. Luis on the other hand just wants to marry Manuela and get on with leading their lives. When Manuela decides to leave Esperanza to allow Tonio to figure out what he needs in his life, Sister Bertrille decides what's best is for her to leave as quickly as she came, and to explain to Tonio that she came to make sure that someone on Earth was there to love him, that someone being Manuela. As Sister Bertrille takes off on her flight back to San Tanco, Manuela is there as Tonio's support.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392,
            "voice": true
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393,
            "credit only": true
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028,
            "credit only": true
          }
        ]
      },
      {
        "name": "E.J. André",
        "nm": 29191,
        "roles": [
          {
            "char": "Diogenes"
          }
        ]
      },
      {
        "name": "Jan Arvan",
        "nm": 38066,
        "roles": [
          {
            "char": "Socrates"
          }
        ]
      },
      {
        "name": "Nacho Galindo",
        "nm": 302189,
        "roles": [
          {
            "char": "Plato"
          }
        ]
      },
      {
        "name": "Romo Vincent",
        "nm": 898643,
        "roles": [
          {
            "char": "Julio Riaz"
          }
        ]
      },
      {
        "name": "Pat Michenaud",
        "nm": 1663529,
        "roles": [
          {
            "char": "Pablo",
            "as Patrick Michenaud": true
          }
        ]
      },
      {
        "name": "Frank Puglia",
        "nm": 700084,
        "roles": [
          {
            "char": "Father Dominic"
          }
        ]
      },
      {
        "name": "Nico Minardos",
        "nm": 590956,
        "roles": [
          {
            "char": "Luis Armejo"
          }
        ]
      },
      {
        "name": "Arlene Martel",
        "nm": 551458,
        "roles": [
          {
            "char": "Manuela Garcia"
          }
        ]
      },
      {
        "name": "Jean-Michel Michenaud",
        "nm": 585146,
        "roles": [
          {
            "char": "Tonio Armejo",
            "as Gerald Michenaud": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E19",
    "title": "A Fish Story",
    "tt": 580810,
    "air_date": "1968-01-11",
    "description": "Needing a fish for a special meal, Sisters Bertrille and Sixto go to Sister Sixto's Uncle Gus Mendoza, who she considers the most expert fisherman in San Juan. However Uncle Gus has been a little low on his fishing luck, and secretly grabs a fish for the sisters from Lily's Fish Shack, owned by Lily Romano. Apparently, Uncle Gus' luck is due to the the larger fishing companies, who have modern technology, such as sonar and helicopters, to locate schools of fish before someone like Gus can get to them. Gus has been financially supported by his family as well as Lily. But Lily is facing problems of her own as her shop is behind on payments and the bank is threatening to foreclose. To solve everyone's problems, Sisters Sixto and Jacqueline suggest that Sister Bertrille be Gus' overhead fish spotter. They figure she can get away with doing so if she flies between Gus and the sun since Gus is near sighted, so wouldn't be able to tell that it's her flying overhead. She does so. It works, and Gus doesn't know that it's Sister Bertrille leading him to the fish. He thinks she's his Patrona, Santa Rosa. With his earnings, Gus is able to pay back Lily. The problem arises that Sister Bertrille can't do this for Gus forever, especially from the Reverend Mother's perspective. When Sister Bertrille stops showing, Gus thinks Santa Rosa has deserted him. Lily is still facing her problems as the money from Gus isn't sufficient to placate the bank. The major challenge is to convince Gus that the fishing industry has changed and that he needs to find a different way to earn a living. When Sister Bertrille tries to do so, she tells him of Lily's problems. In love with Lily, Gus decides that what's best for everyone is to sell his boat and to go into business with Lily.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Michael Fox",
        "nm": 289147,
        "roles": [
          {
            "char": "Ogden"
          }
        ]
      },
      {
        "name": "Ruben Moreno",
        "nm": 604175,
        "roles": [
          {
            "char": "Pete"
          }
        ]
      },
      {
        "name": "Nick Cravat",
        "nm": 186576,
        "roles": [
          {
            "char": "Gil"
          }
        ]
      },
      {
        "name": "David Hurst",
        "nm": 403588,
        "roles": [
          {
            "char": "Gus Mendoza - Sister Sixto's Uncle"
          }
        ]
      },
      {
        "name": "Norma Crane",
        "nm": 186408,
        "roles": [
          {
            "char": "Lily Romano"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E20",
    "title": "The Hot Spell",
    "tt": 580863,
    "air_date": "1968-01-18",
    "description": "A hot spell is drifting through San Juan, and with it comes gangster Rufus Morgan, who has vowed to take over Carlos' casino. As a favor or repayment for some old air conditioners he donated to the convent, Carlos devises an arrangement, in paper only, with the convent through Sister Bertrille: he is deeding the casino to the convent while Morgan is in town, to be deeded back to him after Morgan leaves. In the meantime, Carlos goes into hiding. Although Carlos' assistant Pedro is running the casino in Carlos' absence, Morgan strong-arms Pedro into getting an official from the convent, that being Sister Bertrille, down to the casino to run things. She does so and gets conned by Morgan into playing in a table stakes poker game. He figures he can win the casino through this method. But the seemingly naive sister out-bluffs Morgan and wins everything she previously lost back. Despite this, the gig is up when Morgan catches Pedro conferring with Carlos on the telephone. The highly superstitious Morgan changes his plans for taking over the casino when Sister Bertrille hovers above his yacht telling him to lay off Carlos. Morgan believes that the vision he is seeing is an omen to get out of San Juan.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Stanley Beck",
        "nm": 65282,
        "roles": [
          {
            "char": "Martin"
          }
        ]
      },
      {
        "name": "Bruce Gordon",
        "nm": 330050,
        "roles": [
          {
            "char": "Rufus Morgan"
          }
        ]
      },
      {
        "name": "Julie Gregg",
        "nm": 339589,
        "roles": [
          {
            "char": "Doris Finch"
          }
        ]
      },
      {
        "name": "Susan Howard",
        "nm": 397622,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "Peter Leeds",
        "nm": 498608,
        "roles": [
          {
            "char": "Burt Remick"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Pedro"
          }
        ]
      },
      {
        "name": "Serena Sande",
        "nm": 761339,
        "roles": [
          {
            "char": "Sister Marguerita"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E21",
    "title": "My Sister, the Sister",
    "tt": 580838,
    "air_date": "1968-01-25",
    "description": "Dr. Jennifer Ethrington, Sister Bertrille aka Elsie Ethrington's older sister, is coming by San Juan en route to Brazil where she is to work in the small remote villages. Sister Bertrille is worried that her sister may be bored by the rather sedate lifestyle of the convent during her stay. But her stay will be anything but sedate as she meets Carlos Ramirez on the flight into San Juan, Carlos who has become smitten with her. Although Jennifer mentions that she has a sister at the convent, Carlos doesn't know it's Sister Bertrille. And although Jennifer mentions to her sister that she has a date with a local, Sister Bertrille doesn't know it's Carlos until he comes by the convent to pick Jennifer up. Despite Carlos being her friend, Sister Bertrille is worried about Jennifer going out with Carlos. The truth for everyone comes out when Sister Bertrille barges in on Jennifer and Carlos' date. Jennifer implies to her sister that she's a big girl who can take care of herself. But Sister Bertrille's prayers are answered when the Reverend Mother asks Sister Bertrille to ask Jennifer to go out to a remote village to take care of a rabid dog bitten patient. For Sister Bertrille, it's just in time as Carlos has just asked Jennifer to marry him. As Jennifer thinks about the proposal, Carlos, Jennifer and Sister Bertrille fly off in Carlos' plane to the village. The trip is a disaster for Carlos in his perception of how Jennifer sees him as a potential mate living in the outback of Brazil - he falls in a swamp, faints when helping Jennifer with the patient, and in an accident falls on some broken glass which requires some stitches in his derrière. Carlos is mad about the situation and mad at Sister Bertrille, who he thinks has purposely sabotaged his relationship with Jennifer who has declined his proposal. Sister Bertrille is upset that the damage to their friendship may be irreparable. But Jennifer clears the air with Carlos, this act repairing his friendship with Sister Bertrille. Jennifer tells him that her sister had nothing to do with her declining his marriage proposal. To make Carlos even happier, Jennifer reminds him that if they did get married, Sister Bertrille would become his sister-in-law, which he's not quite ready for.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Luis de Córdova",
        "nm": 208221,
        "roles": [
          {
            "char": "Doctor",
            "as Louis de Cordova": true
          }
        ]
      },
      {
        "name": "Patricia O'Herlihy",
        "nm": 2047412,
        "roles": [
          {
            "char": "Stewardess"
          }
        ]
      },
      {
        "name": "Carmelita",
        "nm": 138360,
        "roles": [
          {
            "char": "Little Girl"
          }
        ]
      },
      {
        "name": "Miguel Monsalve",
        "nm": 2046767,
        "roles": [
          {
            "char": "Little Boy"
          }
        ]
      },
      {
        "name": "Jackie Brown",
        "nm": 2045712,
        "roles": [
          {
            "char": "Village Child"
          }
        ]
      },
      {
        "name": "Elinor Donahue",
        "nm": 231942,
        "roles": [
          {
            "char": "Jennifer"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E22",
    "title": "Sister Lucky",
    "tt": 580844,
    "air_date": "1968-02-01",
    "description": "Running into a craps game down at the docks, Sister Bertrille is renamed Sister Lucky by Juan, whose luck has changed for the better with the sister's arrival. The Reverend Mother however makes Sister Bertrille return Juan's donation since it was obtained through gambling as well as through the false pretense of Sister Bertrille being his lucky charm. He refuses to take the money back, so Sister Bertrille starts an impromptu craps game just to prove she isn't his lucky charm. Not only does she fail to do so - Juan's dice throwing is red hot - but she and the rest of the gamblers get hauled off to jail when the police arrive on the scene. Down at the jail solely to get her out of jail, Sister Bertrille convinces Carlos and Captain Lopez that Carlos, the professional gambler, should gamble with Juan one-on-one to prove that she isn't his lucky charm. It doesn't start out well as Juan wins when the sister is there and loses when the sister isn't. Finally the streak turns as Juan loses when the sister is present. Unfortunately Juan is out of money and his markers are worthless. Rather than let Carlos' lawyers deal with the situation, Sister Bertrille proposes that Carlos let Juan work at the casino to pay off his debt and more importantly work off his zest for gambling.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Booth Colman",
        "nm": 172884,
        "roles": [
          {
            "char": "Bishop Parnell"
          }
        ]
      },
      {
        "name": "Michael Constantine",
        "nm": 176073,
        "roles": [
          {
            "char": "Juan"
          }
        ]
      },
      {
        "name": "Jamie Farr",
        "nm": 268026,
        "roles": [
          {
            "char": "Manuel"
          }
        ]
      },
      {
        "name": "Thomas A. Geas",
        "nm": 311315,
        "roles": [
          {
            "char": "1st Workman",
            "as Tom Geas": true
          }
        ]
      },
      {
        "name": "Raoul Perez",
        "nm": 673599,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "Bert Santos",
        "nm": 763995,
        "roles": [
          {
            "char": "2nd Workman"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Captain Dominic Lopez"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E23",
    "title": "The Sister and the Old Salt",
    "tt": 580878,
    "air_date": "1968-02-08",
    "description": "Sister Bertrille meets Captain Otis Barnaby while he's working on his small boat, which he plans to sail to Miami. Captain Barnaby is as stereotypical an old seafaring captain as one could imagine. However looks can be deceiving. The stories he tells the sisters and the kids at the convent of his seafaring days are all tales of fancy as Otis Barnaby is no captain and is as much of a landlubber as one can be having lived his entire life in Lincoln Nebraska. Conrad, his son, wants Sister Bertrille to persuade Otis not to make the dangerous voyage. Nothing will dissuade him and he sets sail for Miami. A storm sets in and all at the convent are worried for his safety. He radios the convent. He is weak and without supplies - they went overboard - but his pride refuses to let them call in the Coast Gurad to rescue him. Armed with the necessary supplies, Sister Bertrille takes flight when the weather clears to find Otis at sea. She locates him. He thinks that she's a figment of his imagination. Once she sees that he's OK, she takes off once again to leave him to continue his voyage on his own. When Otis radios in to Conrad that he had a visit from \"Sister Figment\", Conrad promptly calls in the Coast Guard to save his obviously sick father. Sister Bertrille tries to convince Conrad to call off the Coast Guard, that his father isn't crazy, that Otis will finish his dream trip to Miami and that it really was her out at the boat. The statistician Conrad isn't convinced until Sister Bertrille gives him a flying demonstration. He ends up calling off the Coast Guard and Otis safely makes it to Miami.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Carmelita",
        "nm": 138360,
        "roles": [
          {
            "char": "Girl"
          }
        ]
      },
      {
        "name": "Jonathan Daly",
        "nm": 198463,
        "roles": [
          {
            "char": "Conrad Barnaby"
          }
        ]
      },
      {
        "name": "J. Pat O'Malley",
        "nm": 641729,
        "roles": [
          {
            "char": "Captain Otis Barnaby"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E24",
    "title": "Cyrano de Bertrille",
    "tt": 580820,
    "air_date": "1968-02-22",
    "description": "Pedro Alvarez and Juan Cortez are business partners of a produce business, Juan the business oriented partner, Pedro the customer oriented partner. When Pedro reveals he is illiterate (he can't read a letter from his girlfriend in Miami, Ethel Tarnower), Sister Bertrille suggests that he learn to read and write. He takes her suggestion and shows up unannounced in her kindergarten class. Although she doesn't think her class the best venue, Sister Bertrille is buoyed by Pedro's eagerness. Others are not as easily swayed. The Reverend Mother is echoing the concerns of traditional Bishop Pool that Pedro would be a disruptive influence to the convent, and Juan just wants Pedro back at work. But Sister Bertrille eventually convinces the Reverend Mother that Pedro should stay since his learning progress would convince Bishop Pool of the need for an adult English class. In class, Pedro has a roller coaster of emotions matching his learning curve, which is mainly flat. Just as Pedro's about to quit, Sister Bertrille convinces him to stay by telling him of the importance of books, as demonstrated by the sonnets of Elizabeth Barrett Browning, and the fact that Ethel will soon be visiting when he can recite sonnets to her. At the bishop's first inspection, he is less than impressed by Pedro's demonstration, first by the fact that Pedro didn't read but memorized a sonnet that he recited, and second in a banner he made for the bishop where Pedro spelled the bishop's last name Fool. But there is another month until the end of the semester and Pedro will have to be better prepared for the bishop's next visit then. Pedro's progress is steep this time, and is all ready for the bishop when all of a sudden he stops his learning. Ethel has sent him a letter, a letter he reads himself. It is a Dear John letter. He feels his reason for learning is no more. On the bishop's next visit, Sister Bertrille finally convinces Pedro to show up. Pedro does, not to make a presentation, but rather to tell the bishop all the benefits that reading and writing has provided him. The most important of these benefits is that he can now read the business' books, and has learned that Juan has been robbing him blind for the past 15 years.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028,
            "credit only": true
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Oliver McGowan",
        "nm": 569685,
        "roles": [
          {
            "char": "Bishop Pool"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Juan Cortez"
          }
        ]
      },
      {
        "name": "David Garfield",
        "nm": 307260,
        "roles": [
          {
            "char": "Truck Driver",
            "as John Garfield Jr.": true
          }
        ]
      },
      {
        "name": "Tony Davis",
        "nm": 205575,
        "roles": [
          {
            "char": "Donald"
          }
        ]
      },
      {
        "name": "Carmelita",
        "nm": 138360,
        "roles": [
          {
            "char": "Carmen"
          }
        ]
      },
      {
        "name": "Albert Paulsen",
        "nm": 667292,
        "roles": [
          {
            "char": "Pedro Alvarez"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E25",
    "title": "The Reconversion of Sister Shapiro",
    "tt": 580876,
    "air_date": "1968-02-29",
    "description": "Carlos Ramirez's adopted niece visits, but Carlos has to leave the island for a business trip. Sister Bertrille tells Linda she can stay at the convent.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Laurence Haddon",
        "nm": 352736,
        "roles": [
          {
            "char": "Mr. Shapiro"
          }
        ]
      },
      {
        "name": "June Whitley Taylor",
        "nm": 926046,
        "roles": [
          {
            "char": "Mrs. Shapiro",
            "as June Whitley": true
          }
        ]
      },
      {
        "name": "Pamelyn Ferdin",
        "nm": 272244,
        "roles": [
          {
            "char": "Linda Shapiro"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E26",
    "title": "Where There's a Will",
    "tt": 580885,
    "air_date": "1968-03-14",
    "description": "In the will of a benefactor, the convent is the sole beneficiary of the estate. Unfortunately the only asset of the estate is the contract of a boxer, the Buffalo Buzzsaw aka Mike Sever. The sisters cannot keep Mike in any sense of the word, let alone let him stay at the convent, and Mike has no where else to go. So they let him stay temporarily in the gardener's quarters and work as the convent's odd job man. They learn that Mike is not a prize winning fighter, and has not had a bout in over two years. The sisters want to give him his freedom, but Mike likes it at the convent. They can't \"sell\" his contract out of principle, but with Carlos' help, they decide that it may be for the best. They get Mike into training and eventually get him a bout, at which they hope to attract a manager who will buy Mike's contract and give him the boxer's life he really deserves. When Mike finds out, he runs off. Sister Bertrille finds him and finds out the reason for running off and for not having a bout in two years: he likes it at the convent, doesn't want to sold like chattel anymore, and most importantly hates boxing, at least the hitting others part of it. He would prefer to get beaten to a pulp than to punch someone else out cold. Mike decides to fight to help the sisters, and with a one-two punch, knocks his opponent out cold, although he is traumatized by it. But they receive several offers for his contract. What the sisters decide to do is give Mike his own contract to negotiate. What he wants and decides to do is to tear up the contract and work for Carlos, not as a fighter but as a chef in his restaurant. This act starts a new career for the Buffalo Buzzsaw.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Regis Cordic",
        "nm": 179571,
        "roles": [
          {
            "char": "Mr. Bragen",
            "as Rege Cordic": true
          }
        ]
      },
      {
        "name": "Ron Masak",
        "nm": 556041,
        "roles": [
          {
            "char": "Mike"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E27",
    "title": "The Puce Albert",
    "tt": 580874,
    "air_date": "1968-03-21",
    "description": "Carlos Ramirez is doing his mandatory 2-week active duty with the marine corps, and is stationed on a small remote island near San Juan. His battalion is scheduled to do large-scaled battle maneuvers, and Sister Bertrille is watching over him from afar, but Carlos doesn't initially need any help as he is coping just fine with a large stash of libations, gourmet food and female companions transported to the island via his yacht. His commanding officer, Captain Daniel J. \"Do-or-Die\" Dolger, finally catches up with Carlos' ant-military ways. The captain threatens to make life miserable for Carlos not only for the 2-weeks but well beyond. Carlos learns that the captain and the Reverend Mother are old friends, actually cousins, so Carlos sends message via Ginger - one of his female companions - to Sister Bertrille to come to the island on an emergency. When the Reverend Mother learns that it's her cousin that is the cause of Carlos' emergency, she tries to call her cousin, but cannot get through the Red Alert the island is under at the start of the maneuvers, and thus does send Sister Bertrille to at least investigate what's going on. Sister Bertrille does manage to make it through the Red Alert and to speak to Carlos, who wants the Reverend Mother to intercede on his behalf with her cousin. Since the Reverend Mother has already tried via telephone, Carlos suggests to Sister Bertrille that she fly a letter back to the island from the Reverend Mother to the captain. The captain catches Sister Bertrille on the island before she can do so. After she tells the captain she flew there, he tries to confirm the story with the Reverend Mother, who does confirm Sister Bertrille's story. He first thinks that they are all working for the enemy until the Reverend Mother convinces him otherwise. But the cousins get into a war of words and a war of control over their respective charges. When the captain returns to the island, he does ask the sister to demonstrate her abilities, she unable to do so due to the lack of wind. Just at that moment, the enemy is ready to attack. As the military men go back to their maneuvers, the wind picks up and Sister Bertrille makes it off the island. Sister Betrille reports back to Carlos that the ships they see off the island are only decoys and the real attack is approaching from the other side of the island. When Carlos tells Captain Dolger the information as well as its source, the captain does not believe him. The captain finally takes Carlos' advice when he sees an airborne Sister Bertrille. Because of the information, they win the maneuvers, and Captain Dolger, Carlos and Sister Bertrille are all heroes.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392,
            "voice": true
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Toby Alder",
        "nm": 2020266,
        "roles": [
          {
            "char": "Ginger"
          }
        ]
      },
      {
        "name": "Barry Christensen",
        "nm": 2015733,
        "roles": [
          {
            "char": "Marine #1"
          }
        ]
      },
      {
        "name": "John Dehner",
        "nm": 215000,
        "roles": [
          {
            "char": "Capt. Daniel J. Dolger"
          }
        ]
      },
      {
        "name": "Hal England",
        "nm": 257435,
        "roles": [
          {
            "char": "Lt. Willis"
          }
        ]
      },
      {
        "name": "John Newton",
        "nm": 628541,
        "roles": [
          {
            "char": "Colonel"
          }
        ]
      },
      {
        "name": "Barry Russo",
        "nm": 241189,
        "roles": [
          {
            "char": "Guard"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E28",
    "title": "May the Wind Be Always at Your Back",
    "tt": 580835,
    "air_date": "1968-03-28",
    "description": "Bridgett Faulkner and Joel Bascomb reluctantly accept their prizes donated by Carlos Ramirez as the top students at the convent, the award being a day out on the town and dinner at the Captains Table. For bookwormish, self-consciously Plain-Janish and headstrong Bridgett, it is a day of frivolity that she cannot afford to take as it will take away from study time. Joel follows Bridgett's every move, as he idolizes her. On the day out, Bridgett eventually falls under Carlos' spell, Carlos who was only trying to be nice. Bridgett changes her focus from her school work to making herself look beautiful for Carlos. Joel on the other hand is jealous. Out of concern and out of jealousy, he tells Sister Bertrille what Bridgett is up to. The sister and Carlos figure that he needs to tell Bridgett directly that he is only her friend and could be nothing more, but is late in doing so and Bridgett explodes when she catches Carlos romantically with another woman. Despite Bridgett's anger, Sister Bertrille convinces Joel that he should tell Bridgett how he really feels about her. He does and the reality of more appropriate puppy love comes to light.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Cindy Cassell",
        "nm": 144062,
        "roles": [
          {
            "char": "Bridgett Faulkner"
          }
        ]
      },
      {
        "name": "Geoffrey Deuel",
        "nm": 222003,
        "roles": [
          {
            "char": "Waiter"
          }
        ]
      },
      {
        "name": "Craig Huxley",
        "nm": 402137,
        "roles": [
          {
            "char": "Joel Bascomb",
            "as Craig Hundley": true
          }
        ]
      },
      {
        "name": "Maura McGiveney",
        "nm": 569405,
        "roles": [
          {
            "char": "Candy Cain"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Head Waiter"
          }
        ]
      },
      {
        "name": "Keith Schultz",
        "nm": 776283,
        "roles": [
          {
            "char": "Student"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E29",
    "title": "Love Me, Love My Dog",
    "tt": 580832,
    "air_date": "1968-04-04",
    "description": "Janus Zayukovsky, a.k.a. The Gypsy, is a reformed thief. However his dog, Raffles, isn't so reformed. Raffles snatches a purse and Janus pays the price by being hauled off the jail. While Janus is behind bars, Raffles is off to fend for himself. He comes across the sisters and the children on an outing, the sisters who take him back to the convent since he has bonded with loner child Jamie. They feel that Raffles can help Jamie get out of his shell, and the Reverend Mother agrees, temporarily lifting the no animal policy at the convent. But Raffles shows his true colors to the sisters by snatching wallet after purse after briefcase. In their delivery of the purses back to their rightful owners, the sisters have a close encounter of the uncomfortable kind with a police officer, this encounter giving Raffles the opportunity to transfer the purses from the sisters' station wagon into the officer's patrol car. Sisters Bertrille and Jacqueline want to rehabilitate Raffles, but the Reverend Mother disagrees, and decides that Raffles needs to be sent to the pound pending his rightful owner contacting them within the next couple of days. Just as they are ready to send Raffles to the pound, Janus is released from jail and sees the ad the sisters have placed regarding Raffles. However when Janus gets to the convent, Jamie has run off with Raffles. But Sister Bertrille knows where to find him - in his \"safe place\" on the beach. The sisters tell Jamie that Janus has come to reclaim him and that they, the kids included, are going to help Janus reform Raffles. Janus ends up getting a nice place and good job and the reformation of Raffles from stealing purses and wallets, with the help of Jamie, is going well. Unfortunately Raffles has moved onto hubcaps and car curb feelers instead. The reformation will take some more work.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Martin Ashe",
        "nm": 38816,
        "roles": [
          {
            "char": "Monsignor Houk"
          }
        ]
      },
      {
        "name": "Carmelita",
        "nm": 138360,
        "roles": [
          {
            "char": "Carmelita"
          }
        ]
      },
      {
        "name": "Dort Clark",
        "nm": 163888,
        "roles": [
          {
            "char": "Earl"
          }
        ]
      },
      {
        "name": "Mark Dymally",
        "nm": 1435251,
        "roles": [
          {
            "char": "Jamie"
          }
        ]
      },
      {
        "name": "Neil Nephew",
        "nm": 123392,
        "roles": [
          {
            "char": "Janus Zayukovsky - The Gypsy",
            "as Neil Burstyn": true
          }
        ]
      },
      {
        "name": "Raffles",
        "nm": 2007843,
        "roles": [
          {
            "char": "Dog"
          }
        ]
      },
      {
        "name": "Frank Ramirez",
        "nm": 1828862,
        "roles": [
          {
            "char": "Peralta"
          }
        ]
      },
      {
        "name": "Jeanne Sorel",
        "nm": 814801,
        "roles": [
          {
            "char": "Tourist Lady"
          }
        ]
      },
      {
        "name": "Kay Stewart",
        "nm": 829558,
        "roles": [
          {
            "char": "Mrs. Benson"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E30",
    "title": "You Can't Get There from Here",
    "tt": 580888,
    "air_date": "1968-04-11",
    "description": "Sister Bertrille crash lands on a remote and seemingly deserted island after the wind dies on one of her flights. Unfortunately her cornette lands in the water and is torn, and she is thus stranded at least until her cornette is repaired and is dried and starched. But she is not alone as she sees a footprint in the sand. Her island mate turns out to be Carlos Ramirez, who is also stranded on the island as his date, April Chance, pushed him off his yacht when he got too fresh with her and sailed off without him. So now it's a matter of survival for the pair. They manage to build a fire and catch fish for food. But when they go in opposite directions to find fresh water, Sister Bertrille stumbles on yet another person on the other side of the island. It's April, who accidentally sank Carlos' yacht. She too is stranded. Sister Bertrille keeps the two feuding lovers apart and unknown that the other is on the island. They all individually try to repair Sister Bertrille's cornette, while the sister tries to mend the fences between the two ex-lovers. The sister's efforts fail and eventually Carlos and April see each other on the island, and their feud begins once again. It isn't until they need to bond together to save Sister Bertrille, who has fallen into quicksand, that Carlos and April end their feud and rekindle their romance. Their efforts to repair, dry and starch (using coconut milk) the cornette are eventually successful and the sister can finally fly off the island to get help.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392,
            "voice": true
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Bridget Hanley",
        "nm": 360063,
        "roles": [
          {
            "char": "April Chance"
          }
        ]
      },
      {
        "name": "Maureen Arthur",
        "nm": 37802,
        "roles": [
          {
            "char": "Bobbye Starr",
            "archive footage": true
          }
        ]
      },
      {
        "name": "Herb Edelman",
        "nm": 248983,
        "roles": [
          {
            "char": "Albion 'Al' Caine",
            "uncredited": true
          }
        ]
      },
      {
        "name": "Jean Marie Ingels",
        "nm": 408731,
        "roles": [
          {
            "char": "Marie",
            "archive footage": true
          }
        ]
      },
      {
        "name": "E.J. Peaker",
        "nm": 668855,
        "roles": [
          {
            "char": "Diane",
            "archive footage": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E01",
    "title": "Song of Bertrille",
    "tt": 580847,
    "air_date": "1968-09-26",
    "description": "Sister Bertrille almost becomes a movie star after appearing on TV in a children's show starring a clown named 'Claudio' who is played by Paul Winchell. The episode is entitled 'My Sister, the Star' and it aired in 1967. The songs that Sister Bertrille sings in this episode is 'A Whole New World'[Music by Jack Keller/Lyrics by Bob Russell] and the other song she sings at the beginning of the episode is 'World Inside Your Pillow'[Music by Helen Miller/Lyrics by Howard Greenfield].",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          },
          {
            "char": "Elsie Ethrington"
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Jerry Hausner",
        "nm": 369617,
        "roles": [
          {
            "char": "Manny Julian"
          }
        ]
      },
      {
        "name": "Larry Joseph",
        "nm": 1264503,
        "roles": [
          {
            "char": "Julius"
          }
        ]
      },
      {
        "name": "Maggie Malooly",
        "nm": 540622,
        "roles": [
          {
            "char": "Woman at Carlos a Go-Go"
          }
        ]
      },
      {
        "name": "Paul Petersen",
        "nm": 676928,
        "roles": [
          {
            "char": "Sonny Howard",
            "as Paul Peterson": true
          }
        ]
      },
      {
        "name": "The Sundowners",
        "nm": 2164351,
        "roles": [
          {
            "char": "Themselves"
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "Ramon"
          }
        ]
      },
      {
        "name": "Roberto Zalaya",
        "nm": 2070044,
        "roles": [
          {
            "char": "Man at Carlos a Go-Go"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E02",
    "title": "The Crooked Convent",
    "tt": 580856,
    "air_date": "1968-10-03",
    "description": "The new Captain of Police, Gaspar Fomento, is frequenting the convent's bazaar. Carlos has donated a lot to the bazaar, has won some of his donations back, and the captain has lost much. He has suspicions that the convent and Carlos are working together in a gambling ring. His suspicions increase when Sister Bertrille, in order to placate the captain, gives him back his losings from the bazaar, which the captain thinks is a bribe. To gather evidence, the captain sends in one of his assistants, Nacio, to work undercover at the convent. Nacio is working undercover of his own, as a real life bookie. When Sisters Jacqueline and Bertrille discover Nacio is taking bets at the convent, they want to warn him not to come back as they believe Captain Fomento is on to him. The captain overhears the sisters talking about horse racing and bookies, strengthening his suspicions about the illegal gambling by the sisters. Sister Bertrille goes to the race track to warn Nacio, but also to fill him in on Sister Jacqueline's expert opinions on the miserable bets that Nacio will be making. When Nacio sees Sister Bertrille fly, he figures he'd be crazy not to do what the sister tells him. In the meantime, Captain Fomento has hauled all the sisters and Carlos down to the police station to arrest them for illegal gambling. When Carlos arrives, he tells the captain that Nacio was the one doing illegal activities and was originally doing it from the police station. Before leaving San Juan for good, Nacio placed a long shot bet on one of Sister Jacqueline's picks, the bet on behalf of the convent and which paid off. The convent is $500 richer, and Chief Galindo, Captain Fomento's superior, strips Captain Fomento of his stripes due to his failure in this investigation.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Don Diamond",
        "nm": 224614,
        "roles": [
          {
            "char": "Chief Galindo",
            "ch": 89659
          }
        ]
      },
      {
        "name": "Frank Ramirez",
        "nm": 1828862,
        "roles": [
          {
            "char": "Nacio"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      }
    ]
  },
  {
    "se": "S02E03",
    "title": "The Rabbi and the Nun",
    "tt": 580875,
    "air_date": "1968-10-10",
    "description": "The Temple Beth Sholom overseen by Rabbi Mendez is the only synagogue in San Juan. Rabbi Mendez has a problem. Engaged couple Alfredo Acquilar and Sophia Baldazon want to get married but the temple is too small to hold all their invited guests. So Sister Bertrille convinces all to hold the ceremony on the grounds of the convent. All is going well until Alfredo, a heavy gambler, loses his honeymoon money at Carlos' casino. Sister Bertrille wants Carlos to show Alfredo and Sophia, who happens to be his bookkeeper, some kindness and \"return\" the money via losing at a fixed craps game using loaded dice. Carlos is reluctant since he does run a legitimate business, but concedes as usual to Sister Bertrille wishes. She convinces Alfredo to go along with it since she says she had a premonition of him winning at something that looked liked craps. Two unfortunate things happen during the craps game. First, Alfredo refuses to stop after he wins back his honeymoon money. And second, Captain Fomento comes by the casino and finds the loaded dice. Carlos is thrown in jail. Carlos is furious with Sister Bertrille, but his anger softens when Captain Fomento drops the charges on the advice of Rabbi Mendez. So Alfredo and Sophia get married and live happily ever after. But first Carlos has to bail out Alfredo once again with the provision of his yacht as Alfredo lost the honeymoon money at yet another casino.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Lillian Adams",
        "nm": 11148,
        "roles": [
          {
            "char": "Grandma"
          }
        ]
      },
      {
        "name": "Harold Gould",
        "nm": 332390,
        "roles": [
          {
            "char": "Rabbi Mendez"
          }
        ]
      },
      {
        "name": "Edmund Hashim",
        "nm": 368034,
        "roles": [
          {
            "char": "Alfredo Acquilar"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      },
      {
        "name": "Frances Spanier",
        "nm": 1478969,
        "roles": [
          {
            "char": "Sophia Baldazon"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E04",
    "title": "The Return of Father Lundigan",
    "tt": 580877,
    "air_date": "1968-10-17",
    "description": "Sister Bertrille needs to see Dr. Paredes, the dentist, to have a toothache fixed, but Sister Bertrille is scared of dentists. So the Reverend Mother goes with her to hold her hand. To calm Sister Bertrille's nerves, Dr. Paredes puts her under hypnosis. However the Reverend Mother accidentally gets hypnotized at the same time. Fascinated by this, Carlos wants to see the results of the hypnosis, and as a lark, Dr. Paredes gives them a post-hypnotic suggestion: every time they hear the word \"red\", Sister Bertrille will act like the Reverend Mother and the Reverend Mother will act like Sister Bertrille. It works. Before Dr. Paredes needs to rush off, he fixes Sister Bertrille's tooth and brings both women out of hypnosis. However he forgets to remove the post-hypnotic suggestion. Unfortunately, this act coincides with Father Lundigan's visit to the convent, Father Lundigan the church's psychiatrist. Last Father Lundigan visited, he had a year of therapy since all the sisters tried to convince him that Sister Bertrille could fly and he thought he imagined Sister Bertrille flying outside his airborne airplane (it actually was her). Father Lundigan says \"red\" in front of the women, and they start acting like each other. The worse part about it is that the Reverend Mother believes she can fly as she is acting like Sister Bertrille. Father Lundigan thinks the sisters are once again going crazy and quickly rushes off back to the mainland to provide his report as such to the bishop. Just as Father Lundigan leaves, Dr. Paredes arrives to take the post-hypnotic suggestion off. Once back to their own selves, Sister Bertrille finds out from Sister Jacqueline about Father Lundigan's visit. The only thing Sister Bertrille can do to convince the Father that she can fly is to fly up to his airborne airplane, which she does. Father Lundigan sees her outside the plane, and once again will have to undergo more therapy himself.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Stefani Warren",
        "nm": 913040,
        "roles": [
          {
            "char": "Stewardess"
          }
        ]
      },
      {
        "name": "Sid Haig",
        "nm": 354085,
        "roles": [
          {
            "char": "Señor Quesada"
          }
        ]
      },
      {
        "name": "Paul Lynde",
        "nm": 1489,
        "roles": [
          {
            "char": "Father Lundigan"
          }
        ]
      },
      {
        "name": "Bernie Kopell",
        "nm": 465728,
        "roles": [
          {
            "char": "Dr. G. Paredes"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E05",
    "title": "The Convent Is Condemned",
    "tt": 580854,
    "air_date": "1968-10-24",
    "description": "By-the-book Captain Fomento is getting bored in San Tanco, a town where he says nothing exciting happens, and is thinking of resigning. He has even resorted to threatening the sisters with a ticket for their non-licensed old clothing drive, and has given citations to his own mother for jaywalking and his brother-in-law, who happens to be the police chief, for littering. To get him from not resigning, Sister Bertrille tells him that there is a crime wave at Carlos' casino: ashtrays have been stolen. Carlos actually encourages it as they have the advertising \"Stolen from Casino Carlos\" on them. Captain Fomento just sees Carlos as aiding and abetting thieves. Once the captain raids the casino and threatens to haul off all those with ashtrays in their possession, Carlos decides that he is going to take the Mayor of San Filipe up on his offer to move the casino there as San Filipe does not have a Captain Fomento with which to deal. Sister Bertrille, playing on Carlos' philanthropic nature toward the convent, hatches a plan to keep Carlos in San Tanco. In the captain's presence, the sisters imply that there is one building code violation after another at the convent. The captain promptly condemns the building. When Sister Bertrille tells Carlos what has happened thinking that he will stay and bail them out, Carlos seems non-plussed. In actuality, he sees through the sister's story and is touched by the act and decides to stay. Now they just have to convince the captain that the convent isn't really in a condemned state. They tell him that because they cannot afford to make all the repairs, they are selling the convent to Carlos, who will turn it into a nightclub. For the pious captain, that move would be sacrilege, and thus he overturns his own decision and declares the convent a national historical monument exempt from building code requirements.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "Ramon"
          }
        ]
      },
      {
        "name": "Jack Fife",
        "nm": 1338868,
        "roles": [
          {
            "char": "Man in Casino"
          }
        ]
      },
      {
        "name": "Birdie Oreck",
        "nm": 1574444,
        "roles": [
          {
            "char": "Woman in Casino"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      }
    ]
  },
  {
    "se": "S02E06",
    "title": "The Organ Transplant",
    "tt": 580871,
    "air_date": "1968-11-07",
    "description": "Carlos will do anything to get away from Manuel, who wants Carlos to audition his step-niece by marriage for his nightclub show. Even after he sees and starts dating the beautiful Felicia, Carlos still doesn't want to audition her since he has had bad luck with Manuel's clients, and he doesn't want to ruin the his image of Felicia with what he supposes will be a horrible audition. Carlos will even help Sister Bertrille rather than audition Felicia. First, he runs off to help Sister Bertrille move the convent's newly acquired pipe organ to the convent, and second, he runs off to help move the said organ from the convent. You see, the organ is causing the convent some problems. It is an old, somewhat garish instrument whose air pump is not working properly. Once they get over that issue with the help of a blowing vacuum cleaner, the organ has a couple of glass shattering keys, in particular high-C. This final problem is just too much for the sisters to keep the organ. As Carlos rushes off to the convent for this final move, Felicia tracks him down at the convent and auditions for him right then and there, playing the organ and singing. She's very good and Carlos is mesmerized. He hires her on the spot and takes the organ off the sisters' hands for Felicia's act. However Sister Bertrille forgets to tell them about the problematic high-C key, and at the end of Felicia's act, Carlos has an unfortunate and unexpected glass bill.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Fabian Dean",
        "nm": 212770,
        "roles": [
          {
            "char": "Auctioneer"
          }
        ]
      },
      {
        "name": "Jose Haas",
        "nm": 1571578,
        "roles": [
          {
            "char": "Doorman"
          }
        ]
      },
      {
        "name": "Joseph Bernard",
        "nm": 76282,
        "roles": [
          {
            "char": "Manuel",
            "as Joe Bernard": true
          }
        ]
      },
      {
        "name": "Abbe Lane",
        "nm": 485219,
        "roles": [
          {
            "char": "Felicia Fiero"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E07",
    "title": "Two Bad Eggs",
    "tt": 580882,
    "air_date": "1968-11-14",
    "description": "Condorillo hawks and their eggs are outlawed by the authorities since they are considered a nuisance, especially to sugar cane farmers. However Sister Bertrille stumbles across a pair of such orphaned eggs and cannot in good conscience leave them unattended to die. She plans on hatching the eggs at the convent. This act draws mixed reactions. A couple of tourists, who see Sister Bertrille fly to get the eggs, think she's from outer space and is hatching like aliens. And Carlos uses Sister Bertrille's need for transporting her incubation equipment as an excuse to avoid Margo Richmond, a wealthy but serious women who Carlos thinks is coming to take him up on his offer to marry him (he asks all women to marry him, and all except perhaps Margo know it's a joke). He plans and gets permission to hide out at the convent. Everyone eventually descends onto the convent. First, Margo finds out Carlos is there but she in fact does not want to marry him. She is just stopping by to give him a gift of a shotgun before she heads off to her own wedding. However Carlos thinks she's there to shoot him, and he gets dressed up as a nun as a disguise and drives off. And second, Captain Fomento finds out that Sister Bertrille has the contraband eggs - which have since hatched - tipped off by the tourist couple who are with Captain Fomento in tow. When the couple see Carlos as a nun, Sister Bertrille flying again, and later Sister Bertrille with two young orphaned twins in church choir outfits, they are convinced that the alien eggs have hatched. With the captain, Sister Bertrille makes quick escape with the baby hawks before the captain finds her. She finds a nice home for her babies at the San Juan Zoo.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Diana Herbert",
        "nm": 378530,
        "roles": [
          {
            "char": "Millie",
            "as Diana Herbert-Markes": true
          }
        ]
      },
      {
        "name": "Del Moore",
        "nm": 601111,
        "roles": [
          {
            "char": "Fred"
          }
        ]
      },
      {
        "name": "Lew Palter",
        "nm": 658817,
        "roles": [
          {
            "char": "Zoo Man"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "Ramon"
          }
        ]
      },
      {
        "name": "Terry Walkey",
        "nm": 2080686,
        "roles": [
          {
            "char": "Twin"
          }
        ]
      },
      {
        "name": "Tim Walkey",
        "nm": 908331,
        "roles": [
          {
            "char": "Twin",
            "as Timmy Walkey": true
          }
        ]
      },
      {
        "name": "Stefani Warren",
        "nm": 913040,
        "roles": [
          {
            "char": "Margo Richmond"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E08",
    "title": "All Alone by the Convent Phone",
    "tt": 580815,
    "air_date": "1968-11-21",
    "description": "While everyone else is at a charity benefit, Sister Bertrille is alone at the convent nursing sick child Felix. She hears a news bulletin on the radio that escaped convict Ignacio Ferrante is in the vicinity of San Tanco, and she gets worried for her and Felix's safety. Captain Fomento confirms her fears about how dangerous Ferrante is. Sister Bertrille wants so much for a strong man to be around to protect her and Felix, she lets in a stranded man whose car has broke down outside the convent. Sister Bertrille isn't concerned as the man doesn't match the mustached description of Ferrante. However when the man is surprised by the presence of Felix - Sister Bertrille had told him that they were alone - the man reveals himself by pulling a gun that he is indeed a shaved Ferrante. To protect Felix, the sister tells him the gun is a toy. A complication arises when Captain Fomento comes back to the convent, he who sees the unfamiliar car. By this time, Ferrante has further disguised himself as a nun, who Sister Bertrille introduces as the Mother General, who doesn't speak due to a vow of silence. The captain discloses to Sister Bertrille and who he thinks is the Mother General the plans to capture Ferrante. The \"Mother General\" also asks Fomento for a gun for protection from Ferrante. With a gun-less captain, a gun in his own hands and the knowledge of what the police are up to, Ferrante reveals himself to the captain. Ferrante is certain he can escape with the sister and captain as his shields. But Fomento, fed up with his boring existence in San Tanco, stands up to Ferrante despite Ferrante having his gun. With a little help from Sister Bertrille who goes airborne which distracts Ferrante, Fomento manages to overtake Ferrante. Fomento becomes a hero for overtaking the dangerous criminal singlehandedly without a gun. It isn't until he actually hears this fact that it sinks into his head what happened. Fomento thus does only what he can do under the circumstances: faint!",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392,
            "credit only": true
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393,
            "credit only": true
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028,
            "credit only": true
          }
        ]
      },
      {
        "name": "Linnard Lane",
        "nm": 485434,
        "roles": [
          {
            "char": "Felix"
          }
        ]
      },
      {
        "name": "Cliff Osmond",
        "nm": 652109,
        "roles": [
          {
            "char": "Ignacio Ferrante"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      },
      {
        "name": "Frank Ramirez",
        "nm": 1828862,
        "roles": [
          {
            "char": "Nacio",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E09",
    "title": "It's an Ill Windfall",
    "tt": 580831,
    "air_date": "1968-11-28",
    "description": "This episode is one of misunderstandings stemming from a $5,000 donation from Juan Hernando. Juan Hernando is a former orphan of the convent before the Reverend Mother's time. He wants to show his appreciation of the convent for his growing up period. The misunderstandings start when the $5,000 check is destroyed and the sisters, who have never met Juan Hernando, try to find him so that he can write them another check. Sister Bertrille finds a Juan Hernando, who she thinks is the Juan Hernando for who she is is searching. This Juan Hernando - Honest Juan Hernando as he calls himself - is in fact not, but a crooked politician. When Sister Bertrille mentions the $5,000 donation, he misunderstands and thinks the sisters are donating to his mayoralty campaign. The next misunderstanding happens when Honest Juan Hernando tells his constituents that he is being supported by the sisters, after which the bishop reads about their support and thinks the sisters are indeed mixing religion and politics, but worse yet supporting a crook. Honest Juan Hernando finally figures out that the sisters have him confused with someone else, but fails to clear up the confusion as he figures their support will get him elected, when he can use public funds to do whatever he wants include donating $5,000 to the convent. The Reverend Mother perpetrates the next misunderstanding when the real Juan Hernando shows up at the convent, and she ultimately thinks that he is the crooked politician who was using the donation to bribe the convent for its political support. So she refuses to take his replacement check/donation. Before it's too late, all the misunderstandings are cleared up. However, the real Juan Hernando won't donate the $5,000 anymore since he agrees with the Reverend Mother that his wealth was primarily gained by dubious means. But he does ends up donating the proceeds from one legitimate business transaction, the proceeds being $100. It's better than a kick in the pants, but not by much. As for Honest Juan Hernando, the sisters make him repent for perpetrating the falsehood that he was the philanthropic Juan Hernando - they make him tell his constituents the political truth.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Luis de Córdova",
        "nm": 208221,
        "roles": [
          {
            "char": "The Real Juan Hernando - Philanthropist"
          }
        ]
      },
      {
        "name": "Jack Bernardi",
        "nm": 76022,
        "roles": [
          {
            "char": "Señor Tomas"
          }
        ]
      },
      {
        "name": "Francis De Sales",
        "nm": 211402,
        "roles": [
          {
            "char": "Bishop"
          }
        ]
      },
      {
        "name": "Diana Hale",
        "nm": 354888,
        "roles": [
          {
            "char": "Woman"
          }
        ]
      },
      {
        "name": "Larry Gelman",
        "nm": 312475,
        "roles": [
          {
            "char": "Man #1"
          }
        ]
      },
      {
        "name": "Paul Micale",
        "nm": 583995,
        "roles": [
          {
            "char": "Husband"
          }
        ]
      },
      {
        "name": "John Goddard",
        "nm": 323798,
        "roles": [
          {
            "char": "Man #2"
          }
        ]
      },
      {
        "name": "Gino Conforti",
        "nm": 174581,
        "roles": [
          {
            "char": "Honest Juan Hernando"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E10",
    "title": "Slightly Hot Parking Meters",
    "tt": 580846,
    "air_date": "1968-12-12",
    "description": "Captain Fomento has had parking meters installed in San Tanco, a move he had to convince Chief Galindo into doing. Nobody but the Captain likes the meters. Even the Chief doesn't like them as the expected revenues promised by Fomento have not materialized as someone has been stealing the money out of the meters. Fomento plants some marked coins in some meters and waits for them to materialize to flush out the thieves. Through a series of connected transactions, Sister Bertrille gets one of the coins who unwittingly passes it back to Fomento. The always suspicious Fomento doesn't suspect the sister as being the thief, that is until Sargeant Salazar witnesses her fiddling with a tampered empty meter. The sister actually saw the real crooks - the two men who sold Fomento the meters and who kept a set of keys for the meters - and airborne, she chases them down. But Galindo gets to them first, not to arrest them, but to sell the meters back to them. Next on the scene is Fomento, who wants to tell the Chief that Sister Bertrille is the thief. Next on the scene is Sister Bertrille, who implicates the real thieves. As the two thieves try to run, Fomento and Galindo chase them down, but Salazar still thinking that Sister Bertrille is the real thief, places her in handcuffs. Ultimately Fomento asks forgiveness from Sister Bertrille with gifts in hands: he has repaired the convent station wagon (which he had impounded due to missing headlights), and has a commendation from Cheif Galindo. Sister Bertrille can't stay mad.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Rico Alaniz",
        "nm": 15976,
        "roles": [
          {
            "char": "Dominick"
          }
        ]
      },
      {
        "name": "Tony Davis",
        "nm": 205575,
        "roles": [
          {
            "char": "Miguel"
          }
        ]
      },
      {
        "name": "Don Diamond",
        "nm": 224614,
        "roles": [
          {
            "char": "Chief Galindo",
            "ch": 89659
          }
        ]
      },
      {
        "name": "William Edmonson",
        "nm": 249564,
        "roles": [
          {
            "char": "Man in the Street"
          }
        ]
      },
      {
        "name": "Ray Hastings",
        "nm": 2008628,
        "roles": [
          {
            "char": "Felix"
          }
        ]
      },
      {
        "name": "Rodolfo Hoyos Jr.",
        "nm": 398409,
        "roles": [
          {
            "char": "Mr. Montoya",
            "as Rodolfo Hoyos": true
          }
        ]
      },
      {
        "name": "Sylvia Marino",
        "nm": 1648289,
        "roles": [
          {
            "char": "Rosa"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Sgt. Salazar",
            "ch": 245997
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      }
    ]
  },
  {
    "se": "S02E11",
    "title": "To Fly or Not to Fly",
    "tt": 580880,
    "air_date": "1968-12-19",
    "description": "There are two upcoming important events: the novices are approaching their rededication ceremony, and the Reverend Mother is attending a conference in Chicago. With the latter, she can take one travel companion, and all the sisters do extra things for the Reverend Mother in hopes that that will sway the Reverend Mother's decision in her favor. Sister Bertrille is especially hopeful as she went to school there, and desperately wants to see it again. The Reverend Mother even believes that she would be the appropriate choice, however as Chicago is the Windy City, it is too much of a risk for Sister Bertrille to go. She is sad enough about that, but it makes her realize that she needs to be able to control her flying more so than she is able, especially with the upcoming rededication ceremony with the Mother General in attendance. Consulting an aeronautical engineer, she learns that all she needs to do is to gain five pounds to ground herself. So she embarks on an eating binge. Having only gained three and a half pounds by the day of the Mother General's arrival, Sister Bertrille has to use other techniques for the extra weight: lead boots. After the Reverend Mother sees the boots, she demands that Sister Bertrille find another way. Sisters Jacqueline and Teresa rig a string pulley system to her, and everything is working fine during the ceremony, despite it being a blustery day, except the string is too short due to a miscalculation on Sister Teresa's part. But ultimately, Reverend Mother comes to the rescue. The Reverend Mother reiterates that Sister Bertrille has a special gift that must not be questioned, but rather cherished and used wisely and discretely.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Mark Brown",
        "nm": 1558553,
        "roles": [
          {
            "char": "Little Boy"
          }
        ]
      },
      {
        "name": "Spring Byington",
        "nm": 1981,
        "roles": [
          {
            "char": "Mother General"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "C. Lindsay Workman",
        "nm": 941454,
        "roles": [
          {
            "char": "George Bragan",
            "as Lindsay Workman": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E12",
    "title": "How to Be a Spanish Grandmother",
    "tt": 580828,
    "air_date": "1968-12-26",
    "description": "Carlos is looking for a wife - only temporarily. His grandmother, Amalia Ramirez, is coming for a visit, and once, when it looked as if she was dying, he told her he was married with a family to make her happy. He doesn't know whether he should tell her the truth as she still has a weak heart. But thinking of a wife, he remembers back to the one who got away, namely Sister Bertrille's sister, Jennifer. When Carlos' grandmother arrives, she sees Jennifer's photo on Carlos' desk and assumes that's his wife. Telling her that Jennifer is away on vacation for a couple of weeks only makes his grandmother decide to stay in San Juan until Carlos' family returns. Carlos learns from Sister Bertrille that Jennifer is currently in Miami, and he calls her to come to San Juan on a medical emergency. Two complications arise when Jennifer arrives. First, she has a fiancé in tow. And second, Carlos' grandmother sees her. They need to extend the deception further and use two of the convent children as Carlos' kids. Things take a turn for the worse when Amalia first sees Jennifer kissing her fiancé Paul, then sees Carlos kissing one of his girlfriends, Lisa. Thinking that she is saving the children from a possible broken home, Amalia runs off with the two children, planning to take them back to Argentina with her. Sister Bertrille manages to catch up with her and the children at the airport before they take off, and finally tells her the truth. Rather than keel over and have a heart attack like Sister Bertrille expects, Amalia is relieved and happy that her grandson loves her so much as to fabricate a story just to make her happy.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Richard Anders",
        "nm": 26045,
        "roles": [
          {
            "char": "Dr. Paul Martinson"
          }
        ]
      },
      {
        "name": "Ricky Cordell",
        "nm": 179469,
        "roles": [
          {
            "char": "Pepe"
          }
        ]
      },
      {
        "name": "Debra Domasin",
        "nm": 1570462,
        "roles": [
          {
            "char": "Rita"
          }
        ]
      },
      {
        "name": "Lillian Adams",
        "nm": 11148,
        "roles": [
          {
            "char": "Amalia Ramirez - Carlos' Grandmother"
          }
        ]
      },
      {
        "name": "Elinor Donahue",
        "nm": 231942,
        "roles": [
          {
            "char": "Dr. Jennifer Ethrington"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E13",
    "title": "The Landlord Cometh",
    "tt": 580865,
    "air_date": "1969-01-02",
    "description": "The convent is property leased to the order. The rent is $1 per year and every 99 years, the lease is renewed. The lease is now up for renewal. After 396 years, the owning family, the de Cordovas, have decided not to renew the lease and the sisters have 3 weeks to vacate the property. The sisters decide to invite Fabio de Cordova, the sole surviving owner, to the convent to see what good work the sisters do, which will hopefully make him change his mind about the lease. Apparently, there is no fortune left in the de Cordova estate, the convent the only thing left in the former fortune, and all Fabio de Cordova wants is a small place to live. Sister Bertrille offers him the gardener's cottage on the property, to which he agrees. However, he is hesitant to sign the new lease just in case this arrangement with the sisters doesn't work out. Fabio ends up being quite an obtrusive landlord, the last straw for the Reverend Mother being taking guided paid tours through the convent. However Captain Fomento, who suspects that Fabio is an impostor, scares Fabio off, but for another reason: Fabio once embezzled money from a former lover and thinks the captain is onto him. Fabio decides to right all wrongs: to deed the convent to the sisters and go find his old love to marry her.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Ivor Francis",
        "nm": 290179,
        "roles": [
          {
            "char": "Señor Moreno"
          }
        ]
      },
      {
        "name": "Jay Novello",
        "nm": 637041,
        "roles": [
          {
            "char": "Fabio De Cordova"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      }
    ]
  },
  {
    "se": "S02E14",
    "title": "Sister Socko in San Tanco",
    "tt": 580845,
    "air_date": "1969-01-16",
    "description": "Convent orphan Michael Antonio idolizes his uncle, renowned magician and juggler Marko the Magnificient. Marko is coming to San Tanco to visit Michael, an opportunity Sister Bertrille cannot let pass. Since the hot water pipes in the convent had just burst, she persuades the Reverend Mother to hold a benefit concert headlining Marko the Magnificent, with some other peripheral acts, including a trio of singing nuns (Sisters Bertrille, Jacqueline and Ana). The Reverend Mother thinks it's a good idea since she has seen the amazing feats of Marko. Marko however does not want to do it since he has come to San Tanco for some rest and personal time with Michael. Feeling pressured from Michael as well as some pre-publicity of the concert, Marko reluctantly concedes to doing it. Another reluctant performer is Sister Ana, who has stage fright. Back to Marko, Sister Bertrille learns that Marko's reluctance masks the fact that his hands are afflicted with arthritis and he can no longer perform magic or juggle. Ultimately Sister Bertrille can do nothing to overcome Sister Ana's stage fright - the Reverend Mother goes on in her place - but Sister Bertrille comes up with a solution for Marko. They can create a magic act around levitating Sister Bertrille, who will be flying on her own. The concert ends up being a hit, even according to the entertainment bible, Variety magazine.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028,
            "credit only": true
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Sister Teresa"
          }
        ]
      },
      {
        "name": "Dorothy Neumann",
        "nm": 627030,
        "roles": [
          {
            "char": "Sister Mary"
          }
        ]
      },
      {
        "name": "Vincent Arias",
        "nm": 34732,
        "roles": [
          {
            "char": "Pedro"
          }
        ]
      },
      {
        "name": "Manuel Padilla Jr.",
        "nm": 655693,
        "roles": [
          {
            "char": "Michael",
            "as Manuel Padilla": true
          }
        ]
      },
      {
        "name": "Victor Buono",
        "nm": 120658,
        "roles": [
          {
            "char": "Marko"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E15",
    "title": "A Star Is Reborn",
    "tt": 580812,
    "air_date": "1969-01-23",
    "description": "Actress Sabrina Michaels is trying to escape from her movie star life and her philandering co-star and fiancé, Spencer Michaels. She has walked off the set of her movie and in her escape, has a near fatal drowning caused by and saved by Sister Bertrille. While swimming away, Sabrina sees Sister Bertrille flying which caused her to faint and nearly drown. However, while she is recuperating at the convent, Sabrina states that she had a religious vision, that being the flying sister. The sisters don't correct her thought. However this vision causes Sabrina to rethink her life and she decides to become a nun. Meanwhile, Sabrina's producer, Harold Harmon, plans on suing her for breach of contract and has to serve her papers. The sisters are suspicious of every stranger who stops by the convent, most of whom are process servers. However one claiming to be Father Duffy, an old friend of the Reverend Mother's, they also suspect to be a process server masquerading as a priest. In the Reverend Mother's absence, the sisters treat Father Duffy as such a priest in disguise. Unfortunately for the sisters, he is really the Reverend Mother's old friend Father Duffy. Back to Sabrina, the Reverend Mother convinces her that she should return to her life as a movie actress by showing her that she did not have a vision, and that Sister Bertrille really can fly.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Jonathan Hole",
        "nm": 354949,
        "roles": [
          {
            "char": "Process Server - Acting as Tourist"
          }
        ]
      },
      {
        "name": "Bill Quinn",
        "nm": 703767,
        "roles": [
          {
            "char": "Driver"
          }
        ]
      },
      {
        "name": "Anthony Eisley",
        "nm": 252111,
        "roles": [
          {
            "char": "Spencer Michaels"
          }
        ]
      },
      {
        "name": "Gavin MacLeod",
        "nm": 533891,
        "roles": [
          {
            "char": "Harold Harmon",
            "as Gavin Mac Leod": true
          }
        ]
      },
      {
        "name": "Alan Mowbray",
        "nm": 610253,
        "roles": [
          {
            "char": "Father Duffy"
          }
        ]
      },
      {
        "name": "Patricia Barry",
        "nm": 58117,
        "roles": [
          {
            "char": "Sabrina Lewis"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E16",
    "title": "The Great Casino Robbery: Part 1",
    "tt": 580861,
    "air_date": "1969-01-30",
    "description": "Sister Bertrille's family friend, \"Uncle\" Reggie Overton Perkins, has taken a job in San Juan. Uncle Reggie has somewhat of a shady past and present, but has managed to get a job at Carlos' casino as security expert, which includes showing casino customers how to spot cheaters in the casino. One of Uncle Reggie changes at the casino is to show the counting room through a glass partition, this move to entice casino patrons to gamble to try and win the money they see. Captain Fomento however is skeptical as he feels it will lure thieves to the casino to try and steal the money. For once, he's right. The thief wannabes come in the form of couple, Bruce and Faye. Bruce claims to be a numismatist, and plants in Uncle Reggie's head that there may be rare coins and notes among the casino's money. So Uncle Reggie suggests to the sisters and also convinces Carlos that the sister exchange regular valued coins and notes for collector ones in the counting room as a way to raise money for the convent. At the same time, Faye goes by the convent claiming to be Sister Mary Grace from Uganda in San Tanco on official business. She also claims to be a numismatist, and thus the sisters believes she would be a perfect person to accompany them as they sort through the casino's money. Through this plan, Bruce and Faye manage to steal $50,000 from the casino. Carlos and Sister Bertrille initially suspect a missing Uncle Reggie as the thief.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Alan Hale Jr.",
        "nm": 1308,
        "roles": [
          {
            "char": "Uncle Reggie Overton Perkins"
          }
        ]
      },
      {
        "name": "Richard Gautier",
        "nm": 310370,
        "roles": [
          {
            "char": "Bruce"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      },
      {
        "name": "Ruta Lee",
        "nm": 498181,
        "roles": [
          {
            "char": "Faye"
          },
          {
            "char": "Sister Mary Grace"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E17",
    "title": "The Great Casino Robbery: Part 2",
    "tt": 580862,
    "air_date": "1969-02-06",
    "description": "Sister Bertrille finds Uncle Reggie, who is still the prime suspect in the casino robbery. Unfortunately for Uncle Reggie, Captain Fomento also finds him. Sister Bertrille however convinces Carlos and Captain Fomento of Uncle Reggie's possible innocence, and devises a plan to flush out the real thieves: report that Uncle Reggie has been caught and charged with the theft, so that the real thieves will let their guards' down. It works as Bruce and Faye, still under cover at the convent as Sister Mary Grace, decide that it is time to leave San Tanco. The sisters unwittingly leak to thief Faye that the story of Uncle Reggie's guilt is just a ploy. Faye as Sister Mary Grace still meets up with Bruce at the airport, but Sister Bertrille sees the two together in a compromising position and sees Bruce take off with Sister Mary Grace's luggage, and suspects they may be the possible crooks. With information from Uncle Reggie and Carlos, Sister Bertrille pieces the whole thing together. She follows Sister Mary Grace/Faye to Bruce's hideout and manages to steal their car, leaving the two thieves stranded - they are forced to walk a mile to their departure point of the harbor. Sister Bertrille alerts Captain Fomento and Carlos, who rush to the harbor to apprehend the thieves. But Sister Bertrille beats them to the harbor and confronts the crooks, who have her at gunpoint. As Bruce trips, he accidentally pulls the trigger and the gun goes off. Next they know, Bruce and Faye sees Sister Bertrille up in the air, thinking that they killed her and what they see is her angel. Just then, Captain Fomento and Carlos arrive on the scene and arrest the crooks.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Roger De Koven",
        "nm": 209141,
        "roles": [
          {
            "char": "Farmer Rodriguez"
          }
        ]
      },
      {
        "name": "John Myhers",
        "nm": 616913,
        "roles": [
          {
            "char": "Barnum"
          }
        ]
      },
      {
        "name": "Alan Hale Jr.",
        "nm": 1308,
        "roles": [
          {
            "char": "Uncle Reggie Overton Perkins"
          }
        ]
      },
      {
        "name": "Richard Gautier",
        "nm": 310370,
        "roles": [
          {
            "char": "Bruce"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      },
      {
        "name": "Ruta Lee",
        "nm": 498181,
        "roles": [
          {
            "char": "Faye"
          },
          {
            "char": "Sister Mary Grace"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E18",
    "title": "The Boyfriend",
    "tt": 580850,
    "air_date": "1969-02-13",
    "description": "While on a retreat with Sister Jacqueline, Sister Bertrille runs into one of her old boyfriends, Randy Putnam. Randy is currently a toy maker at a business convention. Randy and Sister Bertrille remember their relationship in slightly different ways, each seeing him/herself as the dominant personality in the relationship. Randy is shocked to see Elsie as Sister Bertrille and feels that he had something to do with her becoming a nun. Randy, who is also in psychotherapy, sees Sister Bertrille fly, which further confuses him. To ease the guilt he feels for her becoming a nun, he showers her with lavish gifts, despite the fact that he is engaged. His fiancée, Liz Martin, is not so understanding of Randy's behavior. It isn't until Sister Bertrille assures Liz that he had nothing to do with her entering the convent that they can begin to help Randy get over this guilt and get back to a committed relationship with Liz.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Dante Andreas",
        "nm": 2019242,
        "roles": [
          {
            "char": "Bishop Diaz"
          }
        ]
      },
      {
        "name": "Bob Hastings",
        "nm": 368561,
        "roles": [
          {
            "char": "Tom Grant"
          }
        ]
      },
      {
        "name": "Dwayne Hickman",
        "nm": 382722,
        "roles": [
          {
            "char": "Randy Putnam"
          }
        ]
      },
      {
        "name": "Cynthia Pepper",
        "nm": 672580,
        "roles": [
          {
            "char": "Liz Martin"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E19",
    "title": "The Kleptomonkeyac",
    "tt": 580864,
    "air_date": "1969-02-20",
    "description": "Sister Bertrille is looking after Pepe, a chimpanzee, as a favor to Dolores, one of Carlos' girlfriends. Pepe's arrival at the convent coincides with a rash of thefts in the neighborhood, thefts of small, rather insignificant trinkets. The latest theft is of Captain Fomento's watch right in the convent. Yes, the thief is Pepe. The captain thinks that it is someone in the convent. Sister Jacqueline, who finds the stolen items in Sister Bertrille's closet (Pepe's hiding place), reports such to the Reverend Mother and based on Sister Bertrille's behavior, Sister Jacqueline and the Reverend Mother believe Sister Bertrille suffers from kleptomania. Sister Bertrille is oblivious to Pepe's thieving ways until she sees him take off with a candlestick. As Sister Bertrille chases after Pepe, Sister Jacqueline, the Reverend Mother, Captain Fomento and Sgt. Salazar chase after Sister Bertrille. It isn't until Dolores returns to retrieve her thieving pet monkey that the truth is revealed to all.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Rodolfo Hoyos Jr.",
        "nm": 398409,
        "roles": [
          {
            "char": "Chief Galindo",
            "ch": 89659,
            "as Rodolfo Hoyos": true
          }
        ]
      },
      {
        "name": "Ivana Kislinger",
        "nm": 457289,
        "roles": [
          {
            "char": "Dolores"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Sgt. Salazar",
            "ch": 245997,
            "as Mike Pataki": true
          }
        ]
      },
      {
        "name": "Pepe",
        "nm": 2009236,
        "roles": [
          {
            "char": "Pepe the Monkey"
          }
        ]
      },
      {
        "name": "Ernest Sarracino",
        "nm": 765512,
        "roles": [
          {
            "char": "Señor Espinosa"
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      }
    ]
  },
  {
    "se": "S02E20",
    "title": "The Moo Is Blue",
    "tt": 580867,
    "air_date": "1969-02-27",
    "description": "Farmer Gonzalo, the convent's milk supplier, is moving to St. Thomas and can't take Alicia, his beloved cow with him. Sister Bertrille decides to buy Alicia for the convent as a cheap, constant and reliable milk supply for the kitchen and for the children's needs. None of this comes to fruition as as soon as Alicia reaches the convent, she stops providing milk. The Reverend Mother finally gives Sister Bertrille an ultimatum: find another home for Alicia, or off Alicia goes to the slaughter house. When Sister Bertrille can't find another suitable home for Alicia, Sister Bertrille talks Carlos, or rather talks Carlos' girlfriend Danielle, into giving her and Alicia a ride on Carlos' yacht to St. Thomas to go see Gonzalo, who thinks he can solve Alicia's lack of milk problem. They all think it's Alicia being homesick or at least being family-sick for Gonzalo. However they all discover that what Alicia was missing was music as Gonzalo always sang to her while he milked her. So Alicia has found a new home at the convent with a new source of music. Carlos is given a reward for taking Sister Bertrille and Alicia to/from St. Thomas: Alicia's first glass of convent milk.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Danielle De Metz",
        "nm": 210298,
        "roles": [
          {
            "char": "Danielle"
          }
        ]
      },
      {
        "name": "Marie Esponoza",
        "nm": 2030361,
        "roles": [
          {
            "char": "Carmelita"
          }
        ]
      },
      {
        "name": "Pedro Gonzalez Gonzalez",
        "nm": 327602,
        "roles": [
          {
            "char": "Gonzalo",
            "as Pedro Gonzales Gonzales": true
          }
        ]
      },
      {
        "name": "Jorge Marino",
        "nm": 547792,
        "roles": [
          {
            "char": "Alberto"
          }
        ]
      },
      {
        "name": "Sylvia Marino",
        "nm": 1648289,
        "roles": [
          {
            "char": "Felicia"
          }
        ]
      },
      {
        "name": "Monika Ramirez",
        "nm": 708346,
        "roles": [
          {
            "char": "Margarete",
            "as Monica Ramirez": true
          }
        ]
      },
      {
        "name": "Davis Roberts",
        "nm": 205369,
        "roles": [
          {
            "char": "Dr. Escobar"
          }
        ]
      },
      {
        "name": "Tim Weldon",
        "nm": 919752,
        "roles": [
          {
            "char": "Damingo"
          }
        ]
      },
      {
        "name": "Alicia",
        "nm": 6091060,
        "roles": [
          {
            "char": "Cow",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E21",
    "title": "The Breakaway Monk",
    "tt": 580851,
    "air_date": "1969-03-06",
    "description": "The sisters need to call in accident-prone Brother Paul back to the convent to do some bookkeeping work. The sisters do everything in their power to keep Brother Paul from doing harm to himself, to them or to the convent. Brother Paul is not accident-prone like he was during his last visit. On the other hand, Sister Bertrille is causing a lot of accidents and a lot of accidents are happening to Sister Bertrille by others in their attempts to avoid accidents to/from Brother Paul. The nature of the bookkeeping work is primarily in regard to Carlos' donations since he is being audited. When Mr. O'Reilly from the IRS needs to change his appointment with Carlos, Carlos uses the opportunity of his own accountant's absence at that time to use the services of \"pious\" Brother Paul for the audit. Brother Paul's first and only accident at the convent happens when he sees Sister Bertrille fly and in turns drops all Carlos' tax receipts, which go flying into the wind. Carlos and Brother Paul have to hold off Mr. O'Reilly while Sister Bertrille goes flying off for receipt after receipt. By the time Mr. O'Reilly completes his audit, Sister Bertrille has not found all the receipts and Mr. O'Reilly does not allow the total amounts Carlos has requested for deductions. It isn't until Sister Bertrille flies after Mr. O'Reilly with the remainder of the receipts that he changes his mind to allow whatever Carlos, Brother Paul and especially Sister Bertrille want.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Natividad Vacío",
        "nm": 882974,
        "roles": [
          {
            "char": "Bricklayer"
          }
        ]
      },
      {
        "name": "Charles Lane",
        "nm": 485272,
        "roles": [
          {
            "char": "Mr. O' Reilly"
          }
        ]
      },
      {
        "name": "Rich Little",
        "nm": 514648,
        "roles": [
          {
            "char": "Brother Paul"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E22",
    "title": "Happy Birthday Dear Gaspar",
    "tt": 580825,
    "air_date": "1969-03-13",
    "description": "Captain Gaspar Fomento of the police force thinks everyone has forgotten his birthday, even the nuns.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Fabian Dean",
        "nm": 212770,
        "roles": [
          {
            "char": "Mr. Dyquisto"
          }
        ]
      },
      {
        "name": "Rodolfo Hoyos Jr.",
        "nm": 398409,
        "roles": [
          {
            "char": "Chief Galindo",
            "ch": 89659,
            "as Rodolfo Hoyos": true
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Sgt. Salazar",
            "ch": 245997,
            "as Mike Pataki": true
          }
        ]
      },
      {
        "name": "Vito Scotti",
        "nm": 780005,
        "roles": [
          {
            "char": "Capt. Gaspar Fomento",
            "ch": 245996
          }
        ]
      },
      {
        "name": "Tim Weldon",
        "nm": 919752,
        "roles": [
          {
            "char": "Little Gaspar",
            "as Timmy Weldon": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E23",
    "title": "Cast Your Bread Upon the Waters",
    "tt": 580818,
    "air_date": "1969-03-20",
    "description": "Roberto Sanchez, president of the second largest grocery chain in San Juan, states that Sister Sixto's bread is the best he has ever tasted. From that, Sister Bertrille thinks that selling her bread would be a good way to raise money for the convent. Sanchez is in charge of distribution, Sister Jacqueline is in charge of advertising, and obviously Sister Sixto is in charge of mixing. But to make money, one needs money, and Sister Bertrille approaches Carlos for financing: $1,000 for a new bread oven and $160 for a ton of flour. Other problems abound when Sister Sixto isn't comfortable with mass production and there are too many chefs in the kitchen when all five sisters helping in the kitchen think that they are in charge of adding yeast to the dough, which creates the day of the growing monster bread dough. But a potential lawsuit occurs when Sister Sixto loses her ring in one of the loaves of bread. The sisters manage to get back all the unsold loaves but the ring isn't in any of them. However, Sister Jacqueline, the advertising brain, comes up with an idea: a contest where the finder of the ring will get a year's supply of bread. The sisters don't have to pay out as the ring is fortunately found by Carlos in his loaf, unfortunately by biting down on it. But they wouldn't have a year's supply to give anyway as the bread business ultimately fails: the old bread recipe did not translate well into being baked in a new modern oven and the customers hated it.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Roger De Koven",
        "nm": 209141,
        "roles": [
          {
            "char": "Roberto Sanchez"
          }
        ]
      },
      {
        "name": "Jamie Farr",
        "nm": 268026,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "Cynthia Hull",
        "nm": 401415,
        "roles": [
          {
            "char": "Sister Theresa"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E24",
    "title": "The Convent Gets the Business",
    "tt": 580853,
    "air_date": "1969-03-27",
    "description": "The convent is willed a dry goods business, which is free and clear of debt. However it is devoid of any sense of order. Unable to run the business themselves, the sisters look for someone to act as manager. Carlos suggests his cousin Luis, if only to get Luis out from working at the casino. Luis has some unique business ideas, which is causing havoc for Carlos at the casino. At the dry goods store, Luis' business ideas cause the store to go into the red after the first week. To keep the sisters from firing Luis which would in turn cause Luis to go back to working at the casino, Carlos pays people to buy things at the store, and the fortunes of the store obviously turn around. However Luis comes up with some more interesting business ideas, including advertising the fact that the store is owned by the charitable sisters, to which their dry goods competitors cry foul. The Reverend Mother sees no other way to undo this unfair advertising than to sell the store. Luis is initially distraught until he figures he can buy the store. To be more precise, he wants Carlos to buy it for him. When Luis approaches Carlos about this proposition, Carlos tells Sister Bertrille in secret the truth about why the store was doing so well. Sister Bertrille is mad at Carlos about how he treated Luis and what this news will do for his own self worth.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          },
          {
            "char": "Luis"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Ernest Sarracino",
        "nm": 765512,
        "roles": [
          {
            "char": "Flavio Pedrosa"
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "Ramon"
          }
        ]
      },
      {
        "name": "Renata Vanni",
        "nm": 889245,
        "roles": [
          {
            "char": "Woman #1"
          }
        ]
      },
      {
        "name": "Argentina Brunetti",
        "nm": 116230,
        "roles": [
          {
            "char": "Woman #2"
          }
        ]
      },
      {
        "name": "Lew Palter",
        "nm": 658817,
        "roles": [
          {
            "char": "Man #1"
          }
        ]
      },
      {
        "name": "Alma Beltran",
        "nm": 69608,
        "roles": [
          {
            "char": "Woman #3"
          }
        ]
      },
      {
        "name": "Nelson D. Cuevas",
        "nm": 191217,
        "roles": [
          {
            "char": "Man #2",
            "as Nelson Cuevas": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E25",
    "title": "Cousins by the Dozen",
    "tt": 580819,
    "air_date": "1969-04-03",
    "description": "On a day that Carlos has promised some of the convent children a boat ride, he reneges to go to Culebra for a date with Elena. He however tells the children and Sister Bertrille that he is going to meet with his down on his luck Uncle Antonio and Aunt Constancia. In actuality, Uncle Antonio is poor because he's lazy. Violetta, one of the children, comes down with a case of the mumps, and since Carlos hugged her, Sister Bertrille flies to Culebra to warn Carlos that he has been exposed. Sister Bertrille searches for him at his uncle and aunt's house. Uncle Antonio and Aunt Constancia state that they are not expecting Carlos and thus wonder why the sister is looking for him there. Based on the lie Carlos told her, Sister Bertrille tells them that he is coming to bring them and their entire family to live in one of Carlos' houses in San Tanco. When she finds Carlos at Elana's, Sister Bertrille learns the truth about Carlos' trip to Culebra and Carlos in turn learns about the expectation that his aunt and uncle have about going to live in San Tanco. Neither Carlos or Sister Bertrille have the heart to tell them the truth, especially as the family holds a celebration for Carlos' generosity. Carlos ultimately is happy to have his family move to San Tanco when they remind him what wonderful things they did for him when he was a child.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "Ramon"
          }
        ]
      },
      {
        "name": "Mark Brown",
        "nm": 1558553,
        "roles": [
          {
            "char": "Humberto"
          }
        ]
      },
      {
        "name": "Pamelyn Ferdin",
        "nm": 272244,
        "roles": [
          {
            "char": "Violetta"
          }
        ]
      },
      {
        "name": "Lew Palter",
        "nm": 658817,
        "roles": [
          {
            "char": "Pepe"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Farmer"
          }
        ]
      },
      {
        "name": "Madeleine Taylor Holmes",
        "nm": 391942,
        "roles": [
          {
            "char": "Lucia",
            "as Madeleine Holmes": true
          }
        ]
      },
      {
        "name": "Bert Santos",
        "nm": 763995,
        "roles": [
          {
            "char": "Cab Driver"
          }
        ]
      },
      {
        "name": "Athena Lorde",
        "nm": 520525,
        "roles": [
          {
            "char": "Aunt Constancia Ramirez"
          }
        ]
      },
      {
        "name": "Henry Corden",
        "nm": 179478,
        "roles": [
          {
            "char": "Uncle Antonio Ramirez"
          }
        ]
      },
      {
        "name": "Lisa Gaye",
        "nm": 310846,
        "roles": [
          {
            "char": "Elena"
          }
        ]
      },
      {
        "name": "Danielle De Metz",
        "nm": 210298,
        "roles": [
          {
            "char": "Danielle",
            "archive footage": true
          }
        ]
      },
      {
        "name": "E.J. Peaker",
        "nm": 668855,
        "roles": [
          {
            "char": "Diane",
            "archive footage": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E26",
    "title": "The Lottery",
    "tt": 580866,
    "air_date": "1969-04-10",
    "description": "The convent has a fund raiser for building maintenance. When Sister Bertrille asks a farmer for a contribution, he does not have extra money, but he donates a lottery ticket, which is worth $25,000 if picked. The ticket wins.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028,
            "credit only": true
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Argentina Brunetti",
        "nm": 116230,
        "roles": [
          {
            "char": "Consuelo Gomez"
          }
        ]
      },
      {
        "name": "Rodolfo Hoyos Jr.",
        "nm": 398409,
        "roles": [
          {
            "char": "Chief Galindo",
            "ch": 89659,
            "as Rodolfo Hoyos": true
          }
        ]
      },
      {
        "name": "Al Checco",
        "nm": 154811,
        "roles": [
          {
            "char": "Fernando"
          }
        ]
      },
      {
        "name": "Athena Lorde",
        "nm": 520525,
        "roles": [
          {
            "char": "Maria"
          }
        ]
      },
      {
        "name": "Savannah Bentley",
        "nm": 72866,
        "roles": [
          {
            "char": "Operator"
          }
        ]
      },
      {
        "name": "David Hurst",
        "nm": 403588,
        "roles": [
          {
            "char": "Benito Gomez"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E01",
    "title": "The Big Game",
    "tt": 580849,
    "air_date": "1969-09-17",
    "description": "The convent baseball team has its first game on the weekend. Generous Carlos outfits the team so that it will at least look like it knows what it's doing; in other words, the convent team is the underdog in the game. The team is flanked by small but enthusiastic Armando, the team's pinch hitter, who is being adopted in a month. Armando himself realizes that he is not the best player, but loves the game. There ends up being a change in plans with his adoption: his parents-to-be arrive in San Juan early and want to take him off the island just before the big game as they need to be in Miami that evening for his father to accept a prestigious honor. Armando is so devastated by missing the game that he wants to give up baseball for good. However his parents realize that this is not a good way to start their family life, and rush Armando back to the game. Despite being down 43 runs, Armando saves the name of the convent team by hitting a fluke home run. They have a moral victory, if not one on the scoreboard.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Hal Frederick",
        "nm": 292782,
        "roles": [
          {
            "char": "Escobedo"
          }
        ]
      },
      {
        "name": "George Spell",
        "nm": 817665,
        "roles": [
          {
            "char": "Armando"
          }
        ]
      },
      {
        "name": "Lee Delano",
        "nm": 216397,
        "roles": [
          {
            "char": "Delgado"
          }
        ]
      },
      {
        "name": "Mimi Dillard",
        "nm": 226840,
        "roles": [
          {
            "char": "Mrs. Escobedo"
          }
        ]
      },
      {
        "name": "Manuel Padilla Jr.",
        "nm": 655693,
        "roles": [
          {
            "char": "Marcello",
            "as Manuel Padilla": true
          }
        ]
      },
      {
        "name": "Robert Valdes",
        "nm": 2091417,
        "roles": [
          {
            "char": "Ricardo"
          }
        ]
      },
      {
        "name": "Rudy Battaglia",
        "nm": 61311,
        "roles": [
          {
            "char": "Fernando"
          }
        ]
      },
      {
        "name": "Gina Picerni",
        "nm": 681605,
        "roles": [
          {
            "char": "Tigress"
          }
        ]
      },
      {
        "name": "Don Drysdale",
        "nm": 238771,
        "roles": [
          {
            "char": "the Umpire"
          }
        ]
      },
      {
        "name": "Willie Davis",
        "nm": 205660,
        "roles": [
          {
            "char": "the Manager"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E02",
    "title": "My Sister the Star",
    "tt": 580836,
    "air_date": "1969-09-24",
    "description": "Local celebrity and television show host, Claudio the Clown, thinks that Sister Bertrille would be perfect person to have as a guest on his children's show. Initially nervous, Sister Bertrille is a hit and Claudio's manager, Manuel Montique, offers her her own show. After discussing the pros and cons with the other sisters and the Reverend Mother, Sister Bertrille is conflicted, but ultimately declines due to what she imagines to be the trappings of fame. To ease her turning down the offer, she demands everything as part of her contract. She ends up getting what she wants: she doesn't need to sign the contract and Montique ends up providing a donation to the convent.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Sid Grossfeld",
        "nm": 343571,
        "roles": [
          {
            "char": "TV Director"
          }
        ]
      },
      {
        "name": "Lawrence Montaigne",
        "nm": 598807,
        "roles": [
          {
            "char": "Manuel Montique"
          }
        ]
      },
      {
        "name": "Paul Winchell",
        "nm": 934593,
        "roles": [
          {
            "char": "Claudio"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E03",
    "title": "Speak the Speach, I Pray You",
    "tt": 580848,
    "air_date": "1969-10-01",
    "description": "San Tanco is getting a new parish priest, Father Walter Larson, an old friend of the Reverend Mother's. Father Larson has spent most of his life as an archivist. He is used to being alone with his books, and is not a very social person. His biggest weaknesses are his poor social interaction with people and his speech writing/delivery, weaknesses that he himself realizes. He is terrified by his new duties, the first of which is to give a speech at a banquet dinner. He uses the sisters as guinea pigs; Sister Bertrille admits to him that his speech is the worst she's ever heard. So she asks Carlos to find a writer to liven up the speech. He finds stand-up comedian writer Danny Simms, whose writing style of one-liners does not suit the father's stiff delivery style. So Sister Bertrille asks Carlos to tell the banquet guests, most of whom are his employees, to laugh at the father's speech regardless. The father however decides himself to give his original solemn and stiff speech, the mandated laughter during which makes the situation that much worse. Sister Bertrille and Father Larson apologize to each other, Sister Bertrille for ruining the banquet, and Father Larson for causing Sister Bertrille to weaken to the point of losing faith. Father Larson is ready to leave for good, when Sister Bertrille tells him of her own learning curve of flying. Amazed by the act of the flying itself and by the sister's message, Father Larson decides to stay.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Lydia Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Gary Crosby",
        "nm": 188986,
        "roles": [
          {
            "char": "Danny Simms"
          }
        ]
      },
      {
        "name": "Robert Cummings",
        "nm": 191950,
        "roles": [
          {
            "char": "Father Walter Larson",
            "as Bob Cummings": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E04",
    "title": "The Paola Story",
    "tt": 580872,
    "air_date": "1969-10-08",
    "description": "The Reverend Mother hires Paola Guzman as her temporary secretary. Paola, full of Latin flair with a penchant to do the bossa nova, is a bit at odds with the staunch Reverend Mother's style, but Paola is admittedly an efficient secretary with a kind heart. The Reverend Mother is just about to let Paola go when Paola shows up at the convent with a 6-month old child named Anita. Paola states that she is looking after Anita for a single mother friend (her husband passed away) who is away in the States looking for a job. Paola was hoping to stay at the convent while she looks after the child. The sisters think Anita is actually Paola's child, especially since the story is much like a movie Sister Sixto saw recently on television. As such, the Reverend Mother allows Paola and Anita to take refuge at the convent, and lets Paola keep her job. However through Carlos, Sister Bertrille learns that Paola was once married to Lorenzo Guzman, from whom she got an annulment due to his gambling ways. Lorenzo is now making a steady living as a house painter. Sister Bertrille tracks down Lorenzo on the pretense of painting the chapel, but she mentions Paola and Anita to Lorenzo. Lorenzo himself thinks Anita is his and Paola's child and goes to the convent to reclaim his family. As Lorenzo proposes, the sisters find out that Paola was telling the truth about Anita's mother. This reality jeopardizes Lorenzo and Paola's future as Paola doesn't know if Lorenzo wants her for her or just to do his duty. But Sister Bertrille convinces them with a little display of flight, which they think a miracle associated with the sister's efforts to get them together. After the story of Lorenzo and Paola heads toward \"happily ever after\", Paola admits to Berty aka Sister Bertrille that Anita really is her and Lorenzo's child. Paola really needed to know that Lorenzo wanted her without any ulterior motives, and now will tell him the truth.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Chelsea Brown",
        "nm": 113238,
        "roles": [
          {
            "char": "Paola Guzman"
          }
        ]
      },
      {
        "name": "Carl Byrd",
        "nm": 1329657,
        "roles": [
          {
            "char": "Lorenzo Guzman"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Mrs. Emanuel"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E05",
    "title": "Marcello's Idol",
    "tt": 580834,
    "air_date": "1969-10-15",
    "description": "When Marcello describes the sisters' to others as \"guys\", they think that he needs a fatherly male influence in his life. When questioned, Marcello chooses Carlos. Sister Bertrille in turn talks Carlos into being Marcello's surrogate father on occasion. But Carlos' memory fades quickly when he chooses to spend the day with beautiful Lila rather than keep his appointment to go sailing with Marcello. But unbeknownst to Sister Bertrille, Carlos does takes Marcello out on the boat as primary crew, while Carlos spends most of the time pampering Lila below deck. Despite Marcello having a good time and hoping Carlos will adopt him, Sister Bertrille fires Carlos as surrogate father. When Marcello finds out that Carlos needs to be married to adopt him, he takes matters into his own hands and places a newspaper ad looking for a wife for Carlos and a mother for himself. Despite having no money for an ad, the newspaper man decides it would be a good human interest story and places it on the front page. Droves of women descend on the casino and Carlos has to make a quick escape, Marcello in tow. Carlos and Marcello clear the air with each other and define the nature of their relationship.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Manuel Padilla Jr.",
        "nm": 655693,
        "roles": [
          {
            "char": "Marcello",
            "as Manuel Padilla": true
          }
        ]
      },
      {
        "name": "Farrah Fawcett",
        "nm": 396,
        "roles": [
          {
            "char": "Lila"
          }
        ]
      },
      {
        "name": "Peter Mamakos",
        "nm": 540992,
        "roles": [
          {
            "char": "Newspaper Editor"
          }
        ]
      },
      {
        "name": "Ines Pedroza",
        "nm": 670174,
        "roles": [
          {
            "char": "Maria Diaz",
            "as Inez Pedroza": true
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Roberto"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E06",
    "title": "Guess Who's Coming to Picket",
    "tt": 580824,
    "air_date": "1969-10-22",
    "description": "Carlos' wait staff, led by Enrique, is on strike against who they consider their tyrant boss. The convent does not take sides in such disputes, but Sister Bertrille is caught by a newspaper cameraman pouring some coffee for Enrique on the line, which the public and Carlos construe as convent support for the strike. Just as Carlos accepts Sister Bertrille's apology after several attempts by her, she is caught once again by a newspaper cameraman in what looks like further support for the strikers. The Carlos/convent relationship gets even more strained when the Reverend Mother is caught on camera accepting a check from Enrique, even if it was a pre-strike two-year old promise of a donation. Things for Carlos get even worse when the kitchen starts falling apart without his wait staff; as the kitchen conditions worsen, the rest of his kitchen staff join the strikers. As an act of charity, the Reverend Mother sanctions Sisters Bertrille, Jacqueline and Sixto to help Carlos in the kitchen while he acts as waiter. This again is caught on film. As such, Enrique is now angry with the convent. But at least the support is now seen as being equal, which gets Carlos and Enrique at the bargaining table mediated by the Reverend Mother. When the Reverned Mother's mediation attempts look like they are going to fail, Sister Bertrille lends a helping hand by doing some skywriting of the word \"settle\". Carlos knows its source, but Enrique, a pious man, thinks it's a miracle and goes back to the bargaining table in good faith.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Lee Chandler",
        "nm": 151424,
        "roles": [
          {
            "char": "Lucerno"
          }
        ]
      },
      {
        "name": "Nate Esformes",
        "nm": 260559,
        "roles": [
          {
            "char": "Enrique"
          }
        ]
      },
      {
        "name": "Jenö Mate",
        "nm": 558194,
        "roles": [
          {
            "char": "Fernando",
            "as Jeno Mate": true
          }
        ]
      },
      {
        "name": "Lisa Pharren",
        "nm": 679688,
        "roles": [
          {
            "char": "Norma"
          }
        ]
      },
      {
        "name": "Rita Rogers",
        "nm": 737150,
        "roles": [
          {
            "char": "Concha"
          }
        ]
      },
      {
        "name": "Roberto Zalaya",
        "nm": 2070044,
        "roles": [
          {
            "char": "Picket",
            "as Roberto Zelaya": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E07",
    "title": "The Not So Great Impostor",
    "tt": 580870,
    "air_date": "1969-10-29",
    "description": "Struggling writer and ex-newspaperman Joe Barnes/Roy Barnes thinks he's hit the jackpot when he sees Sister Bertrille fly. She will be his exclusive story. All he needs is some photographs of her in flight to accompany his story. He implies as much about his story to old friend Carlos, who in turn gives the head's up to the Reverend Mother. The Reverend Mother places a gag order to everyone in the convent, including the children, and Sister Bertrille is grounded until further notice. Barnes goes under cover as Irish Father Flaherty to infiltrate the convent. With camera in hand, he sets up situations to get Sister Bertrille to fly. Just as Carlos finds out the identity of Father Flaherty and tells the Reverend Mother, Father Flaherty/Barnes gets his photos. When Sister Bertrille discovers Father Flaherty's true identity, Sister Bertrille has a plan in mind. She allows Father Flaherty/Barnes to take close up shots of her doing stunts in mid air, shots which she duplicates with each of the other cornette wearing sisters by placing them in front of a painted blue background. When Barnes tries to sell the photos to his old newspaper editor Reeves, Reeves already has in his possession Sister Bertrille's free photos of the other sisters \"in flight\" and a letter from her explaining how she accomplished the illusion. Barnes, ruined in the newspaper business, goes back to the convent as himself to confront the sisters. Feeling guilty for perpetrating a lie especially in light of a story Barnes tells of needing money to support his ailing family, Sister Bertrille decides to corroborate Barnes' story to Reeves, even if it means sacrificing her career as a nun. When she tells Barnes, he learns a bit about himself - that he does have some humanity. He confesses that he has no ailing family and doesn't let Sister Bertrille sacrifice her life for his professional vanity. But at least he now has a story idea for his novel.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Larry Storch",
        "nm": 832415,
        "roles": [
          {
            "char": "Joe Barnes"
          },
          {
            "char": "Roy Barnes"
          },
          {
            "char": "Father Flaherty"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "John Myhers",
        "nm": 616913,
        "roles": [
          {
            "char": "Reeves"
          }
        ]
      },
      {
        "name": "Edward Knight",
        "nm": 460889,
        "roles": [
          {
            "char": "Salesman"
          }
        ]
      },
      {
        "name": "Christine Matchett",
        "nm": 558178,
        "roles": [
          {
            "char": "Elena",
            "as Christie Matchett": true
          }
        ]
      },
      {
        "name": "Nestor Mantaras",
        "nm": 2116393,
        "roles": [
          {
            "char": "Technician"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E08",
    "title": "A Convent Full of Miracles",
    "tt": 580809,
    "air_date": "1969-11-05",
    "description": "On a dark and stormy evening, Alonzo Baldazon's jalopy of a car breaks down outside the convent where he takes refuge. The sisters provide him such, especially since they think he is down and out, however he is really a wealthy man, a fact which he doesn't tell them. The car is a vintage car which didn't run properly and the tattered clothes he was wearing are his car work clothes. Because he wants to repay the sisters for their generosity, he decides to take them up on their offer to be their handyman. He telephones his assistant Maurice back at his yacht to tell him his plans and to tell anyone who calls looking for him that he is in Canada on business. While at the convent, Alonzo not only does the odd jobs required but slowly finds out what needs replacing at the convent. One by one, large items miraculously end up at the convent - first a stove, then a hot water heater, then a children's wading pool - always after it seems like Sister Bertrille has wished for them. They first suspect Carlos as their benefactor, but when they find out he's not the generous soul, they think that Sister Bertrille is performing miracles. Finally just as he is ready to leave for good, Alonzo confesses he is the one providing the gifts. To prove such, he tells the Reverend Mother to phone his yacht, Maurice who tells her that the real Alonzo Baldazon is currently in Canada, as he was instructed to say. The Reverend Mother does not divulge this conversation to Alonzo before he leaves, but does so to the sisters after his departure. It isn't until Sister Bertrille takes a flight over the harbor and sees Alonzo on his yacht that she realizes that he was indeed telling the truth.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Nehemiah Persoff",
        "nm": 675490,
        "roles": [
          {
            "char": "Alonzo Baldazon"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Ernest Sarracino",
        "nm": 765512,
        "roles": [
          {
            "char": "Rodriguez"
          }
        ]
      },
      {
        "name": "Miguel Ángel Landa",
        "nm": 484397,
        "roles": [
          {
            "char": "Maurice",
            "as Miguel Landa": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E09",
    "title": "Hector and the Brass Band",
    "tt": 580826,
    "air_date": "1969-11-12",
    "description": "In trying to get rid of a brass bed, Sisters Bertrille and Sixto trade it for a donkey named Hector. Hector is a bit rambunctious, and is eating literally everything on the convent property. Enough is enough for the Reverend Mother who tells the sisters they have to take Hector back to its previous owner, Antonio Fuentes. Antonio, knowing Hector's nature and his wife Angela's aversion to the donkey, refuses to take Hector back. But as many problems as the sisters are having with Hector, Antonio is having even more problems. He has run into a string of bad luck, each time coinciding with an appearance of at least one of the sisters. Antonio thinks they have placed a curse on him. Carlos suggests to Antonio that he has to make restitution to the sisters for them to remove the curse: what he made selling the brass bed ($200). Carlos gives the sisters the head's up and tells them to humor Antonio about the curse. It isn't until Antonio hands over the $200 and has the sisters \"remove the curse\" that he feels some peace return to his life. But Hector can't go back with Antonio because of Angela, so Hector now has a new home at the convent.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Athena Lorde",
        "nm": 520525,
        "roles": [
          {
            "char": "Angela Fuentes"
          }
        ]
      },
      {
        "name": "Titos Vandis",
        "nm": 888937,
        "roles": [
          {
            "char": "Antonio Fuentes",
            "as Tito Vandis": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E10",
    "title": "The New Habit",
    "tt": 580869,
    "air_date": "1969-11-19",
    "description": "The Mother General has issued an edict for the sisters to wear a new habit. The sisters are all thrilled by the new, modern habit, that is until one by one they all realize that the new cornette with which will no longer allow Sister Bertrille to fly. Not only is Sister Bertrille devastated by the fact, but all the sisters are as well. They cannot hide their depressed state from anyone, but the Reverend Mother wants them all to put their best faces forward to the public - during what is a regular used clothing drive - and to the Mother General, who will soon be visiting to inspect the sisters in their new habits. When Sister Bertrille visits Carlos to pick up some used clothes, she tells him that as much as the sisters love the new habits, it's styling will no longer allow her to fly. Carlos too is devastated since he knows that this fact will stop the sister from dropping by as often as she does. But Carlos has a plan in mind. He enlists the help of Dolores, part of his floor show, who makes all her own costumes. She unveils to the sisters and the Mother General her newest creation, one that will take Puerto Rico by storm: it is a stylish dress and hat that oddly resemble the new habit. The Mother General is dumbfounded and immediately orders another edict that the sisters return to their old habits.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Edith Atwater",
        "nm": 41138,
        "roles": [
          {
            "char": "Mother General"
          }
        ]
      },
      {
        "name": "Corinne Camacho",
        "nm": 131074,
        "roles": [
          {
            "char": "Dolores"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Roberto",
            "as Mike Pataki": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E11",
    "title": "Bertrille and the Silent Flicks",
    "tt": 580817,
    "air_date": "1969-11-26",
    "description": "When the Mother General Adelaide of Culebra wants the sisters to hold a fund-raiser, the sisters think the perfect event would be to run the silent film Lure of the West, the thought initiated after they discover that the Mother General is former silent film actress Gloria Davenport, the movie's star. One of Carlos' assistants, Leonardo, is in love with Gloria Davenport, and he and Sister Bertrille convince the Mother General to go along with the idea. However the public may not think it's a good idea as silent films may be seen as outdated entertainment. When the sisters, without the Mother General, view the movie in a private screening, they too may think the same way - the formerly dramatic film is campy by 1960s sensibilities. But it's too late to back out since they have already sold out the event, raising $1,200. However they can't embarrass the Mother General. Carlos comes up with a plan to call the Mother General back to Culebra on convent business on the night of the screening. During the screening, the audience is laughing uproariously. Unfortunately, the Mother General has found a way to make it back to the screening. Upon hearing the laughter, she is at first hurt, but then examines the movie herself, and joins in with the laughter.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Miriam Hopkins",
        "nm": 394244,
        "roles": [
          {
            "char": "Mother General Adelaide"
          },
          {
            "char": "Gloria Davenport"
          }
        ]
      },
      {
        "name": "Alberto Morin",
        "nm": 605494,
        "roles": [
          {
            "char": "Leonardo"
          }
        ]
      },
      {
        "name": "Julian Rivero",
        "nm": 729480,
        "roles": [
          {
            "char": "Old Man"
          }
        ]
      },
      {
        "name": "Hal Taggart",
        "nm": 846510,
        "roles": [
          {
            "char": "Tourist"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E12",
    "title": "A Ticket for Bertrille",
    "tt": 580813,
    "air_date": "1969-12-10",
    "description": "On a day outing with Marcello, Sister Bertrille breaks three different traffic regulations. She forces Officer Juarez to give her a ticket so show Marcello that even nuns have to obey the law or pay the price. Reluctantly, Juarez does so. This act sparks a public outcry. It also causes problems for Juarez, whose girlfriend will now not marry a person who arrests a nun, for the Mayor, who's re-election is hurt by such negative publicity, and for the judge (running on the same ticket as the Mayor) who is forced to throw the sister in jail for two days when she can't pay the fine. In jail, she is bunked with Rosita, in jail as an accessory for a robbery at Carlos' casino. Rosita thinks the sister is a police plant. However when Sister Bertrille, out in the prison yard, gets caught in an updraft and flies out of the prison yet returns to the jail to face the music, Rosita sees a woman true to a life of good. As such, Rosita confesses to Sister Bertrille that although she didn't steal Carlos' money, she does know where her boyfriend, the thief, did hide the money. Sister Bertrille tells Juarez, who finds the money. Out of jail, Sister Bertrille wants to tell the press the truth about why she was in jail. However the press spins the story to make it look like she really was planted in jail to solve the casino crime. To that, Sister Bertrille takes the fifth.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Lisa Gaye",
        "nm": 310846,
        "roles": [
          {
            "char": "Rosita"
          }
        ]
      },
      {
        "name": "Manuel Padilla Jr.",
        "nm": 655693,
        "roles": [
          {
            "char": "Marcello",
            "as Manuel Padilla": true
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Gregory Sierra",
        "nm": 797268,
        "roles": [
          {
            "char": "Officer Juarez"
          }
        ]
      },
      {
        "name": "Lew Palter",
        "nm": 658817,
        "roles": [
          {
            "char": "Judge"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Mayor Salvador Calderon"
          }
        ]
      },
      {
        "name": "Joseph Bernard",
        "nm": 76282,
        "roles": [
          {
            "char": "Warden",
            "as Joe Bernard": true
          }
        ]
      },
      {
        "name": "Mercedes Alberti",
        "nm": 16666,
        "roles": [
          {
            "char": "Dolores"
          }
        ]
      },
      {
        "name": "Victor Campos",
        "nm": 133341,
        "roles": [
          {
            "char": "Reporter"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E13",
    "title": "The New Carlos",
    "tt": 580868,
    "air_date": "1969-12-17",
    "description": "After Sister Bertrille is partly the cause for Carlos' latest mishap which places him in the hospital, Carlos and Sister Bertrille individually review their relationship. Carlos wants to give her a piece of his mind. Sister Bertrille, on the advice of the Reverend Mother, thinks it wise not to ask Carlos for any more favors especially of his time, the latest being what the sisters call \"San Tanco Dads\" (STD), a group of prominent San Tanco men acting as surrogate dads for the orphan kids in community events. They even ask Roberto, Carlos' assistant, to be a STD. As much as Carlos wants to tell off Sister Bertrille, he never finds the right time. And Sister Bertrille really wants Carlos to be a STD, but bites her tongue every time she has the urge. Carlos finds out about the STD through Roberto, and deep down is hurt that he wasn't asked. What's more, he wants to be a STD since Sister Bertrille's beautiful cousin, Regina Atwater, is visiting from Boston and is hanging out at the STD events. Regina is just Carlos's type, and visa versa. But first and foremost, he feels that the sisters no longer like or respect him. So he becomes the model citizen of San Tanco, doing things that are uncharacteristic for him. He and Regina start dating - or realistically, Regina and a new stuffy tweed-wearing man calling himself Carlos start dating. Regina and the sisters are all wondering what happened to the old Carlos they knew and loved. After Regina rejects him, Carlos sees the errors in his stuffy ways.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Sandra Smith",
        "nm": 809869,
        "roles": [
          {
            "char": "Regina Atwater"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Roberto",
            "as Mike Pataki": true
          }
        ]
      },
      {
        "name": "Tanya Lemani",
        "nm": 501098,
        "roles": [
          {
            "char": "Diane Valdez"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E14",
    "title": "Dear Aggie",
    "tt": 580822,
    "air_date": "1969-12-31",
    "description": "Rickie Malinas is the sports writer for the San Tanco Tribune. But he's also temporarily Dear Aggie, the paper's advice columnist. He convinces Sister Bertrille to take over Dear Aggie duties until he can find a permanent replacement. Dear Aggie receives a letter from Margareta Pedrosa about her new boyfriend, who unbeknownst to Sister Bertrille/Dear Aggie is Carlos' mild mannered assistant, Roberto. Margareta appreciates Dear Aggie's advice. But Roberto consults Carlos, and Sister Bertrille consults Carlos when it comes to Margareta's letter, which leads to a mix of results for poor Roberto. Finally Carlos finds out that Sister Bertrille is Dear Aggie, and based on the problems it has caused for Roberto and Margareta, the Reverend Mother ends Sister Bertrille's life as Dear Aggie. However, when Rickie asks Sister Bertrille to look at one more letter from Margareta, Sister Bertrille suspects that it is actually Carlos who is Margareta's boyfriend, Carlos who wants to take advantage of innocent Margareta. Sister Bertrille decides to head Margareta off at the pass on route to her date with who she believes will be Carlos. There are a series of mistaken identities, leading to Margareta's brother punching Carlos, the person who Sister Bertrille implicates as Margareta's playboy boyfriend. It isn't until Roberto arrives on the scene that these misunderstandings are cleared up.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Henry Corden",
        "nm": 179478,
        "roles": [
          {
            "char": "Rickie Malinas"
          }
        ]
      },
      {
        "name": "Jack Donner",
        "nm": 232800,
        "roles": [
          {
            "char": "Luis Pedrosa"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Roberto",
            "as Mike Pataki": true
          }
        ]
      },
      {
        "name": "Anita Rich",
        "nm": 2114268,
        "roles": [
          {
            "char": "Margareta Pedrosa"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E15",
    "title": "My Sister, the Doctor",
    "tt": 580837,
    "air_date": "1970-01-07",
    "description": "Sister Bertrille's sister, Dr. Jennifer Ethrington, is in San Tanco for some much needed rest and relaxation. She isn't aware that there is a medical convention in town, and as such, she takes the sisters up on their offer to stay at the convent to get away from the shop talk that would happen if she stayed at the hotel. But Jennifer is bombarded with one medical issue after another, starting with her own sister in the hospital with a hairline fracture, then Sister Jacqueline with a twisted ankle, Sister Sixto with a chronic case of heartburn, the Reverend Mother with a bad back, and Sister Enid with bursitis. At a big party for the bishop that evening, the sisters order Jennifer not to tell anyone that she is a doctor, otherwise she will be inundated with medical questions all evening. First, Carlos tells the Mayor that Jennifer is a potter, the Mayor being an avid potter. Second, Carlos tells the Countess Avecchi that Jennifer is a bookkeeper, the Countess who is fascinated by anything to do with finances. And third, when Jennifer tells the bishop that she works with her hands, he assumes she's a concert pianist, an assumption Jennifer and Carlos confirm. When the bishop asks her to play the piano at the party, she is saved when Louisa, a party guest, goes into labor and requires medical attention. After Louisa gives birth to her triplets, Jennifer finally gets her R&R: she is admitted to the hospital for extreme fatigue. Sharing a room with her sister, Sister Bertrille thinks she is saving Jennifer by explaining to people that \"Dr.\" Ethrington is a veterinarian. However Jennifer's R&R is short lived as people start coming to her with pet problems.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Elinor Donahue",
        "nm": 231942,
        "roles": [
          {
            "char": "Dr. Jennifer Ethrington"
          }
        ]
      },
      {
        "name": "Rodolfo Hoyos Jr.",
        "nm": 398409,
        "roles": [
          {
            "char": "Mayor Salvador Calderon",
            "as Rodolfo Hoyos": true
          }
        ]
      },
      {
        "name": "Edward Colmans",
        "nm": 172909,
        "roles": [
          {
            "char": "Bishop",
            "as Ed Colmans": true
          }
        ]
      },
      {
        "name": "Pepe Hern",
        "nm": 379473,
        "roles": [
          {
            "char": "Roul"
          }
        ]
      },
      {
        "name": "Annette Charles",
        "nm": 152975,
        "roles": [
          {
            "char": "Louisa",
            "as Annette Cardona": true
          }
        ]
      },
      {
        "name": "Penny Santon",
        "nm": 763842,
        "roles": [
          {
            "char": "Nurse"
          }
        ]
      },
      {
        "name": "Nancy Malone",
        "nm": 540487,
        "roles": [
          {
            "char": "The Countess"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E16",
    "title": "Armando and the Pool Table",
    "tt": 580816,
    "air_date": "1970-01-23",
    "description": "Carlos donates a pool table to the convent. Sister Bertrille thinks it would be a good pastime for convent orphan Armando to partake as his current diversions are wild flights of fancy. Initially reluctant to learn, Armando takes to the game once he witnesses the amazing abilities of Emilio Gomez, who ends up being his teacher. Armando's a natural, however this new diversion, as was his old diversions, takes over his life to the expense of his school work. The Reverend Mother orders the pool table gone. Sister Bertrille figures that taking the pool table away will only make Armando more in love with the game, so she reckons what Armando needs is to be shown up. They find the best pool player in San Tanco to take on Armando, that being Carlos. Armando is confident he can beat Carlos and he does start off well, but after Armando scratches, Carlos cleans the table. To put more pressure on Armando, Sister Bertrille orders a rematch and feigns betting big money on Armando to the tune of $5,000. Armando, not wanting to disappoint the sisters, goes through with the game, but the unexpected arrival of the Reverend Mother is just what everyone needs: she stops the game and Armando breaks down in tears, not wanting to play pool anymore. In the words of the Reverend Mother, Sister Bertrille's motives were good, but her execution leaves a little to be desired.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "George Spell",
        "nm": 817665,
        "roles": [
          {
            "char": "Armando"
          }
        ]
      },
      {
        "name": "John Hoyt",
        "nm": 398466,
        "roles": [
          {
            "char": "Emilio Gomez"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Farrah Fawcett",
        "nm": 396,
        "roles": [
          {
            "char": "Blonde",
            "Miss Preem": true
          }
        ]
      },
      {
        "name": "Fred Sadoff",
        "nm": 755589,
        "roles": [
          {
            "char": "Hernandez"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E17",
    "title": "Hello Columbus",
    "tt": 580827,
    "air_date": "1970-01-30",
    "description": "As her lead gets ill, Sister Bertrille is looking for someone to portray Columbus in a reenactment of his landing on Puerto Rico. Carlos suggests his cousin, Luis, who is back in the casino kitchen causing Carlos grief since the dry goods store went bankrupt. Because Luis threatens to quit the play due to certain demands, Carlos does whatever he can to meet Luis' demands, thus keep him in the play and out of the casino kitchen. Carlos needs to buy new costumes and find an adult to play Queen Isabella. That role goes to Carlos' temporary bookkeeper, Marta Vargas. It's love at first sight for shy Luis, who doesn't have the nerve to approach her nor can he concentrate on his lines. Sister Bertrille talks Carlos into being Luis' go-between with Marta. Marta thinks that it's Carlos that's in love with her, and she kisses him, which Luis sees. Luis runs off in a huff and quits the play. Sister Bertrille convinces him to come back by playing to his patriotic side. The play's a hit, it brings Luis and Marta closer together, and gets Luis permanently out of the casino kitchen as he pursues a career in show business. Unfortunately for Carlos, it's the casino floor show that Luis takes over.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392,
            "voice": true
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393,
            "credit only": true
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          },
          {
            "char": "Luis Ramirez"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Michael Pataki",
        "nm": 329029,
        "roles": [
          {
            "char": "Roberto",
            "as Mike Pataki": true
          }
        ]
      },
      {
        "name": "Toian Matchinga",
        "nm": 532639,
        "roles": [
          {
            "char": "Marta Vargas"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Jimmy Brown",
        "nm": 2132589,
        "roles": [
          {
            "char": "Pepi"
          }
        ]
      },
      {
        "name": "Tony Nassour",
        "nm": 622000,
        "roles": [
          {
            "char": "Arnoldo"
          }
        ]
      },
      {
        "name": "Caesar Ramirez",
        "nm": 1413048,
        "roles": [
          {
            "char": "Sanchez"
          }
        ]
      },
      {
        "name": "Gianna Talone",
        "nm": 2127394,
        "roles": [
          {
            "char": "Tina Gonzales"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E18",
    "title": "The Dumbest Kid in School",
    "tt": 580858,
    "air_date": "1970-02-06",
    "description": "Mr. Sanders is an ex-student of the convent, now a success in his adult life. He has come back to the convent to adopt a child, namely what he calls the dumbest kid in school. By this, he infers that he is not only wanting such, but also the most mischievous, underachieving child. Although the Reverend Mother is somewhat off-put and offended by Sanders request, she cannot fault his motives: Sanders himself was also self-professed the dumbest kid in school and if not given the chance by his adoptive parents, he knows he would not have become a successful adult. The Reverend Mother can think of only one child that fits the bill: Joey. Joey is surprised to hear that someone is even considering adopting him as he realizes he doesn't have the best \"on paper\" record. He asks Carlos for advice on how to impress Sanders, Carlos telling him to go against all his own natural instincts of what to do. In his outing with Sanders, Joey, based on Carlos' advice, is the model child. From this, Sanders knows that Joey is not the child for him. The Reverend Mother finds out about Joey's talk with Carlos, and urges Sanders to take Joey out again, and tells Joey to just be himself on this second outing. Joey ends up being everything Sanders is looking for in a child. However, Sanders also tells Joey that he wants to adopt a child like himself, the dumbest kid in school. Joey is hurt by this admission and runs off. Back at the convent, he confronts Sanders and the Reverend Mother. He shows them both that he indeed is not dumb, but wise beyond his years. He tells Sanders that he will let Sanders adopt him when he becomes the smartest kid in school. Sanders knows he's found the right child.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391,
            "credit only": true
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Robert Lansing",
        "nm": 487108,
        "roles": [
          {
            "char": "Mr. Sanders"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Eric Shea",
        "nm": 790272,
        "roles": [
          {
            "char": "Joey"
          }
        ]
      },
      {
        "name": "Vincent Perry",
        "nm": 675348,
        "roles": [
          {
            "char": "The Bishop"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E19",
    "title": "Man's Best Friend Isn't",
    "tt": 580833,
    "air_date": "1970-02-13",
    "description": "Felix Ragusa, an independent plumber, gets a major plumbing job at Carlos' casino, the job obtained through an introduction from Sister Bertrille. Because Felix has to run around to get supplies, he has to leave his sidekick, Tiger the dog, with someone. Felix leaves Tiger with Carlos, who in turn leaves him with Sister Bertrille. However Sister Bertrille admits to the sisters that she is hesitant to look after Tiger since dogs have a special attachment to her, and often forget their rightful master in the process. Tiger does seem to have a special bond with Sister Bertrille. When Felix returns after two days away, Tiger treats him like a stranger and runs back to Sister Bertrille. Despite the fact that Felix loves Tiger or perhaps because of it, Felix gives Tiger to Sister Bertrille. Felix is making major errors in Carlos' plumbing job since he is so preoccupied with thoughts of Tiger. Back at the convent, Sister Bertrille tries tough love with Tiger, to no avail. Ultimately, she discovers that Tiger is afraid of birds, so she takes a little flight in front of Tiger. Tiger runs back to Felix, just in time for both Felix and Carlos - Felix can now properly and quickly fix Carlos' plumbing job. As a gift, Felix gives Sister Bertrille another dog: Tiger's brother.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Gino Conforti",
        "nm": 174581,
        "roles": [
          {
            "char": "Felix"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E20",
    "title": "The Somnaviatrix",
    "tt": 580879,
    "air_date": "1970-02-20",
    "description": "Little does Sister Bertrille know, but she's sleep-flying. On one of her sleeping flights, she comes across Carlos with Sophia Novello, the daughter of a business associate Antonio Novello. Carlos was driving Sophia home after a party when their car got stuck in a mud-hole. Getting Sophia home late will look bad for known womanizer Carlos, especially since Sophia is engaged to Paco Lopez, the son of Antonio's best friend. But Carlos has Sister Bertrille as a witness - or so he thinks. When Antonio confronts Carlos about Sophia's extremely late arrival home, Carlos goes to get Sister Bertrille to vouch for him, which she refuses to do since she witnessed nothing. Carlos and Sister Bertrille sever their relationship over this, Carlos because she won't help him, and Sister Bertrille because he asked her to lie blatantly for him. Equally as worse for Carlos and the Novellos, Antonio ceases a business relationship which will ruin Carlos financially, and Paco calls off the engagement over the incident. The next evening, the Reverend Mother and Sister Jacqueline witness Sister Bertrille's sleep-flying. Carlos' request to Sister Bertrille now makes sense to the sisters. When Sister Bertrille goes to apologize and explain to Carlos, they still need to convince Antonio without making Sister Bertrille look like either a liar or a circus freak. Antonio does not believe her story and threatens to report her immoral behavior to the church. Sister Bertrille even tries to explain with a demonstration of a flight. The wind is not cooperating and she can't get airborne. Finally she appeals to Paco, for who she can fly. Paco believes everything and clears the air with the Novellos - which includes making up with Sophia - and in turn convinces Antonio to forgive Carlos. Lastly with the issue of Sister Bertrille's sleep-flying, a simple order from the Reverend Mother not to do it cures her of the problem.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Joe De Santis",
        "nm": 211460,
        "roles": [
          {
            "char": "Antonio Novello"
          }
        ]
      },
      {
        "name": "Cynthia Hull",
        "nm": 401415,
        "roles": [
          {
            "char": "Sofia Novello"
          }
        ]
      },
      {
        "name": "Frank Ramirez",
        "nm": 1828862,
        "roles": [
          {
            "char": "Paco Lopez"
          }
        ]
      },
      {
        "name": "Gregory Sierra",
        "nm": 797268,
        "roles": [
          {
            "char": "Raoul",
            "ch": 101207
          }
        ]
      }
    ]
  },
  {
    "se": "S03E21",
    "title": "Papa Carlos",
    "tt": 580842,
    "air_date": "1970-02-27",
    "description": "Kim Ching is Carlos' foster daughter visiting from Korea. Carlos is expecting Kim to be a young girl who still plays with teddy bears, but she ends up being a beautiful young woman who is looking for a husband. She has many wannabe suitors, in particular Ramon Diaz, the convent's gardener and a former employee of Carlos'. But in protective Carlos' mind, no man is good enough for Kim, especially Ramon, who Carlos sees as a lady's man. But for Ramon, it's love at first sight with Kim. Kim interprets Carlos' refusal to let her date any man and his want to school her in the ways of being a western lady as his own intention to marry her himself. Despite Carlos explicitly telling Kim that he is not the marrying type, Kim still interprets Carlos' kindness as wanting her to take care of him forever. Ramon appoints himself Kim's knight in shining armor to protect her against what he sees as Carlos unsavory intentions. If Ramon can only stop yelling and screaming at Carlos long enough, he would find out that Carlos admires Ramon's dedication to Kim. Carlos allows Ramon to take Kim out, which ultimately leads to them eloping.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "George Bryson",
        "nm": 117457,
        "roles": [
          {
            "char": "Ramon Diaz"
          }
        ]
      },
      {
        "name": "Miko Mayama",
        "nm": 562203,
        "roles": [
          {
            "char": "Kim Ching"
          }
        ]
      },
      {
        "name": "Gregory Sierra",
        "nm": 797268,
        "roles": [
          {
            "char": "Raoul",
            "ch": 101207
          }
        ]
      }
    ]
  },
  {
    "se": "S03E22",
    "title": "The Candid Commercial",
    "tt": 580852,
    "air_date": "1970-03-06",
    "description": "After the convent washing machine breaks down, the sisters are forced to go to a laundromat. When Sister Bertrille goes in to do the convent laundry, little does she know that Harry Madison and Eddie, a commercial producer and cameraman, are shooting a candid camera commercial for Delight laundry detergent. Sister Bertrille is using Delight, much to their pleasure. She ends up being the perfect spokesperson for the detergent. Part of the compensation for doing the commercial is a new washing machine. The Reverend Mother however refuses to let Sister Bertrille be part of a commercial, even if it does mean not getting the washing machine. It is a bit more difficult for Sister Bertrille to back out of it as she did sign the release form and Harry will not let her out of the contract. When she asks Carlos to help her get out of the contract, Carlos hatches a plan to make Sister Bertrille look crazy by having her talk about flying. She not only appears crazy, but Carlos tells Harry that she's not really a nun, but a go-go dancer, one that he also implies has connections to the mafia (Sister Bertrille is supposedly hiding out at the convent from the mafia). Harry is now more than happy to let Sister Bertrille out of the contract, just as the Reverend Mother gets the OK from the bishop for Sister Bertrille to appear in the commercial. Sister Bertrille cannot convince Harry to use her footage. But when she mentions that she will sacrifice her private convent life for the betterment of the convent, Harry takes this as exposing her to the mafia, and as such, he decides to give the convent the washing machine. Now Harry needs to shoot another commercial, and the sisters, one by one, enter the laundromat extolling the merits of Delight - they need a new dryer as well.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Pat Harrington Jr.",
        "nm": 364224,
        "roles": [
          {
            "char": "Harry",
            "as Pat Harrington": true
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Ivor Francis",
        "nm": 290179,
        "roles": [
          {
            "char": "Bishop"
          }
        ]
      },
      {
        "name": "David M. Frank",
        "nm": 1721099,
        "roles": [
          {
            "char": "Eddie",
            "as David Frank": true
          }
        ]
      },
      {
        "name": "Joyce Peralta",
        "nm": 2106926,
        "roles": [
          {
            "char": "Lady"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E23",
    "title": "A Gift for El Charro",
    "tt": 580811,
    "air_date": "1970-03-13",
    "description": "Pablo Cortina stops by the convent looking for work, and agrees to do handyman work in exchange for English lessons. To Carlos, Pablo looks a lot like El Charro, a famous bullfighter from Madrid. They all discover that Pablo is indeed El Charro - his father was previously an orphan at the convent, and El Charro thought it would be the only place he could disappear from the media spotlight while he learned English. When a newspaperman comes snooping around the convent hearing that someone matching El Charro's description was hired as the convent handyman, Carlos pretends to be said handyman. This causes problems for Carlos, who is reported to be learning to read and write English. He can't convince some close to him that he's not illiterate, including new serious girlfriend Theresa, as he currently can't read anything since the opthamologist put pupil dilating drops in his eyes. Using a fake name, Theresa asks Sister Bertrille, who protects El Charro and implies Carlos is the one learning English at the convent. From this corroboration, Theresa dumps Carlos. Carlos asks Sister Bertrille to explain the whole story to Theresa. When Sister Bertrille and El Charro go to see Theresa, Theresa believes them but Carlos loses the girl anyway: she falls for El Charro.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Ben Archibek",
        "nm": 33782,
        "roles": [
          {
            "char": "Pablo Cortina aka El Charro"
          }
        ]
      },
      {
        "name": "Michael Barbera",
        "nm": 53490,
        "roles": [
          {
            "char": "Juan"
          }
        ]
      },
      {
        "name": "Lloyd Battista",
        "nm": 61437,
        "roles": [
          {
            "char": "Ramon Esteban",
            "as Lloyd Batista": true
          }
        ]
      },
      {
        "name": "Corinne Camacho",
        "nm": 131074,
        "roles": [
          {
            "char": "Theresa"
          }
        ]
      },
      {
        "name": "Alfred Dennis",
        "nm": 219410,
        "roles": [
          {
            "char": "Chef"
          }
        ]
      },
      {
        "name": "Harvey Jason",
        "nm": 419256,
        "roles": [
          {
            "char": "Fernando Morales"
          }
        ]
      },
      {
        "name": "Gregory Sierra",
        "nm": 797268,
        "roles": [
          {
            "char": "Raoul",
            "ch": 101207
          }
        ]
      },
      {
        "name": "Roberto Zalaya",
        "nm": 2070044,
        "roles": [
          {
            "char": "Dishwasher",
            "as Roberto Zelaya": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E24",
    "title": "When Generations Gap",
    "tt": 580884,
    "air_date": "1970-03-20",
    "description": "Sister Bertrille gets into a fender bender, caused by her running a red light. She can't really remember what happened, and is willing to accept responsibility for the accident if it was her fault. However, Alfonso T. Gomez, a witness, states that it was not Sister Bertrille's fault. The occupants of the other car are hippies, namely Tommy Boyce and Bobby Hart of the singing group, The Paper Balloon, who happen to be appearing at Carlos' casino. Sister Bertrille just wants to forget the incident, but it becomes a big media story about subversive hippies against an innocent nun, a story which ruins business at the Paper Balloon's show at Carlos' casino. When Boyce and Hart jog the sister's memory, she does realize it was the station wagon's loose brakes that caused her to run the red light. She goes to Gomez to double check what happened, he who admits it was her fault, the reason for his false story being the fact that the convent could use the insurance money from that of rich, spoiled hippies; Gomez' negative feelings about hippies stem from the fact that his son is one. Even after Sister Bertrille and Gomez go to the newspaper to recant his eyewitness account, the television news reports that the spoiled rich hippies bought off Gomez. Finally, Sister Bertrille sees only one way for the public opinion to sway in favor of Boyce and Hart: they need to do a benefit concert with proceeds going to the convent.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Linda Dangcil",
        "nm": 199484,
        "roles": [
          {
            "char": "Sister Ana"
          }
        ]
      },
      {
        "name": "Tommy Boyce",
        "nm": 101670,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Michael Gray",
        "nm": 336829,
        "roles": [
          {
            "char": "Young Man"
          }
        ]
      },
      {
        "name": "Bobby Hart",
        "nm": 366168,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Eugene Iglesias",
        "nm": 407094,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "Miguel Ángel Landa",
        "nm": 484397,
        "roles": [
          {
            "char": "TV Commentator",
            "as Miguel Landa": true
          }
        ]
      },
      {
        "name": "Ernest Sarracino",
        "nm": 765512,
        "roles": [
          {
            "char": "Alfonso T. Gomez"
          }
        ]
      },
      {
        "name": "A.G. Vitanza",
        "nm": 899951,
        "roles": [
          {
            "char": "Ramon"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E25",
    "title": "Operation Population",
    "tt": 580841,
    "air_date": "1970-03-27",
    "description": "A baby is left on the doorstep for the convent and Sister Bertrille is determined to find the mother to help her.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Alma Beltran",
        "nm": 69608,
        "roles": [
          {
            "char": "Ava Ferone"
          }
        ]
      },
      {
        "name": "Joseph Bernard",
        "nm": 76282,
        "roles": [
          {
            "char": "Sgt. Santos"
          }
        ]
      },
      {
        "name": "Jose De Vega",
        "nm": 212061,
        "roles": [
          {
            "char": "Antonio"
          }
        ]
      },
      {
        "name": "Alfred Dennis",
        "nm": 219410,
        "roles": [
          {
            "char": "Cesar"
          }
        ]
      },
      {
        "name": "Pedro Gonzalez Gonzalez",
        "nm": 327602,
        "roles": [
          {
            "char": "Farmer"
          }
        ]
      },
      {
        "name": "Julio Medina",
        "nm": 575728,
        "roles": [
          {
            "char": "Mayor Salvador Calderon"
          }
        ]
      },
      {
        "name": "Victor Millan",
        "nm": 587637,
        "roles": [
          {
            "char": "Architect"
          }
        ]
      },
      {
        "name": "Lew Palter",
        "nm": 658817,
        "roles": [
          {
            "char": "Pedro Ferone"
          }
        ]
      },
      {
        "name": "Naomi Stevens",
        "nm": 828653,
        "roles": [
          {
            "char": "Señora Rosales"
          }
        ]
      },
      {
        "name": "Hilary Thompson",
        "nm": 860208,
        "roles": [
          {
            "char": "Susan",
            "as Hilarie Thompson": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E26",
    "title": "No Tears for Mrs. Thomas",
    "tt": 580839,
    "air_date": "1970-04-03",
    "description": "Thomas Martinez, Carlos' uncle, is planning his own funeral to be held next week, this funeral despite him not being ill. He admits to Sister Bertrille that he has witnessed what he calls the Martinez Sign, that which generations of his male ancestors have seen and have passed away exactly seven days following. However he has not stated what the sign is. The funeral is getting out of hand - he is charging everything to the convent as the convent is the beneficiary to his life insurance money which will pay for the funeral. And those invited to the funeral, including his lady companion Luisa Montero, are crying on the sisters and Carlos' shoulders. Finally, Martinez tells them the sign: a big white bird flying around overhead. Martinez' sign was Sister Bertrille in flight. Instead of telling him, Sister Bertrille and Carlos figure it would be better to show him that it was really Sister Bertrille. When Martinez sees Sister Bertrille in the air, he thinks he has seen The Sign once again and faints, thinking that the end is even nearer. As one last act of compassion, he decides to marry Luisa. However Sister Bertrille decides to actually take off in flight right in front of him. It's then that he believes he has not seen The Sign and is going to live. Luisa and Martinez get married anyway, but instead of doing it on his deathbed, they do it properly at the convent.",
    "cast": [
      {
        "name": "Sally Field",
        "nm": 398,
        "roles": [
          {
            "char": "Sister Bertrille",
            "ch": 167391
          }
        ]
      },
      {
        "name": "Marge Redmond",
        "nm": 715073,
        "roles": [
          {
            "char": "Sister Jacqueline",
            "ch": 167392
          }
        ]
      },
      {
        "name": "Madeleine Sherwood",
        "nm": 792828,
        "roles": [
          {
            "char": "Reverend Mother Superior Placido",
            "ch": 167393
          }
        ]
      },
      {
        "name": "Alejandro Rey",
        "nm": 721031,
        "roles": [
          {
            "char": "Carlos Ramirez",
            "ch": 80028
          }
        ]
      },
      {
        "name": "Frank Silvera",
        "nm": 798826,
        "roles": [
          {
            "char": "Thomas"
          }
        ]
      },
      {
        "name": "Shelley Morrison",
        "nm": 607314,
        "roles": [
          {
            "char": "Sister Sixto"
          }
        ]
      },
      {
        "name": "Penny Santon",
        "nm": 763842,
        "roles": [
          {
            "char": "Mrs. Montero"
          }
        ]
      },
      {
        "name": "Booth Colman",
        "nm": 172884,
        "roles": [
          {
            "char": "Priest"
          }
        ]
      },
      {
        "name": "Don Diamond",
        "nm": 224614,
        "roles": [
          {
            "char": "Dr. Escovito"
          }
        ]
      },
      {
        "name": "Larry Gelman",
        "nm": 312475,
        "roles": [
          {
            "char": "Mendoza"
          }
        ]
      },
      {
        "name": "Lou Antonio",
        "nm": 31398,
        "roles": [
          {
            "char": "Stone Mason",
            "uncredited": true
          }
        ]
      }
    ]
  }
]
