[
  {
    "se": "S01E01",
    "title": "The Disloyal Canadians/Finding Gold/Stokey the Bear",
    "tt": 3363304,
    "air_date": "1959-11-01",
    "description": "Snidely Whiplash smuggles furs across the border with the aid of his musical band \"The Disloyal Canadians\". / Dudley Do-Right needs gold to win the heart of Nell Fenwick. / Stokey the Bear has been hypnotized by Snidely Whiplash to start fires!",
    "cast": null
  },
  {
    "se": "S01E02",
    "title": "Mortgagin' the Mountie Post/Trap Bait/The Masked Ginny Lynn",
    "tt": 3363292,
    "air_date": "1959-11-01",
    "description": "Dudley Do-Right, Royal Canadian Mountie -- he's handsome, he's fearless, he's the only Mountie to ever arrest a redwood tree for loitering! In this hilarious series, the dim-witted hero may lack common sense and skill but he certainly is determined to get his man -- the dastardly, ne'er-do-well Snidely Whiplash.",
    "cast": null
  },
  {
    "se": "S01E03",
    "title": "The Centaur/Railroad Tracks/Foreclosing Mortgages",
    "tt": 3363324,
    "air_date": "1959-11-01",
    "description": "Dudley Do-Right captures what he believes to be a Centaur and makes it his new mount. / Dudley disguises himself as Nell to capture Snidely Whiplash. / Snidely forces Canadian homeowners out into the cold!",
    "cast": null
  },
  {
    "se": "S01E04",
    "title": "Snidely Mounted Police/Mother Love/Mountie Bear",
    "tt": 3363310,
    "air_date": "1959-12-01",
    "description": "Snidely Whiplash opens his own mounted police force. / When Dudley gets in trouble, his mother knows best. / A bear takes a liking to the Mountie uniforms and insists on joining the force!",
    "cast": null
  },
  {
    "se": "S01E05",
    "title": "Inspector Dudley Do-Right/Recruiting Campaign/Out of Uniform",
    "tt": 3363322,
    "air_date": "1959-12-01",
    "description": "Snidely Whiplash disguises himself as Inspector Fenwick. / Dudley Do-Right is forced into an all-out recruiting campaign for the RCMP. / Snidely hatches a brilliant plan and steals Dudley's uniform.",
    "cast": null
  },
  {
    "se": "S01E06",
    "title": "Lure of the Footlights/Bullet-Proof Suit/Miracle Drug",
    "tt": 3363306,
    "air_date": "1959-12-01",
    "description": "Dudley teams up with Snidely Whiplash so he can go into show business. / Snidely Whiplash tricks Nell Fenwick into knitting him a bulletproof suit. / Dudley seeks a miracle drug to cure an epidemic that has befallen the RCMP.",
    "cast": null
  },
  {
    "se": "S01E07",
    "title": "Elevenworth Prison/Saw Mill/Mountie Without a Horse",
    "tt": 3363300,
    "air_date": "1959-12-01",
    "description": "Dudley Do-Right goes undercover at Elevenworth Prison. / Snidely Whiplash kidnaps Nell on her wedding day and holds her hostage in the sawmill. / Snidely impersonates the Colonel and tells all of the Mounties that they must replace their horses with rocking horses.",
    "cast": null
  },
  {
    "se": "S01E08",
    "title": "Mother Whiplash's Log Jam/Stolen Art Masterpieces/Mechanical Dudley",
    "tt": 3363290,
    "air_date": "1959-12-01",
    "description": "Dudley joins the Mounties and his first assignment is to blow up Snidely's log jam factory. / A priceless art masterpiece is stolen in Toronto and Dudley Do-Right is called to the scene. / Snidely replaces Dudley with a robot in an effort to infiltrate the Mounties.",
    "cast": null
  },
  {
    "se": "S01E09",
    "title": "Flicker Rock/Faithful Dog/Coming-Out Party",
    "tt": 3363312,
    "air_date": "1959-12-01",
    "description": "Snidely pushes Flicker Rock onto Dudley's head making him more disoriented than ever. / Dudley finds an unlikely partner in a vicious wolf sent by Snidely. / Inspector Fenwick uses Nell's coming out party to steal Snidely's hat, making him a laughing stock.",
    "cast": null
  },
  {
    "se": "S01E10",
    "title": "Robbing Banks/Skagway Dogsled-Pulling Contest/Canadian Railways Bridge",
    "tt": 3363302,
    "air_date": "1959-12-01",
    "description": "Posing as a Mountie, Snidely Whiplash goes on a bank-robbing spree. / Snidely wins the Skagway Dogsled-Pulling contest every year by cheating. / Snidely continually destroys the Canadian Railway Bridge so that his company will be hired to rebuild it.",
    "cast": null
  },
  {
    "se": "S01E11",
    "title": "Niagara Falls/Snidely's Vic Whiplash Gym/Marigolds",
    "tt": 3363316,
    "air_date": "1959-12-01",
    "description": "Snidely Whiplash erects a dam to stop Niagara Falls and bring down the Canadian economy. / Dudley Do-Right pays a visit to Snidely's Vic Whiplash gym where he loses all of his strength. / Snidely discovers that Dudley is allergic to marigolds so he makes a suit out of them, making it impossible for Dudley to capture him.",
    "cast": null
  },
  {
    "se": "S01E12",
    "title": "Trading Places/Top Secret/The Locket",
    "tt": 3363296,
    "air_date": "1959-12-01",
    "description": "When Dudley and Nell switch places, Nell captures every criminal in Canada. / Dudley keeps a Top Secret project safe from Snidely Whiplash, who is actually in charge of it. / Nell gives both Snidely and Dudley a locket with her picture inside.",
    "cast": null
  },
  {
    "se": "S01E13",
    "title": "The Inspector's Nephew/Matinee Idol/Snidely Arrested",
    "tt": 3363320,
    "air_date": "1959-12-01",
    "description": "One of Snidely's lackeys is mistaken for Inspector Fenwick's nephew. / A Hollywood talent scount picks Snidely as his new matinee idol. / Inspector Fenwick invents a machine to capture Snidely Whiplash, but Nell takes up his defense.",
    "cast": null
  }
]
