[
  {
    "se": "S01E01",
    "title": "Mrs. Livingston, I Presume",
    "tt": 549804,
    "air_date": "1969-09-17",
    "description": "On a movie studio tour, Eddie meets aspiring actress, Dolly Daly, who is recently arrived in Los Angeles and who Eddie sees as a potential mother. Eddie invites her home more as an act of generosity than anything. Dolly accepts, much to Tom's consternation especially since he can't fully explain to Eddie why what he did was wrong. Back at the apartment, Tom tries to explain to Dolly that she can't stay but in a losing battle, he ultimately let's her sleep on the couch. The next morning, Mrs. Livingston sees Dolly on the couch and is angry with Tom for what she sees as the bad example he is setting for Eddie by having one of his dates stay overnight. Mrs. Livingston storms out, Eddie and Tom thinking that she's gone forever. Just as Tom feels at the end of his rope, he comes up with an idea: he sends Dolly off to deal with Norman who has always wanted to do a story on young women new to Los Angeles hoping to make it into the movie business. In doing so, Tom solves most of his problems - Dolly is now out of his personal life and the story resolves some work problems Tom was having with Norman. The only unresolved issue is Mrs. Livingston's absence from the Corbett household. However Mrs. Livingston solves what was never a problem - she left the apartment solely to go to the market to get more eggs for breakfast.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Lynn Fields",
        "nm": 276309,
        "roles": [
          {
            "char": "Heidi"
          }
        ]
      },
      {
        "name": "Ann Marie",
        "nm": 2013922,
        "roles": [
          {
            "char": "Hildy"
          }
        ]
      },
      {
        "name": "Victoria Vetri",
        "nm": 895407,
        "roles": [
          {
            "char": "Dolly Daly",
            "ch": 257366
          }
        ]
      },
      {
        "name": "Karin Wolfe",
        "nm": 938081,
        "roles": [
          {
            "char": "Etta"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E02",
    "title": "Teacher's Pet",
    "tt": 549808,
    "air_date": "1969-09-24",
    "description": "When Tom goes to a parent-teacher meeting with Eddie's first grade teacher, Miss Kerry Allen, there is a mutual attraction between the two and they start dating. Although this is all right with Eddie, he eventually faces some problems at school with the other kids, who tease him about being the teacher's pet. Tom becomes concerned when Eddie comes home late from school one day obviously haven been in a fight, the fight due to Tom and Kerry's relationship. Despite this, Eddie doesn't want them to stop dating since he figures it is not any of the kids' businesses, especially since the relationship is not hurting anyone. In a discussion, Tom and Kerry decide that they individually are abusing their adult authority positions by being in this relationship and decide it best to stop dating. When they tell Eddie the news, Eddie, who looks like he has been another fight, tells them that he wants them to continue dating. The kids have finally let him play football out in the school yard just so that they could tackle him for being teacher's pet. However he likes the fact of finally being able to play football, especially when he makes his first touchdown.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Max Kelly"
          }
        ]
      },
      {
        "name": "Ann Prentiss",
        "nm": 696031,
        "roles": [
          {
            "char": "Kerry Allen"
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      },
      {
        "name": "Richard Steele",
        "nm": 824649,
        "roles": [
          {
            "char": "Dick"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E03",
    "title": "And Eddie Makes Three",
    "tt": 549785,
    "air_date": "1969-10-01",
    "description": "Lynn Bardman is the latest of Tom's girlfriends. He is thinking about asking her to marry him. Although he doesn't come right out and say it to Tom, Eddie doesn't really like her. Eddie treats her with a slight coolness, which some could construe as just a kid acting like a kid. On a day that Eddie comes down with the flu, so does Mrs. Livingston, and thus she can't come to take care of Eddie while Tom is off at work. So Tom calls Lynn to watch Eddie for the day, during which she encounters one domestic disaster after another. Eddie finally warms up to her and comforts her, but conversely the day shows Lynn that she isn't ready to be a mother, which is what Eddie really needs.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Diana Muldaur",
        "nm": 611707,
        "roles": [
          {
            "char": "Lynn Bardman"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E04",
    "title": "The Littlest Kidnapper",
    "tt": 549822,
    "air_date": "1969-10-08",
    "description": "Eddie is concerned for Mrs. Livingston, who he sees as being all alone in the world. Eddie first wants Tom to marry her, and when Tom explains to Eddie why he can't and won't marry her, Eddie then brings home five-year old Frank, his Japanese friend, to give to Mrs. Livingston to be her son. Frank seems quite happy with this new arrangement. Tom and Mrs. Livingston are obviously concerned as Frank must have a real family who are concerned of his whereabouts. Eddie explains that Frank doesn't have a mother and father, but that he has a mother and a father: they're separated. Since Frank can't tell Tom any more information about himself than that his name is Frank and that he's five-years old, and since the school is closed, Tom feels the only option is to call in the police to locate Frank's family. The police can't do anything until Frank's family calls and feel that the Corbett household a better environment to keep Frank than the police station. Finally, Frank's parents, Duke and Kendis Komosori, locate Frank at the Corbetts. Although his ethnic background is Japanese, Duke is a totally westernized fourth generation American, while Kendis is traditionally Japanese, these differences which led to the break-up of their marriage. Although there are deep feelings still within the Komosori family, they will have to work hard if they want to reunite their family happily under one roof. The dysfunction between the Komosori's shows Eddie that Tom and Eddie and Mrs. Livingston all really have each other in a meaningful way despite Mrs. Livingston having a different last name.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Bill Dana",
        "nm": 199049,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      },
      {
        "name": "Miko Mayama",
        "nm": 562203,
        "roles": [
          {
            "char": "Kendis Komosori"
          }
        ]
      },
      {
        "name": "Pat Morita",
        "nm": 1552,
        "roles": [
          {
            "char": "Duke Komosori"
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      }
    ]
  },
  {
    "se": "S01E05",
    "title": "The Computer",
    "tt": 549814,
    "air_date": "1969-10-15",
    "description": "Norman and Tina convince Tom to try computer dating as part of a story Norman is doing for the magazine. Tom however wants to make it clear to whomever his date that this is purely an academic exercise. Unfortunately for Tom, Norman bring's Tom's computer date over to the apartment on a day Tom is home sick with a cold. Diane Kirby, Tom's computer match, actually works for the computer dating company and is a fervent believer in the powers of her computer. It's love at first sight between Diane and Eddie, and Diane is attracted to Tom, but Diane is not Tom's type. Beyond that, Tom just wanted to talk to Diane solely for the story anyway. The wise Mrs. Livingston thinks she knows what went wrong: Tom's answers for the computer were all with Eddie's welfare in mind. This is proven true when, as a lark, Diane allows Eddie to answer the computer dating questions and insert it into the computer. Diane was not expecting any match to appear, however one match came back: her. This exercise made Diane herself realize that when she answered the questions, she was projecting her own strong want to be a mother.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Sabrina Scharf",
        "nm": 770124,
        "roles": [
          {
            "char": "Diane Kirby"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E06",
    "title": "Pain",
    "tt": 549806,
    "air_date": "1969-10-22",
    "description": "Eddie dreads his first day of school as he likes his current general routine. Tom forces him to go, but Eddie doesn't make it to first bell as he runs home before class even starts. Tom is frustrated, but is just as upset that Eddie is lying about his reason for running home. Tom tries to appeal to Eddie's sense of logic to convince him to go to school. Day after day, Eddie gets closer and closer to making it through a full day, however he is placing up fences around himself from actually letting himself to like the situation. Tom, feeling at the end of his rope, contemplates hiring a tutor, which Mrs. Livingston doesn't think a good idea since it will make Eddie different than all the other kids. Finally Tom thinks he's found the answer: he's going to quit his job and stay at home to teach Eddie himself, or so he tells Eddie. Tom pretends to be a tough, boring and quite bad teacher. In addition, he also tells Eddie that Mrs. Livingston will no longer be around since Tom can't pay her if he's not earning a living. Although Tom is somewhat ashamed of telling these white lies - especially after chastising Eddie for lying - the ploy works and Eddie decides to go to school and begins to like it. In Tom and Mrs. Livingston's minds, sometimes the end does justify the means.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Ron Ely",
        "nm": 255935,
        "roles": [
          {
            "char": "Ronald"
          }
        ]
      },
      {
        "name": "Ann Marie",
        "nm": 2013922,
        "roles": [
          {
            "char": "Model"
          }
        ]
      },
      {
        "name": "Sally Ann Richards",
        "nm": 723891,
        "roles": [
          {
            "char": "Estelle Sherman"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E07",
    "title": "Guess Who's Coming for Lunch",
    "tt": 549796,
    "air_date": "1969-10-29",
    "description": "Eddie gets a new second best friend - Tom will always be his best friend - by the name of Max, who Eddie wants to spend time with when best friend Tom needs to do his adult things. Tom finds out that Max's mother, Betty Kelly, is a single parent, which makes Mrs. Livingston think that Eddie is once again \"mother shopping\". On Eddie's urging, Tom invites Max over to stay for the weekend, and in turn invites Betty over for dinner on a pseudo blind date. She ends up being everything Eddie explained - beautiful with warm round eyes - and what Tom imagined, but she's also African-American. Eddie and Max have a tiff to start the evening, but Betty and Tom have a great evening from start to finish (except for the burnt dinner).",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Max Kelly"
          }
        ]
      },
      {
        "name": "Cicely Tyson",
        "nm": 1807,
        "roles": [
          {
            "char": "Betty Kelly"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E08",
    "title": "Bully for You",
    "tt": 549787,
    "air_date": "1969-11-05",
    "description": "Eddie is embarrassed by a knock-out punch he received from Joey Kelly, who Tom learns is smaller and younger than Eddie. Tom is concerned that Eddie is neither fighting back or defending himself against Joey. The last straw for Tom is when Joey knocks out Eddie's tooth. Tom understands Eddie's behavior when he finally meets Joey. Joey is a girl. It's even more clear when Tom learns of and sees Joey's home-life: she is raised by her single father, Joe, a rough and tumble guy's guys who doesn't know the finer details of raising a girl. A learned trait from her father, Joey continues to hit Eddie because she likes him. In an effort to expose Joey to other adult influences, Tom invites her over to the apartment where Mrs. Livingston teaches Joey the fine art of being a woman, Japanese style. It works in part, but old habits are hard to break, and Joey finally rebels once against Eddie. Eddie, in turn, based on advice from Joey's father, decides this time to punch Joey back. They come to a better understanding as Joey didn't like getting punched back. Eddie and Joey are going to become good friends after all.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Jodie Foster",
        "nm": 149,
        "roles": [
          {
            "char": "Joey Kelly",
            "ch": 257188
          }
        ]
      },
      {
        "name": "David Ketchum",
        "nm": 450495,
        "roles": [
          {
            "char": "Joe Kelly"
          }
        ]
      },
      {
        "name": "Arlen Stuart",
        "nm": 835649,
        "roles": [
          {
            "char": "Mrs. Stuart"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E09",
    "title": "Gentleman Friend",
    "tt": 549792,
    "air_date": "1969-11-12",
    "description": "It's the first day of spring, and spring fever has hit Mrs. Livingston. Tom and Eddie notice that Mrs. Livingston is unusually preoccupied with her thoughts, they discover her thoughts are in the direction of her male suitor, Mr. Sato. They love each other. Eddie is worried that Mrs. Livingston's going to leave them, but Tom explains to him that part of loving someone, like the way they love Mrs. Livingston, is to want that person to be happy regardless of how it affects themselves. When Mr. Sato announces to Tom and Eddie that he wants to marry Mrs. Livingston, Eddie is obviously sad by the news despite what Tom said to him. Tom starts to interview for a new housekeeper, and finds a perfect candidate in Mrs. Thaler, but he doesn't hire her as he can't yet admit to himself that Mrs. Livingston is leaving. It becomes harder for Mrs. Livingston when Mr. Sato tells her he must move back to Japan. Ultimately she breaks it off with Mr. Sato, not, as Tom asks because of Eddie, but as she states because being homesick is not a good reason to get married.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Claudia Bryar",
        "nm": 117267,
        "roles": [
          {
            "char": "Mrs. Thaler"
          }
        ]
      },
      {
        "name": "George Takei",
        "nm": 1786,
        "roles": [
          {
            "char": "Mr. Sato"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E10",
    "title": "Any Friend of Dad's",
    "tt": 549786,
    "air_date": "1969-11-19",
    "description": "Harvey Henshaw, an old college friend of Tom, stops by unexpectedly, Harvey who is in town on a business trip. Friend is overstating their relationship as Tom, although remembers him, probably would have been happy in life if he never saw Harvey again. Harvey is brash and overbearing. However, Harvey is happy to see his old buddy, Tommy, and ingratiates himself quickly into the Corbett household, especially gaining Eddie's favor, Eddie who calls him Uncle Harvey. Despite initially saying that he doesn't want to impose, Harvey stays for dinner, stays overnight (in Eddie's bed, Eddie who has to sleep with Tom), for breakfast, overnight again... Tom wants to stop being gracious to Harvey, but can't stop being so. One evening, Harvey brings home two \"loose\" women to double date with Tom. Tom doesn't want to spend any time with Harvey let alone date anyone who is not mother/wife material. Tom uses Mrs. Livingston not being able to sit with Eddie as an excuse not to go out with Harvey and the girls. However, Mrs. Livingston as his excuse falls through, and Tom is forced to go out with Harvey, or else get exposed in a lie. Just as Tom is about to finally tell Harvey to leave for good, Harvey announces that his trip is coming to an end and graciously gives beautiful and meaningful gifts to Eddie, Mrs. Livingston and Tom for their hospitality. Harvey really is a friend, but one better kept at a distance.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Warren Berlinger",
        "nm": 75671,
        "roles": [
          {
            "char": "Harvey Henshaw"
          }
        ]
      },
      {
        "name": "Jean Marie Ingels",
        "nm": 408731,
        "roles": [
          {
            "char": "Doreen",
            "as Jean Marie": true
          }
        ]
      },
      {
        "name": "Linda Meiklejohn",
        "nm": 576824,
        "roles": [
          {
            "char": "Jeri"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E11",
    "title": "An F for Mrs. Livingston",
    "tt": 549784,
    "air_date": "1969-11-26",
    "description": "Mrs. Livingston is unusually preoccupied with her thoughts, and not in a good way. Tom and Eddie learn what's bothering her: she failed her final English exam. She feels ashamed. She also feels she has brought disgrace to the Corbett household. Based on what Eddie's friend Paul saw on TV, Eddie is concerned that since Mrs. Livingston lost face, she might attempt hari-kari, or what Paul and Eddie call berry-berry. Eddie watches her every move and is concerned when she won't let him in the kitchen and is wielding a knife. Eddie, not knowing what to do, calls Tom at the office. Eddie speaks only to Tina since Tom is unavailable. Harried herself with work, Tina mistranslates to Tom Eddie's message of berry-berry and Mrs. Livingston wanting to kill herself into that there will be no berry pie tonight due to a disaster. Eddie is still worried even after Mrs. Livingston explains the knife and the reason for not letting him in the kitchen. Eddie needs the help of an adult and even tries to detain a stranger, who knocks on their apartment door by mistake. Mrs. Livingston finally understands why Eddie is so worried, and when Tom comes home, Tom tells Eddie that Mrs. Livingston would never commit hari-kari. Eddie shows Mrs. Livingston how much she means to their family, after which she regains \"her face\". After all is said and done, Mrs. Livingston passes the make-up exam.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "LoLo Cannon",
        "nm": 134229,
        "roles": [
          {
            "char": "Paul"
          }
        ]
      },
      {
        "name": "Bruce Kirby",
        "nm": 116483,
        "roles": [
          {
            "char": "Harry"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E12",
    "title": "Member of the Wedding",
    "tt": 756836,
    "air_date": "1969-12-03",
    "description": "Norman is working on a wedding themed story, which inspires Tina to want to get married, specifically to Norman. On the spur of the moment, she proposes to him. Norman is flabbergasted since they haven't dated and hardly even know each other. Tom thinks it's a nesting instinct in Tina coming through, but he also thinks it's Norman's fault for his off the cuffs \"I adore you\" and \"I can't live without you\" comments to Tina. Norman decides that if he says those things, he must really mean them. So he decides to marry Tina. Talk of weddings brings up questions from Eddie and very fond remembrances from Tom of Tom and Helen's engagement, wedding and early life. Eddie tells Tina and Norman about Tom and Helen's life. Tina then Norman finally realize that marriage will mean a whole-scale change in their lives, from dates every night at the Licorice Stick - a discotheque - to a house with a white picket fence and children. They decide to call off the wedding, but being the party people that they are, decide to hold the reception anyway.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S01E13",
    "title": "A Night Out for the Boys",
    "tt": 549782,
    "air_date": "1969-12-10",
    "description": "Inexperienced campers Tom and Eddie accept an offer to go camping with Eddie's friend, Danny, and his father, Dr. Bob Lockwood, whose prime purpose for camping is to build character. While Tom just wants to relax and have a good time, Bob treats camp like the army, Danny being a private, and Tom and Eddie only privates in training. During their trip, Bob is called away back to the city on a medical emergency, leaving Tom and the boys to fend for themselves. While Danny and Eddie play hide and go seek, Danny gets lost. Tom and Eddie manage to find Danny, who admits it was all his fault since he did everything that a good camper should not. Tom did something wrong as well: he lost his compass and is also now lost. The threesome manage to stumble back to the campsite just as Bob returns. Considering the time during his absence to be a total debacle, Bob chastises all three and decides they should pack it in and go home early. Tom, who doesn't really care if Bob doesn't like him, does care about Eddie and Danny's weekend and more importantly Danny's welfare. Although Tom and Bob don't agree on anything, Bob does finally come to the conclusion that Danny may not respect him and is only scared of him when Danny continually calls him sir instead of Dad. The dynamic between father and son Lockwood is now changed from that of officer/charge to father/son.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Jonathan Daly",
        "nm": 198463,
        "roles": [
          {
            "char": "Dr. Bob Lockwood",
            "ch": 132838
          }
        ]
      },
      {
        "name": "Teddy Quinn",
        "nm": 704006,
        "roles": [
          {
            "char": "Danny Lockwood",
            "ch": 132837
          }
        ]
      }
    ]
  },
  {
    "se": "S01E14",
    "title": "Mother of the Year",
    "tt": 549803,
    "air_date": "1969-12-17",
    "description": "Eddie is feeling left out in school. Eddie's teacher, Miss Lister - who is really Mrs. Rogall - is pregnant and the mothers of her students are planning a surprise party for her. Of course, Eddie does not have a mother. Miss Lister finds out about Eddie's troubles and the party when Eddie writes her a note stating that since he doesn't have a mother, the only thing he can provide for her party is his father. In fact, \"Mrs. Tom Corbett\" receives a letter asking for her assistance in the party. After conferring with Miss Lister, Tom does decide to become Eddie's mother for this function. The other mothers are reluctant to let Tom into the party organization because of his gender and his supposed inability to do motherly things, like make finger sandwiches, or what Eddie and Tom call fingertip sandwiches. But Tom, after refuting the statement by organizer Mrs. Harris that the party is not one for \"the ladies\" but rather for Miss Lister and her class, does join in and volunteers to make such sandwiches for the party. The other mothers still think that Tom will ruin everything for the party. Tom very well could as he has no idea what are in finger sandwiches nor does he want to enlist the help of a female, even the help of Mrs. Livingston, in making them. But seeing that the food is for the children, Tom takes his cue from the sandwiches that Eddie makes for himself. The results may not look pretty, but end up being a big hit not only among the children, but also Miss Lister and the mothers. The sandwiches consist of chopped hot dog, peanut butter, mayonnaise, pickles, chocolate, milk, jelly beans and chewing gum (although Tom lied about the pickles and milk). Tom later admits to Mrs. Livingston that the success of making the sandwiches was due to one important factor: taking a good hit of bourbon before starting.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Max Kelly"
          }
        ]
      },
      {
        "name": "Gwynne Gilford",
        "nm": 318522,
        "roles": [
          {
            "char": "Mrs. Baldassare"
          }
        ]
      },
      {
        "name": "Tani Guthrie",
        "nm": 349307,
        "roles": [
          {
            "char": "Barbara Harris",
            "as Tani Phelps": true
          }
        ]
      },
      {
        "name": "Diana Hale",
        "nm": 354888,
        "roles": [
          {
            "char": "Mrs. Basimson"
          }
        ]
      },
      {
        "name": "Pamela Peadon",
        "nm": 668822,
        "roles": [
          {
            "char": "Camylle Lister-Rogall"
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      },
      {
        "name": "Bret Swanson",
        "nm": 1964845,
        "roles": [
          {
            "char": "Dick"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E15",
    "title": "Who Pulled the Blues Right Out of the Horn",
    "tt": 549836,
    "air_date": "1969-12-24",
    "description": "Tom's sister-in-law, Kate, is in town for a visit. Eddie doesn't even know he has this aunt, Tom protecting him from memories of his mother who Kate strongly resembles physically. Tom thinks that family is family and decides to let Eddie meet his Aunt Kate. Kate may look like her sister, Tom's deceased wife Helen, but has a very flamboyant personality. In Tom's eyes, Kate is kooky and irresponsible. After Kate takes Eddie on an outing, Tom feels that Kate may not be the best influence on Eddie, especially since he thinks that Eddie's impressionable mind would think that kooky Kate is just like Helen. So Tom kindly asks Kate to leave for good. But after Tom witnesses a tender moment between Eddie and Kate and has his own remembrances of Helen, Tom changes his mind and realizes that family is important for Eddie. And most importantly, Eddie does have a clear distinction between his mother and his Aunt Kate.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Karin Wolfe",
        "nm": 938081,
        "roles": [
          {
            "char": "Etta"
          }
        ]
      },
      {
        "name": "Francine York",
        "nm": 948696,
        "roles": [
          {
            "char": "Kate Landis"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E16",
    "title": "The Library Card",
    "tt": 549821,
    "air_date": "1969-12-31",
    "description": "Because Eddie's progress at reading is going slowly, Tom thinks a good solution is to get Eddie a library card. It does the trick as Eddie is enthralled both with his very own library card and by association the book he checked out with it. Tom tells Eddie that having a library card comes with some responsibility, which Eddie apparently forgets as the book becomes overdue. What's worse however is that he can't find the book. Eddie turns his room upside down to locate the book, but to no avail. Eddie's friend, Alice, tells Eddie that he's going to go to jail for losing the book. Since Tom is too busy when Eddie tries to tell him he lost the book, Eddie decides the right thing to do is to turn himself into the police. The news of this act obviously gets back to Tom, who has a heart to heart with Eddie about the lost book. But after all is said and done, Tom has two apologies to make to Eddie, first for not being available for Eddie during his time of need (when Eddie was trying to tell him about the missing book), and second because Tom actually was the one who mistakenly \"lost\" the book.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Lisa Gerritsen",
        "nm": 314761,
        "roles": [
          {
            "char": "Alice",
            "as Lisa True Gerritsen": true
          }
        ]
      },
      {
        "name": "Thomas J. Hawkins",
        "nm": 2039419,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E17",
    "title": "How Do You Know If It's Really Love?",
    "tt": 549799,
    "air_date": "1970-01-07",
    "description": "Eddie has a serious problem: he's in love, or at least he thinks he is. The object of his love is Elsie, who just moved in down the hall. He thinks the feeling is mutual since she is keeping a pair of his sneakers for good luck. But not to place pressure on himself or Elsie, Eddie asks Tom to throw him an early birthday party so that Elsie will be just one of several people there on their first \"date\". Tom, with Mrs. Livingston's assistance, agrees. Elsie is the first to arrive, and based on her actions, it does seem like she likes Eddie as much as he likes her. Things change when Richard Katkov arrives, escorting a last minute guest to the party: Margaret. Once Eddie sees Margaret, he forgets all about Elsie. Tom has a heart to heart about Eddie suddenly ignoring Elsie in favor of Margaret. Tom wants Eddie to decide what the right thing to do would be, but Eddie, in a quandary, states that if he's not old enough to have a puppy, he's not old enough to make such an important decision. At the end of the day however, Eddie goes back to Elsie, saying that love is when the object of affection doesn't have all the outward trappings of beauty, but you still think they're \"neat\". Because of Eddie's grown up behavior, Tom gets Eddie another gift: his much wanted puppy.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Max Kelly"
          }
        ]
      },
      {
        "name": "Gabie Grammer",
        "nm": 2047227,
        "roles": [
          {
            "char": "Elsie"
          }
        ]
      },
      {
        "name": "Erin Moran",
        "nm": 602844,
        "roles": [
          {
            "char": "Emily Ruth Gustafson"
          }
        ]
      },
      {
        "name": "Larry Renda",
        "nm": 2047138,
        "roles": [
          {
            "char": "Richard Katkov"
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      },
      {
        "name": "Lori Specter",
        "nm": 2046226,
        "roles": [
          {
            "char": "Margaret"
          }
        ]
      },
      {
        "name": "Richard Steele",
        "nm": 824649,
        "roles": [
          {
            "char": "Dick"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E18",
    "title": "The Road to You Know Where Is Paved with You Know What",
    "tt": 549826,
    "air_date": "1970-01-14",
    "description": "Retired school teacher, Miss Bristol, moves in down the hall from the Corbetts. The Corbetts and Miss Bristol soon become fast friends. Well meaning in her actions, she individually tells both Eddie and Tom that they spend too much time together, implying to each that perhaps the reason being that the other feels dependent upon the other, rather than the want really to spend the time together. Miss Bristol says so since she thinks that Eddie preoccupying Tom's time prevents Tom from meeting and spending time with women - potential mothers for Eddie - and Tom preoccupying Eddie's time prevents Eddie from developing meaningful friendships with children his own age. Both Tom and Eddie tell each other that they have other things to do that prevent them from spending time together, but they both are lying and end up being miserable in the process. Mrs. Livingston and Tom discover that Eddie's supposed new preoccupation is fabricated, after which Tom and Eddie have a heart to heart about what they really want, which is to spend time with each other. Tom is angry at Miss Bristol's meddling in their lives and he is going to tell her so. She appreciates Tom's candor and is happy that she was wrong about Tom and Eddie's relationship.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Ruth McDevitt",
        "nm": 567599,
        "roles": [
          {
            "char": "Miss Bristol"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E19",
    "title": "They're Either Too Young or Too Old",
    "tt": 549828,
    "air_date": "1970-01-21",
    "description": "There is a love triangle in the Corbett household. Eddie has a new babysitter, fifteen year old Glori, a recent transplant from New York. Glori is the best babysitter that Eddie has ever had, and admits to Tom that he wants to marry her since he and she think alike. Glori has great fun with Eddie as well, and even offers to babysit for free. But Glori has her romantic eyes on someone else: Tom. Eddie asks Glori to marry him, although he realizes they would have to wait, eighteen years to be precise. Glori lets Eddie down easy, saying that eighteen years is a long time to wait. She proposes another option to Eddie: instead of being Eddie's wife, she wants to be Eddie's mother, stating that way they wouldn't have to wait eighteen years for it to happen. Eddie loves the idea, but Glori swears him to secrecy. However, perceptive Mrs. Livingston tells Tom that she's pretty sure that Glori has a crush on him. Tom eventually sees it, so he implements a plan to make himself appear old and stodgy in Glori's eyes. Glori overhears Tom talking about this; she's embarrassed, but a few comforting and supportive words from Tom is all that's required to boost her self-confidence as an emerging strong, young woman.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Sherry Lynn Diamant",
        "nm": 1010987,
        "roles": [
          {
            "char": "Glori"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E20",
    "title": "The Mod Couple",
    "tt": 756840,
    "air_date": "1970-01-28",
    "description": "When Eddie tells Mrs. Livingston that she is just like a mother to him, Mrs. Livingston knows that it is time for her to leave the Corbett household for good. She doesn't want to be an obstacle for whoever the eventual Mrs. Corbett will be in the lives of either Tom or especially Eddie. So Mrs. Livingston quits immediately and tells Tom the reason. However, Tom still needs a housekeeper and Eddie still needs a caretaker. This is evident the day after, when the first disaster happens when Eddie needs to get dressed (Mrs. Livingston used to pick out his clothes), and the second when Tom tries to make breakfast. Norman comes to the rescue, first in helping Tom write a help wanted ad despite the fact that Tom has already written and submitted one to the newspaper, and second in providing advice on appropriate living and housekeeping for the modern bachelor household. Luckily for Tom and Eddie, they don't have to heed Norman's advice as the perfect housekeeper answers their ad: Mrs. Livingston. In reality, she answered Norman's penned ad.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      }
    ]
  },
  {
    "se": "S01E21",
    "title": "Guardian for Eddie",
    "tt": 549795,
    "air_date": "1970-02-04",
    "description": "Tom needs to find a suitable guardian for Eddie, just in case something happens to him. Tom and Helen's list of relatives is relatively short from which to choose. Helen's sister, Kate, is unsuitable since she is constantly traveling. Helen's parent's are too elderly. That leaves Tom's mother. Eddie doesn't really know his grandmother all that well as she lives in San Francisco, and doesn't visit all that often. So Tom thinks it's a good idea to bring his Mom to Los Angeles for a visit, although he doesn't tell her or Eddie the reason. Tom's mother is formal, stern and judgmental, she who views anyone who does not have the same values as her as a Communist. Eddie doesn't really like her as she makes him feel \"flat\". Tom ultimately doesn't believe that she would make a suitable guardian for Eddie. He next thinks that Mrs. Livingston the ideal candidate: she and Eddie mutually love each other and Mrs. Livingston would probably accept the responsibility. However Mrs. Livingston thinks that she is not the ideal person, as because Eddie and Tom have eked out a certain lifestyle, what Eddie would need is another father figure. Although reluctant since he doesn't consider himself to be either father material or stable, Norman is Tom's final choice. Since Eddie and Norman also mutually love each other and ultimately Norman would have Eddie's - and Tom's - best interest at heart, Norman accepts.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Martha Scott",
        "nm": 779549,
        "roles": [
          {
            "char": "Grandmother"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E22",
    "title": "The Promise",
    "tt": 549825,
    "air_date": "1970-02-11",
    "description": "Mrs. Livingston, who is in the United States on a visitor's visa, has been turned down in her application for a permanent resident's visa. Thus the Immigration Department plans on deporting her back to Japan. Immigration has referred her file to the Department of Employment for their assessment of Mrs. Livingston's \"exceptional abilities\" that would qualify her to stay under that proviso. Miss Harriet Ritter, in charge of Mrs. Livingtson's file, is a self-important, self-absorbed woman, who will not listen to Tom's arguments for letting Mrs. Livingston stay. She believes that Tom's sole interest in Mrs. Livingston is that of a substitute wife. When Tom strikes out with Miss Ritter, Eddie accuses Tom of lying in that he was going to get Mrs. Livingston's permanent visa. Eddie is mad and disappointed and plans on going back to Japan with Mrs. Livingston to take care of her. Finally Tom figures that what Miss Ritter needs to hear is that they love Mrs. Livingston in a caring way and not a romantic way. Eddie's expression of love and of explaining Tom and Mrs. Livingston's relationship is so innocent in its delivery, that he convinces Miss Ritter there is no impropriety between Tom and Mrs. Livingston. Mrs. Livingston will get her visa.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Meg Wyllie",
        "nm": 943816,
        "roles": [
          {
            "char": "Miss Harriet Ritter"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E23",
    "title": "A Five-Pound Monkey on His Stomach",
    "tt": 756831,
    "air_date": "1970-02-18",
    "description": "Norman wants to go on a crash diet. He has a photo shoot in three days and thinks he looks fat. So he takes sanctuary at the Corbett household for the duration, where he knows Tom and Eddie will keep him on the straight and narrow on his diet. Planning to go solely on a watermelon diet, Norman doesn't have an easy time. First he has to contend with watching Tom and Eddie eating Mrs. Livingston's delicious cooking (Japanese style, of course), and after a little while just getting plain hungry from his lack of food. The entire household helps by going for a jog with him, which makes him hungrier than ever. Norman stashes away some food which Tom finds, and Norman offers to help Mrs. Livingston with the groceries just so that he can steal some food out of the grocery bags. He even contemplates eating Eddie's goldfish. Finally, Eddie catches Norman just about ready to munch into a midnight sandwich. Eddie offers to watch him all night if need be. By the end of it all, Norman does lose five pounds, but it is the love and generosity of the Corbett household, especially by Eddie, that carries Norman through.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      }
    ]
  },
  {
    "se": "S01E24",
    "title": "Free Is a Four Letter Word",
    "tt": 549791,
    "air_date": "1970-02-25",
    "description": "The magazine has a new majority stockholder, Cynthia Drummond-Randolph, or \"Cissy\" as she is known to her friends. She's beautiful, stylish, wealthy, philanthropic, conservative and everyone at the magazine is nervous about meeting her. The only person who isn't nervous about meeting her is Norman, who has a chance encounter with this beautiful woman without knowing who she is. Norman is not exactly her type, both in a personal and professional sense, as she does not trust or understand free spirits such as him. After touring the operation, she not only recommends, but orders Tom to outsource photographic services, which in essence means firing Norman. Tom, although realizes he cannot fight her through official channels since she controls the Board of Directors and can manipulate the stockholders, does the only thing he can do to support Norman: if Norman goes, Tom goes. Eddie supports Tom's decision, but Tina and Mrs. Livingston thinks it's a mistake. Norman wants to make it easy for Tom by quitting. It seems that Cissy has won this battle as Tom decides to stay, that is until Cissy implies that the real reason for her decision is not a financial one, but a personal dislike for Norman's type. Tom again decides to quit as for him, this battle is all about freedom. Tom's direct comments to Cissy initially offend her, but she later realizes that he may be right. She herself needs to have a little more freedom in her life, and she's willing to retain the status quo at the magazine until she figures out if freedom is really all it's cracked up to be.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Tippi Hedren",
        "nm": 1335,
        "roles": [
          {
            "char": "Cissy Drummond-Randolph"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E25",
    "title": "Don't Look Now, But Your Scorpio's Rising",
    "tt": 549789,
    "air_date": "1970-03-04",
    "description": "Tina is on a new astrology kick after the magazine researches an article on such. Based on her chart, she is convinced that she cannot no longer work for Tom since their signs are the worst for each other, so she quits without warning. Tina's replacement is Maryanne Atwater, who is young, beautiful and highly efficient. She knows what Tom wants even before he does. Tom and her astrological signs are the perfect match. And after she brings Tom and Eddie their dinner on an evening she knows Mrs. Livingston is off, Eddie thinks she's \"neat-o\". However, Tom doesn't think so. Everywhere he turns, she's there, and frankly, she scares him. He does whatever he can to subtly or not so subtly ask Tina to come back, including having a session with Mrs. Livingston's I Jing sticks (which are supposed to be able to tell the future), however she refuses because of her astrological chart and because she feels inferior to Miss Atwater. Ultimately Tina does come back after Maryanne suddenly quits. Maryanne does so because she uses her secretarial positions primarily to look for a husband - she hopes that her bosses become so enamored with her efficiency that they can no longer live without her, both professionally and personally. But when she knows or feels that will not happen with her current employer, she moves on. And Tina decided to come back since she realized that she lied when she had her chart made - being a vain woman, she gave her age as two years younger than her actual age.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Yvonne Craig",
        "nm": 186051,
        "roles": [
          {
            "char": "Maryanne Atwater"
          }
        ]
      },
      {
        "name": "Hal Cooper",
        "nm": 178079,
        "roles": [
          {
            "char": "Gus",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E26",
    "title": "Money Is a Five Letter Word",
    "tt": 756837,
    "air_date": "1970-03-11",
    "description": "Tom, Mrs. Livingston, Norman and Tina all receive an envelope in the mail, each containing ten, crisp, new $100 bills. None of them know who their secret benefactor is. Beyond each having a different reaction to the money and what to do with theirs, each does want to find out who sent them the money. The only clue is that the address on the envelope was typed on a toy typewriter, just like the one Eddie has. Later at home, Tom hears Eddie typing away behind closed doors in his bedroom. Tom walks in on Eddie typing an envelope. Tom also sees a wad of money in Eddie's desk drawer. Eddie, the secret benefactor, was just about to send some more money, this time to his friends. Apparently he found the money, which came in a bank bag, and didn't tell Tom about it since Tom taught him not to tell when doing a good deed in fear of people thinking ulterior motives for doing so. Although Eddie wants to continue to be a pseudo Robin Hood, he decides to return the $10,000 to the bank after a discussion with Tom and gets a $25 reward from the bank. The day after, Eddie is upset. The kids at school called him a goody-goody and called Tom a dummy for returning the money. Eddie thinks the kids hate him. What's just as bad is that some of Tom's friends have the exact same reaction to Tom as Eddie's friends. Tom surmises that their behavior is because those people feel uncomfortable with someone who did \"the right thing\" when they themselves know deep in their heart that they should also if given the opportunity but probably wouldn't. Tom ultimately convinces Eddie that he should take into consideration that he himself, Norman, Tina and Mrs. Livingston, the most important people in is life, think he did the right thing. And Eddie made his mother in heaven proud.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E01",
    "title": "The Unbirthday Present",
    "tt": 756842,
    "air_date": "1970-09-23",
    "description": "Eddie breaks open his piggy bank - it's actually a rocket-shaped bank - as he wants to buy a \"just because I love you Dad\" or what Eddie coins an \"unbirthday\" present for Tom with his $3.04. Mrs. Livingston comes up with standard ideas like a tie or socks or after shave, but Eddie wants something more special. Norman comes up with a perfect idea: a home movie showing Eddie on a typical day. Norman can film it as he has a new sound movie camera. It's going to cost exactly $3.04! Mrs. Livingston and Tina are in on the surprise. They film the movie on a Saturday under the guise of Norman taking Eddie on an outing. The plan doesn't go as smoothly as they hope as Tom wants to come along. Norman directly but tactfully tells Tom that he's not invited. Then Tom decides to go to the office to do some work, the office being one of Norman and Eddie's filming locations. Mrs. Livingston telephones to warn the film crew, and Eddie and Norman hide just as Tom arrives. Tina tries to get Tom to go home, but when he doesn't, she at least tries to distract him from Eddie and Norman's hiding location behind the curtain. But Tom finally finds out something is going on when he sees two pairs of feet underneath the curtain hem, and takes Tina's hint to go home so as not to uncover whatever Eddie and Norman's surprise is. They finish the movie. Tom loves the movie and the \"surprise\". It's the best unbirthday present he's ever received.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E02",
    "title": "A Loaf of Bread, a Bar of Soap and a Jar of Peanut Butter",
    "tt": 549781,
    "air_date": "1970-09-30",
    "description": "Household items slowly go missing from the Corbett household. Initially unbeknownst to Tom and Mrs. Livingston, Eddie is the one taking the items because he and Joey Kelly are planning on running away to Mexico. Eddie wants to just because it would be a fun kid thing to do. Joey, on the other hand, has more pressing reasons: her father, Joe, is planning on getting remarried to a woman named Sherry Dornen, and Joey doesn't like the idea of another woman - any woman - replacing the memory of her real mother. Joe thinks that Joey is fine with the idea. Eddie, not fully understanding the concept of running away, wants to tell Tom, but Joey doesn't let him. Tom pieces things together when Eddie inadvertently implicates Joey in the missing items from the Corbett household. When Tom discusses this with Joe, Joe comes to the realization that Joey has been acting strangely, like hiding underwear and pajamas in her lunch-box, and perhaps the two are planning on running away. Tom and Joe secretly follow Eddie and Joey to Eddie's secret hiding place - a large wooden crate on an abandoned lot - and overhear Eddie and Joey's plans, and the probable reason for them wanting to run away. Tom convinces Joe to let them try and run away. But Eddie beats them to the punch by telling Tom what they're planning on doing so that Tom can help Joey. Just before Eddie and Joey are scheduled to run away, Tom talks to Joey, specifically about a real family having a mother. Joey understands and runs back into the arms of her father.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Jodie Foster",
        "nm": 149,
        "roles": [
          {
            "char": "Joey Kelly",
            "ch": 257188
          }
        ]
      },
      {
        "name": "David Ketchum",
        "nm": 450495,
        "roles": [
          {
            "char": "Joe Kelly",
            "as Dave Ketchum": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E03",
    "title": "The Important Word Is 'And'",
    "tt": 549818,
    "air_date": "1970-10-07",
    "description": "Tom and Eddie are hosting the initial meeting of their new father-son group, the Indian Pals. The sole volunteer for Indian Chief is Dr. Bob Lockwood, whose unofficial motto is, \"it's my way or the wrong way\". Tom and Eddie choose as their Indian names Big Golden Arrow and Little Golden Arrow. Unfortunately so do Dr. Lockwood and Danny Lockwood. Also unfortunately, Tom and Eddie, due to lack of time, get Tina to make their name badges, a task that was supposed to foster further the father-son bonding. Not only do they not do that, but the badges Tina makes for them would be considered more Broadway than Indian. Their next week's task is to learn a rain dance and to make a head dress. Again, due to lack of time, Tom ends up making the head dresses without Eddie, much to Eddie's dismay. When Bob Lockwood comes over and sees that Tom is making the head dresses on is own, he chastises Tom for losing the meaning of Indian Pals. Norman comes to Tom's defense, but Tom comes to the realization that Dr. Lockwood is actually right. Tom decides to set aside time when he and Eddie can finish the head dresses together.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Jonathan Daly",
        "nm": 198463,
        "roles": [
          {
            "char": "Dr. Bob Lockwood",
            "ch": 132838
          }
        ]
      },
      {
        "name": "Teddy Quinn",
        "nm": 704006,
        "roles": [
          {
            "char": "Danny Lockwood",
            "ch": 132837
          }
        ]
      }
    ]
  },
  {
    "se": "S02E04",
    "title": "I Thought, You Thought",
    "tt": 756835,
    "air_date": "1970-10-14",
    "description": "Eddie thinks Mrs. Livingston and Norman are in love with each other. He comes to this conclusion since Mrs. Livingston has been wearing new dresses when she knows Norman is coming over, she cooked a special meal when he did come over and Norman gave her a gift of love beads. Although he thinks the idea far fetched, Tom begins to think so as well and tells Norman of his and Eddie's thoughts. Norman is nervous about the idea and now nervous around Mrs. Livingston. Norman has an exploratory chat with Mrs. Livingston, after which he thinks Tom and Eddie have it all wrong - he thinks Mrs. Livingston is in love with Tom. Tom begins to think that perhaps Norman is right. On a day that Tom has to take an overnight business trip, Mrs. Livingston plans on staying overnight with Eddie, she sleeping in Tom's bed. Plans change for everyone when Norman takes Eddie for the night and the reason for Tom's trip get canceled, so eventually Tom and Mrs. Livingston spend the night together alone, innocently but nervously for Tom as he knows Mrs. Livingston, the woman he thinks is in love with him, is sleeping in his bed (Tom is sleeping in Eddie's room). The next morning, Tom thinks he better be direct with Mrs. Livingston, but before he can be, Mrs. Livingston wants to talk to Tom. She thinks that Tom is unhappy with her care-giving duties to Eddie as she has been preoccupied with thoughts of something else - someone else. That someone else is Mr. Namura, her new beau. Tom, somewhat relieved, tells Mrs. Livingston what he thought about her and him, and initially of her and Norman. Mrs. Livingston is in hysterics, as hysterical as reserved Mrs. Livingston can be.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      }
    ]
  },
  {
    "se": "S02E05",
    "title": "The Business Trip",
    "tt": 756839,
    "air_date": "1970-10-21",
    "description": "Tom and Norman need to go on a business trip to Las Vegas. Unfortunately this trip coincides with Eddie's performance as Abe Lincoln. Eddie is excited about being in the school play, and excited to have Tom, Norman and Mrs. Livingston in the audience. When Eddie finds out that Tom and Norman can't make it, Eddie is so disappointed that he no longer wants to eat his dessert, be social or be in the play, so much so he throws away his Abe Lincoln beard. Mrs. Livingston explains to Eddie that Tom needs to go to Las Vegas to operate his business, and although Eddie is still unhappy about it, he understands and stops pouting. Tom is equally as disappointed, but sees no way of getting out of this trip. When Eddie overhears Norman talking about doing some fun social activities on this supposed business trip, Eddie goes back into his pout and refuses to talk to Tom about it. To get Eddie to talk, Tom decides that he and Eddie and Norman need to have a Board meeting, to talk officially about the issue. Eddie opens up. Further to the talk that Mrs. Livingston had with Eddie, Tina is the voice of practicality on this issue. She says that it is not only business but responsibility: Eddie has the individual responsibility of being Abe Lincoln, just as Tom has the individual responsibility of attending a business meeting in Las Vegas. Again, Eddie understands, doesn't like it, but accepts reality. Tom and Norman go on their trip, and Eddie recites the Gettysburg Address - at least the first line!",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E06",
    "title": "Eddie's Will",
    "tt": 756833,
    "air_date": "1970-10-28",
    "description": "Talk of the law and a book on law from Tom's bookcase gets Eddie thinking about preparing his will. He is so intent on it that he puts off his homework which he promised to do, completion of which is necessary for him to go to a Japanese fair with Mrs. Livingston the following day. When Tom tells Mrs. Livingston about Eddie probably not being able to go to the fair and the importance of discipline of children, Mrs. Livingston tells Tom how much she really does understand despite not having a traditional family of her own. She, for the first time ever, tells Tom about her deceased husband and son, both of who died in a car accident, her son who would have turned eight years old the following day. Unbeknownst to the adults, Eddie overhears the story. Tom and Eddie come to an understanding that Eddie can stay up past his bedtime to finish his homework to allow Eddie to go to the fair, which is as much for him as it is for Mrs. Livingston. Eddie finishes his homework but also finishes his will, which he leaves for Tom in a sealed envelope while he goes to the fair with Mrs. Livingston. Tom and Norman are dying to read what Eddie wrote in his will, and finally decide that as Eddie's parent, Tom should make a copy for safekeeping. Expecting to read who got the much coveted aquarium (Tom, Norman and Mrs. Livingston all individually mentioned to Eddie that they like it the most of all Eddie's possession, but Eddie wills it to the school so that the three of them won't fight over it), Tom reads that Eddie has willed Tom, Norman and Mrs. Livingston to each other so that they will always have someone to love. Tom has probably never been more proud of his son.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      }
    ]
  },
  {
    "se": "S02E07",
    "title": "Hello, Miss Bessinger, Goodbye",
    "tt": 549798,
    "air_date": "1970-11-04",
    "description": "There is a mutual attraction between Tom and upstairs neighbor, Valerie Bessinger, but he is equally exasperated by her as well. Tom first meets her when Eddie, who is part of her experimental play group, comes back from one of her sessions with a toy bear made out of a cut up American flag. Tom is offended by that act. But Valerie wanted the children to experience the flag in a different and more meaningful way to them. Valerie is somewhat of a free spirit, philanthropic and socially political with many political connections. She also has a zest for life. Her latest cause is to have officially a reflower the earth day, a cause she has not only taken up with the Senate, but also with her play group. The children are equally excited about it. There is mutual adoration between Valerie and Eddie, and Eddie would love her to be his mother. Tom contemplates what it would be like to have Valerie as a wife and as a mother for Eddie. But he doesn't have a chance to find out as Valerie all of a sudden picks up and moves: she has received an appointment to a political position in Washington. She is leaving on her reflower the earth day, leaving the children in the lurch. Tom is angry with Valerie for disappointing the children, specifically Eddie, solely for her own interests. Although Valerie wants to maintain a relationship and friendship with Tom, Tom declines. He feels that she is, in his words, not committed but fashionable. But Tom will admit that his time with Valerie has been an experience he wouldn't have missed.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Suzanne Pleshette",
        "nm": 687189,
        "roles": [
          {
            "char": "Valerie Bessinger"
          }
        ]
      },
      {
        "name": "Patrick O'Moore",
        "nm": 641868,
        "roles": [
          {
            "char": "Senator Goldrich"
          }
        ]
      },
      {
        "name": "Natalie Masters",
        "nm": 557701,
        "roles": [
          {
            "char": "Mrs. Goldrich"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E08",
    "title": "Love Is for Sharing",
    "tt": 549802,
    "air_date": "1970-11-11",
    "description": "Tom thinks that perhaps he has created too cozy a world for Eddie, one where Tom has no one to give to but Eddie, and visa versa. Norman suggests exposing Eddie to one of the children in his homeless native Indian story, so Tom brings home Bobby Brownbear, an Apache Indian, for a visit before Bobby is permanently placed. Although Bobby breaks Eddie's new model airplane, Eddie does like Bobby, but quickly gets jealous of him when he seems to be taking Tom's attention, attention that used to be solely reserved for Eddie. Eddie needs to talk to someone about his feelings, and he turns to Norman, who assures him that his father still loves him. Tom in turn apologizes to Eddie for making Bobby out to be a \"sacred cow\" - someone who Eddie feels like he cannot say anything bad about - and assures Eddie that he can treat Bobby like any other of his friends, who he sometimes does get mad at. Eddie realizes that he will always have the love of his father, and as such, he can appreciate the friendship of Bobby, and the friendship between Tom and Bobby. He demonstrates this friendship by giving one of his favorite possessions, one that Bobby admired, to Bobby as a farewell gift.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Lee Joe Casey",
        "nm": 1821035,
        "roles": [
          {
            "char": "Bobby Brownbear",
            "as Lee Joseph Casey": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E09",
    "title": "Who Wants to Sail Down the Amazon, Anyway?",
    "tt": 549837,
    "air_date": "1970-11-18",
    "description": "Eddie's globe trotting grandfather wants to take him on a trip down the Amazon, but Tom is not sure if he will let him go.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Will Geer",
        "nm": 2095,
        "roles": [
          {
            "char": "Harry I. Madison"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E10",
    "title": "When the Shoe Is on the Other Foot, It Doesn't Fit",
    "tt": 549835,
    "air_date": "1970-11-25",
    "description": "Tom encounters Cynthia Kurland of the Female Freedom Foundation, a women's liberation organization. An extremist, Cynthia is bold, forthright, direct, pushy, and also very beautiful. Compliments and pampering she sees as condescension. Cynthia wants Tom to do a story on women's lib for the magazine, which he considers. Mutually attracted to each other, they decide to mix business and pleasure, with Cynthia taking on the traditionally male role of paying for checks, pulling out seats, opening doors and sending gifts. Tom doesn't mind the role reversal, but admittedly he does feel slightly nervous around Cynthia as he doesn't quite enjoy the role reversal concerning the sexual aggression. Ultimately, Tom gets turned off by Cynthia's game playing, as he doesn't know what is real is what is a game. He convinces her that perhaps she takes the games too far and that men and women are not equal in every sense: they may be equal but they're also different, and she must understand those differences.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Lori Saunders",
        "nm": 766883,
        "roles": [
          {
            "char": "Cynthia Kurland"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E11",
    "title": "The Secret Box",
    "tt": 549827,
    "air_date": "1970-12-02",
    "description": "Elsie, Eddie's friend from the building, has sneaked into his room looking for refuge. She asks Eddie not to tell anyone she's there, and to be helpful to his friend, he tries to keep everyone out of his room to protect Elsie's sanctuary. Eddie figures that Elsie needs help, so with some hints, Eddie infers to Tom that Elsie is hiding in his room. After Tom talks to her, she tells him the reason for her running away: she found out that she's adopted, and her parents do not yet know that she knows. She found out by prying open her father's \"secret box\" where he keeps all his important papers. Elsie puts it into Eddie's head that perhaps he too is adopted and that Tom is hiding such information in his own secret box. Tom indeed does have a secret locked box in his desk. Elsie preys on Eddie's fears and convinces him to break into the box. Mrs. Livingston catches Eddie and Elsie in the act. Eddie and Tom ultimately have a discussion about what is hiding in his secret box. To be open to his son, Tom tells Eddie where the key is as well as what is in the box: a bunch of run of the mill papers such as insurance, but also what Tom calls his life miracles. The latter includes his marriage certificate, a wedding photo, and Eddie's birth certificate. Adopted or not, Eddie and Elsie understand that their respective parents love them. Eddie tells Tom that he too has a secret box, and because of Tom's openness, Eddie no longer wants to keep his a secret. Included within Eddie's box is an old discarded possession of Tom's. Seeing this, Tom thinks it's time for Eddie to have a personal possession of his mother's to keep in his secret box: a chain and locket.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Gabie Grammer",
        "nm": 2047227,
        "roles": [
          {
            "char": "Elsie"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E12",
    "title": "Fear Is for Understanding",
    "tt": 756834,
    "air_date": "1970-12-16",
    "description": "During the middle of the night, Mrs. Livingston swears that she saw a ghost in Eddie's room. Tom thinks she just had a bad dream, but does attribute his and her difference in opinion on their respective cultures. Mrs. Livingston tells Eddie of a mythical creature called Baku, which is an eater of dreams. Eddie draws one for her to eat her bad dream. Despite Baku, Mrs. Livingston sees the ghost again in Eddie's room the next time she stays overnight. Since Tom is convinced there is a logical explanation for what Mrs. Livingston saw, Norman suggests they have a ghost hunt. Tensions mount as they all await the arrival of Mrs. Livingston's ghost. Suddenly it appears, and Eddie, Tina and Mrs. Livingston in particular are scared. However it is just the moonlight reflecting through Eddie's aquarium fish. Although Mrs. Livingston is relieved, she secretly is still not totally convinced that there are no ghosts. But this experience teaches Eddie that the longer you take a look at something, including ghosts, the less scary it becomes.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E13",
    "title": "Gifts Are for Giving",
    "tt": 549794,
    "air_date": "1970-12-23",
    "description": "Norman is over at the Corbett household one evening, and is feeling especially grateful for not only the hospitality but the dear friendship of Tom, Eddie and Mrs. Livingston. To show his appreciation, Norman gives Tom an irreplaceable medallion he always wears on a chain around his neck. Tom is overwhelmed by Norman's act of kindness, that of a gift Norman obviously treasures. That weekend, Joey Kelly stays with the Corbetts as her father, Joe, needs to be out of town. Eddie's not too happy as it postpones a camping trip he and Tom were going to take, and more importantly, Eddie and Joey are currently on the outs as friends. Despite that, Eddie is a very gracious host to Joey. Because Tom is proud of the way his son is acting, he gives to Eddie Norman's medallion. Eddie is so excited by the meaning of the gift. The next morning, Eddie inadvertently insults an act of graciousness from Joey, which makes her cry. Eddie apologizes, and as a gift to show how sorry he really is, he gives her Norman's medallion. Like Eddie was, Joey is excited by the meaning of the gift. Joey in turn gives the medallion to her father as a 'just because I love and missed you' present. Later, Joe comes back by the Corbetts to talk to Mrs. Livingston. He wants to show his appreciation for the motherly influence she had on Joey during her stay, and gives her a gift of Norman's medallion. And finally, Mrs. Livingston gives the medallion back to Norman as a gift. She will treasure the meaning of Joe's gift to her, but she wants Norman to have it back both because she misses seeing him wear it, but more importantly he was the one who started the gift of giving. Norman is touched - it's the best present he's ever received in more ways than one. In Tom's estimation, this gift giving was the perfect circle.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Jodie Foster",
        "nm": 149,
        "roles": [
          {
            "char": "Joey Kelly",
            "ch": 257188
          }
        ]
      },
      {
        "name": "David Ketchum",
        "nm": 450495,
        "roles": [
          {
            "char": "Joe Kelly",
            "as Dave Ketchum": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E14",
    "title": "A Little Get Together for Cissy",
    "tt": 549778,
    "air_date": "1971-01-06",
    "description": "Cissy Drummond-Randolph, the Chairman of the Board at the magazine, has come back from her soul searching trip in the rain-forest, where she went to learn how \"to get her hair wet\". Despite the fact that Tina is still in nervous awe of her, Cissy did come back a changed woman. She reconciles with Norman as she too is now more of a free soul than she used to be. And she asks Tom to move to New York to work directly with her. Tom thinks she has ulterior motives of a personal nature: he thinks she's after him as a husband. She admits as much to Norman, who in turn tells Tom. Tom in turn tells her that he thinks her interest in him is solely due to the fact that he was the one who initiated her life change, and thus she is misinterpreting her feelings for her new life as love for him. She is as gracious in rejection as Tom was in the rejecting.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Tippi Hedren",
        "nm": 1335,
        "roles": [
          {
            "char": "Cissy Drummond-Randolph"
          }
        ]
      },
      {
        "name": "John Fiedler",
        "nm": 275835,
        "roles": [
          {
            "char": "The Mild Man"
          }
        ]
      },
      {
        "name": "Ivor Barry",
        "nm": 58019,
        "roles": [
          {
            "char": "The Englishman"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Dennis Fimple",
        "nm": 277344,
        "roles": [
          {
            "char": "Man at party talking to The Englishman",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E15",
    "title": "The Ghetto Girl",
    "tt": 549816,
    "air_date": "1971-01-13",
    "description": "Tom and Norman are doing a story on the ghetto for the magazine. To put their money where their mouths are, Norman hires a girl from Helping Hand Incorporated, an organization that places former juvenile delinquents in jobs. Tom isn't sure about this idea, only because it is a busy time at the magazine. The person they get is Angustia Ferrero, Gus for short. Gus is tough, mouthy, sarcastic, suspicious of establishment and basically mad at the world for her lot in life. She first meets Tom while he is doing some filing. Without knowing who he is, and she mouths off about what a hypocritical bigwig \"Tom Corbett\" is. She next meets Eddie not knowing who he is, and although she initially likes him, she dismisses him once she finds out he's the boss' son. This act hurts Eddie. Despite how she treated Eddie and how she made Eddie feel, Tom feels like he needs to reach out to her to show her that there are people in the world not out to get her, or else others down the line will be hurt by her. When he reveals himself to her as Tom Corbett, he apologizes for the initial non-disclosure of who he was/is. She's mad; her view of the bad of \"the system\" is strengthened. Without knowing her angered state, Norman has her make an urgent and important delivery. She goes missing. They find her, having thrown the delivery in the garbage. Tom immediately fires her, but explains to her that he is firing her because of what she did, not because of who she is. Still mad, Gus runs into Eddie, who has come to the office to, in the words of Tom, share himself with her by showing her something important in his life, namely a necklace that belonged to his mother. This act of kindness shows Gus that her anger toward everyone at the magazine and at Eddie was unfounded. She goes back to Tom with an attitude of truly wanting forgiveness and her job back. Tom agrees, but with the understanding that he will not hesitate to fire her again if she doesn't do her job. She now understands herself.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E16",
    "title": "The Hospital",
    "tt": 549817,
    "air_date": "1971-01-20",
    "description": "The insurance company sends Tom and Norman to the hospital for a couple of days of routine tests. Despite reassurances from his father Eddie is worried that something is wrong with him.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Andrew Prine",
        "nm": 697785,
        "roles": [
          {
            "char": "Dr. Hal 'Speed' Gould"
          }
        ]
      },
      {
        "name": "Barbara Clarke Chisolm",
        "nm": 1553457,
        "roles": [
          {
            "char": "Female Technician",
            "as Barbara Clarke Chisholm": true
          }
        ]
      },
      {
        "name": "Catherine Ferrar",
        "nm": 273940,
        "roles": [
          {
            "char": "Miss Fern"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E17",
    "title": "The Rift",
    "tt": 756841,
    "air_date": "1971-01-27",
    "description": "Although he really wants one, Eddie is OK when Tom won't buy him a horse. However when Tom refuses to let Eddie have a horse purchased by Norman, Eddie is mad. Norman and Tina figured they would do this good Samaritan gesture since Tom said that he wouldn't buy one due to cost, whereas Norman, a bachelor, can since he has no one to spend his money on. However, the expense is only one and least important in a long line of reasons why Tom won't buy Eddie a horse, the biggest reason being that Eddie is not yet old enough for the responsibility. Eddie is so mad, that he doesn't want to do anything with Tom anymore, and he also doesn't want Tom to use their favorite pet name for each other, \"Sport\", anymore. Tom allows Eddie to vent his anger since he wants to let Eddie know that first it's all right to express anger, and second that Eddie need not spend every waking moment of life with Tom. After Norman replaces Tom on an outing with Eddie, Eddie comes to a better understanding of his feelings of brief anger and of overwhelming love for his father, and that they need not be mutually exclusive feelings.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Hal Cooper",
        "nm": 178079,
        "roles": [
          {
            "char": "Gus",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E18",
    "title": "The Encounter Group",
    "tt": 549815,
    "air_date": "1971-02-03",
    "description": "Tina and Norman are dating again. Tina's encounter group thinks that Tina and Norman need an impartial but close third party to evaluate their relationship, that neutral party being Tom. So they hold one of the encounter group meetings at Tom's apartment. After meeting Tom and hearing about his and Tina's relationship, the group thinks that the problem with Tina and Norman's relationship is that Norman has an inferiority complex to and rivalry with Tom for Tina's affections. What's more, they think Tina is really in love with Tom. These statements are making Norman and Tom uncomfortable with each other and with Tina, this feeling flowing over into work. Tina, however, just wants to let the information sink into her psyche. She begins to think that the idea of her and \"Mr. Corbett\" not such a wild idea. Tom feels he needs to nip this idea of Tina's in the bud and agrees to have another encounter group meeting at his place. He tells the group, including Tina and Norman, that he thinks he and Tina should fly to Las Vegas immediately and elope. This declaration freaks Tina out, and she declines. The group reevaluates the situation and come to the conclusion that Tina is fickle and is not in love with either Tom or Norman, but rather is in love with the thought of love. Tom and Tina and Norman's relationships go back to the way they originally were.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Pat Delaney",
        "nm": 216327,
        "roles": [
          {
            "char": "Harriet"
          }
        ]
      },
      {
        "name": "Rosemary Edelman",
        "nm": 249001,
        "roles": [
          {
            "char": "Carol Fleischman"
          }
        ]
      },
      {
        "name": "Lew Horn",
        "nm": 394875,
        "roles": [
          {
            "char": "Bob Fleischman"
          }
        ]
      },
      {
        "name": "Ed Hall",
        "nm": 355532,
        "roles": [
          {
            "char": "Ted Wilson"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Hal Cooper",
        "nm": 178079,
        "roles": [
          {
            "char": "Gus",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E19",
    "title": "Dear Mr. Cooper aka Eddie Meets an Astronaut",
    "tt": 549788,
    "air_date": "1971-02-10",
    "description": "Eddie receives a telegram from astronaut, Colonel Leroy Gordon Cooper. Cooper is responding positively to an invitation from Eddie to come to the Corbett household to have a quiet lunch, away from the media spotlight. Tom is a little skeptical that the telegram is really from Cooper - he thinks one of Eddie's friends is playing a joke. But it ends up really being from Cooper. Tom, despite being in the media business, does not want to capitalize on Eddie's quiet lunch, and thus decides not to do a story on it for the magazine. However, one of Eddie's classmates, Sammy Weston, has a father in television and he wants to film the lunch. Tom lets Eddie make up his own mind, and Eddie says no. Weston counter offers with the filmed luncheon being shown as a segment on a network show with an appearance fee paid to Eddie of $1,000. Eddie still says no. Weston yet counter offers with a $2,000 donation to Eddie's favorite charity. This time, Tom, offended by the offer, says no on behalf of Eddie. The story of the $2,000 gets back to Eddie and his schoolmates via Sammy, who thinks Tom and Eddie are being mean and selfish, not only for not allowing the camera crews and Eddie's friends to attend the lunch, but for denying a charity, $2,000. Tom and Mrs. Livingston explain to Eddie that the money was just a buy off in the name of altruism. Eddie and Cooper end up having their nice, quiet lunch, just the way both of them wanted and intended.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Gordon Cooper",
        "nm": 178070,
        "roles": [
          {
            "char": "Himself",
            "as Colonel Leroy Gordon Cooper": true
          }
        ]
      },
      {
        "name": "Bill Fiore",
        "nm": 278446,
        "roles": [
          {
            "char": "Mr. Weston"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E20",
    "title": "The Lonely Weekend",
    "tt": 549823,
    "air_date": "1971-02-17",
    "description": "Tom uses the fact of Eddie going to camp to have a romantic weekend with his girlfriend, Brenda. Tom however does not anticipate the continual distractions. First, a work emergency occurs. Since it looks like it will take a long time to resolve, Brenda decides to go home and wait for Tom to finish. She's right as Tom needs to pull an all nighter. Once Tom finishes his work duties and gets some sleep, second, Mrs. Livingston decides to come in for the weekend to clean up the kitchen. As soon as Tom politely sends Mrs. Livingston home, third, Joey Kelly shows up on Tom's doorstep. Joey's father, Joe, and his girlfriend Sherry went to Las Vegas for the weekend and assumed that Joey would stay with the Corbetts during their absence. When Joey called Eddie earlier on to ask, she didn't ask Eddie since Eddie wasn't going to be around. But rather than stay with a sitter, Joey wanted to stay with Tom since she was upset about her father and Sherry probably going to elope without telling her. Since Joe and Sherry were driving to Vegas, Tom has no way of getting in touch with them, and thus Tom has no other choice than to keep Joey for the weekend. When Tom calls Brenda with this latest news, ever gracious Brenda is no longer gracious and hangs up on Tom. Later, Sherry comes by to pick up Joey - she and Joe decided that in Joey's fragile state of mind, it better to take her along. Just then, Brenda drops by in a mood of forgiveness, until she sees Sherry, who she assumes is a fling of Tom's. After clearing up the confusion, Tom finally has his romantic, albeit shortened weekend with Brenda. It ends up being even shorter when Eddie arrives home unexpectedly early.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Brenda Benet",
        "nm": 70935,
        "roles": [
          {
            "char": "Brenda",
            "as Brenda Bent": true
          }
        ]
      },
      {
        "name": "Jodie Foster",
        "nm": 149,
        "roles": [
          {
            "char": "Joey Kelly",
            "ch": 257188
          }
        ]
      },
      {
        "name": "Claire Brennen",
        "nm": 107268,
        "roles": [
          {
            "char": "Sherry Barnes"
          }
        ]
      },
      {
        "name": "Robert Burton",
        "nm": 123701,
        "roles": [
          {
            "char": "Brian Frisbee",
            "as Skip Burton": true
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E21",
    "title": "The Magic Mrs. Rickles",
    "tt": 549824,
    "air_date": "1971-03-03",
    "description": "Tina's mother is visiting from Sioux City. She believes in spiritualism and mysticism and possesses many charms and crystals, their magical powers in which she believes. Rational Tom isn't superstitious, but Mrs. Rickles wants to prove to Eddie that her beliefs are not bunk as Tom would have him believe. As such, she gives Eddie a special charm that she says will grant Eddie's deepest wishes. Tom is angry as he would rather have Eddie work at achieving his wishes rather than place faith in a magic charm. Eddie gets his wish - an A in his spelling test - and believes in the power of the charm. To prove to Tom the power of the charm, Eddie asks for his biggest wish: a mother. Just then, Miss Huffman, an unmarried new substitute teacher comes by, who to Eddie looks to be a potential mother type. When Eddie finds out she's engaged, he thinks he didn't wish properly. Finally, Tom directly but kindly tells Mrs. Rickles that he wished that she didn't impose her beliefs on Eddie. She is apologetic, but through a further gift to Eddie and an accomplishment of Tom's, she makes Tom realize that wishes are not magic but rather a combination of imagery plus will.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Lisa Kirk",
        "nm": 456514,
        "roles": [
          {
            "char": "Mrs. Rickles"
          }
        ]
      },
      {
        "name": "Jodie Foster",
        "nm": 149,
        "roles": [
          {
            "char": "Joey Kelly",
            "ch": 257188
          }
        ]
      },
      {
        "name": "Chris Woodley",
        "nm": 940345,
        "roles": [
          {
            "char": "Miss Huffman"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S02E22",
    "title": "To Catch a Thief",
    "tt": 549831,
    "air_date": "1971-03-10",
    "description": "Things go missing from the Corbett household: Tom's belt, his gold cuff-links and Mrs. Livingston's kitchen timer. Eddie admits that he took them, as he is somewhat proud to announce that he has joined a gang, led by older kid Mark, of whom Eddie is in awe. Mark dictates to the gang of younger kids that they steal things from stores, but since Eddie was uncomfortable doing that, he decided to take things from home, telling the other kids that he stole them from stores. Tom is obviously upset with Eddie's conduct, explaining that stealing is an illegal act and is morally wrong. Tom tells Eddie that he is responsible for those items taken, meaning that he either has to get them back or else pay for them out of his allowance. When Eddie tells Mark he won't steal anymore, Mark kicks him out of the gang, but not before Eddie becomes the victim of theft himself at the hands of Mark, namely Eddie's major school project which Mark turns in as his own. Because he was punished at school for failing to turn in his project, Eddie stands up to Mark, putting him down front of the others and retrieving those items he stole from Tom and Mrs. Livingston. But Eddie finds out who his true friends are, when the other kids in the gang also dump Mark and return to being friends with Eddie.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Willie Aames",
        "nm": 714,
        "roles": [
          {
            "char": "Scott"
          }
        ]
      },
      {
        "name": "Vincent Van Patten",
        "nm": 887701,
        "roles": [
          {
            "char": "Mark"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E23",
    "title": "Everybody Needs a Brother",
    "tt": 549790,
    "air_date": "1971-03-17",
    "description": "Eddie wants a brother. After Tom tells Eddie how long it took for him to come along after he first met Helen, Eddie is despondent as it's going to take a long time for his brother to materialize and Tom will be really old by then. Tom is worried by Eddie's fixation, especially after Eddie makes up an imaginary brother playmate, \"Tommy\". Tom does not approve of Tommy because it masks the reality of not really having what Eddie wants. Eddie decides to take matters into his own hands and negotiates with his friend Steve, of who Eddie is jealous since Steve has four brothers and another one on the way. Eddie trades some of his possessions, including his aquarium, for Steve's yet unborn baby sibling. Tom obviously stops the negotiations and has a chat with Eddie about the realities of having another child. Tom, who really would like to get married again and have another child, thinks an ideal solution would be for Eddie to \"adopt\" a needy child through the Concerned Parent's Plan.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Mark Antony Van der Nagel",
        "nm": 886373,
        "roles": [
          {
            "char": "Jerry Riley"
          }
        ]
      },
      {
        "name": "Brandon Williams",
        "nm": 2178143,
        "roles": [
          {
            "char": "Steve Riley"
          }
        ]
      },
      {
        "name": "Jeff Williams",
        "nm": 930877,
        "roles": [
          {
            "char": "Mike Riley"
          }
        ]
      },
      {
        "name": "Tiger Williams",
        "nm": 931805,
        "roles": [
          {
            "char": "Lester Riley"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E24",
    "title": "Discipline Is a Four Letter Word Spelled Love",
    "tt": 756832,
    "air_date": "1971-03-24",
    "description": "Tom gets Eddie a chemistry set as a gift. Mrs. Livingston wants Eddie only to play with it in the bathroom just in case he spills some chemicals on the carpet, this suggestion supported by Tom. Mrs. Livingston catches Eddie playing with it in his bedroom, at which she kindly reminds him to take things immediately into the bathroom. Not heeding the warning, Eddie immediately spills a dark blue tinted chemical onto his bedroom carpet. Eddie, trying to hide the accident, only makes things worse as the blue gets onto his shoes, tramped to other areas of the carpet, onto his shirt, onto a towel, and onto the bedspread. Eddie can't hide the visible manifestations of his accident from Mrs. Livingston. Ultimately, Tom reminds Eddie of the deal they made regarding responsibility, and the consequence of losing whatever the cause of failed responsibility. However, this one time, Tom decides to bend the deal, and lets Eddie keep the chemistry set. Although she doesn't say anything and supports Tom's parental decisions concerning Eddie, Mrs. Livingston is really as upset with Tom as she is with Eddie for Tom's leniency with Eddie in the situation. It isn't until Tom directly asks Mrs. Livingston of her thoughts regarding his decision with the chemistry set that Mrs. Livingston speaks her mind, albeit in her typically reserved Japanese way. For her, it is not a matter of a ruined carpet, but rather really of teaching Eddie what it means to be responsible and the role of discipline. Tom still thinks he made the right decision and attributes Mrs. Livingston's attitude partly to a woman's more emotional and sensitive nature. Both Tom and Eddie notice Mrs. Livingston's standoffish behavior following the incident and Eddie in particular tries to do whatever he can to make Mrs. Livingston \"smile again\". Another incident occurs later when Eddie hears a parade outside, and wanting to get a better look, climbs on top of the balcony railing. Seeing this, Mrs. Livingston grabs Eddie and sternly chastises him. Eddie, feeling physically hurt, runs to Tom, who just arrives home after the incident, for support against Mrs. Livingston's action toward him. This time, Tom supports Mrs. Livingston's actions, but only gives Eddie a stern warning without any real consequence. Tom figures Eddie has learned his lesson, however Mrs. Livingston, the witness to Eddie's action, doesn't think Tom really understands the severity of what Eddie did. It isn't until Tom later sees a similar incident - Eddie climbs over the balcony railing trying to retrieve his kite - that Tom takes more direct action: he grabs Eddie off the railing, gives him a quick spanking and a more concerned and hysterical talking to. Because of the spanking, Eddie says Tom is not only no longer his friend, but he doesn't love Tom anymore. Tom finally admits to Mrs. Livingston, who caught the tail end of Eddie's second time on the balcony railing, that he has never been as scared in his entire life, and that Eddie probably wouldn't have climbed onto the railing the second time if he was stricter with Eddie from the get go. The supportive Mrs. Livingston tells Tom that Eddie still loves him despite his words and despite Tom's discipline, which is indeed the case.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      }
    ]
  },
  {
    "se": "S03E01",
    "title": "My Son, the Artist",
    "tt": 549805,
    "air_date": "1971-09-15",
    "description": "Tom is taking an art class,sketching nude models. Eddie decides to try the same thing with his new friend,a neighbor girl.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Angus Duncan",
        "nm": 241899,
        "roles": [
          {
            "char": "John Buckner"
          }
        ]
      },
      {
        "name": "Patti Cohoon-Friedman",
        "nm": 128739,
        "roles": [
          {
            "char": "Gretchen Buckner",
            "as Patti Cohoon": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E02",
    "title": "The Candidate",
    "tt": 549812,
    "air_date": "1971-09-22",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Kirk Mee",
        "nm": 575996,
        "roles": [
          {
            "char": "Mr. Taggart"
          }
        ]
      },
      {
        "name": "Virginia Hawkins",
        "nm": 370248,
        "roles": [
          {
            "char": "Mrs. Kensington"
          }
        ]
      },
      {
        "name": "Allen Joseph",
        "nm": 430543,
        "roles": [
          {
            "char": "Mr. Wertz"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E03",
    "title": "Getting Back on the Horse",
    "tt": 549793,
    "air_date": "1971-09-29",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Richard X. Slattery",
        "nm": 805490,
        "roles": [
          {
            "char": "Xander Malloy"
          }
        ]
      },
      {
        "name": "Robbie MacDonald",
        "nm": 2090785,
        "roles": [
          {
            "char": "Claude"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E04",
    "title": "Tell It Like I'm Telling You It Is",
    "tt": 549809,
    "air_date": "1971-10-06",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Lou Jacobi",
        "nm": 414279,
        "roles": [
          {
            "char": "Frank Hausman"
          }
        ]
      },
      {
        "name": "Alan Oppenheimer",
        "nm": 649178,
        "roles": [
          {
            "char": "Sy Freeman"
          }
        ]
      },
      {
        "name": "Frank Corsentino",
        "nm": 181088,
        "roles": [
          {
            "char": "Marvin Flair"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E05",
    "title": "A Very Different Drummer",
    "tt": 549783,
    "air_date": "1971-10-13",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Ned York",
        "nm": 948747,
        "roles": [
          {
            "char": "Alex"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E06",
    "title": "The Bicycle Theft",
    "tt": 549810,
    "air_date": "1971-10-20",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Bruce Kirby",
        "nm": 116483,
        "roles": [
          {
            "char": "Officer Gifford"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E07",
    "title": "Two's Company",
    "tt": 549832,
    "air_date": "1971-10-27",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Ronny Graham",
        "nm": 334283,
        "roles": [
          {
            "char": "Burgess 'Buzz' Carew"
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Madlyn Rhue",
        "nm": 722599,
        "roles": [
          {
            "char": "Dolores Carew"
          }
        ]
      },
      {
        "name": "Jason Karpf",
        "nm": 1553659,
        "roles": [
          {
            "char": "(1971)"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E08",
    "title": "Happy Birthday to You",
    "tt": 549797,
    "air_date": "1971-11-03",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Ned York",
        "nm": 948747,
        "roles": [
          {
            "char": "Alex"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E09",
    "title": "Or Else",
    "tt": 756838,
    "air_date": "1971-11-10",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      }
    ]
  },
  {
    "se": "S03E10",
    "title": "Thy Neighbor Loves Thee",
    "tt": 549829,
    "air_date": "1971-11-17",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Jerry Stiller",
        "nm": 5467,
        "roles": [
          {
            "char": "Paul Sterling"
          }
        ]
      },
      {
        "name": "Anne Meara",
        "nm": 575198,
        "roles": [
          {
            "char": "Bunny Sterling"
          }
        ]
      },
      {
        "name": "Allan Drake",
        "nm": 236849,
        "roles": [
          {
            "char": "Prescott"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E11",
    "title": "A Little Red",
    "tt": 549780,
    "air_date": "1971-12-01",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Carol Lawrence",
        "nm": 492655,
        "roles": [
          {
            "char": "Irena Kosnova"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E12",
    "title": "A Brave at Natchanoomi",
    "tt": 549777,
    "air_date": "1971-12-08",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Vic Tayback",
        "nm": 851861,
        "roles": [
          {
            "char": "Bernie"
          }
        ]
      },
      {
        "name": "Brett Swanson",
        "nm": 1675509,
        "roles": [
          {
            "char": "Herman"
          }
        ]
      },
      {
        "name": "R.J. O'Hara",
        "nm": 1478730,
        "roles": [
          {
            "char": "Herman's Father"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E13",
    "title": "The Blarney Stone",
    "tt": 549811,
    "air_date": "1971-12-15",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Sally Struthers",
        "nm": 1783,
        "roles": [
          {
            "char": "Katie O'Hara"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E14",
    "title": "Prince Charming",
    "tt": 549807,
    "air_date": "1971-12-29",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Geoffrey Thorpe",
        "nm": 1928865,
        "roles": [
          {
            "char": "Harold"
          }
        ]
      },
      {
        "name": "Joey Douglas",
        "nm": 1496183,
        "roles": [
          {
            "char": "Paul"
          }
        ]
      },
      {
        "name": "Linda Marie",
        "nm": 547272,
        "roles": [
          {
            "char": "Debbie"
          }
        ]
      },
      {
        "name": "Gabie Grammer",
        "nm": 2047227,
        "roles": [
          {
            "char": "Elsie"
          }
        ]
      },
      {
        "name": "Heather Harrison",
        "nm": 1896316,
        "roles": [
          {
            "char": "Sandra"
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Max Kelly"
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      },
      {
        "name": "Aldine King",
        "nm": 454423,
        "roles": [
          {
            "char": "Mrs. Pick"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E15",
    "title": "The Choice",
    "tt": 549813,
    "air_date": "1972-01-05",
    "description": "Tom starts dating Eddie's substitute pediatrician, Dr. Liz Park. Before things get too serious between the two of them, Liz tells Tom that she is going to Switzerland for three years to study. Although they are very attracted to each other, Switzerland is an obvious obstacle, but they decide to keep dating regardless until she leaves. But because of Tom and their time together, Liz decides not to go to Switzerland. However, after their date, Tom and Liz return back to the apartment to find that Eddie has developed a high fever, for which Liz, in her doctor role, treats. This act makes her realize that pediatric surgery, her chosen field of study in Switzerland, really is her true calling; she has to go.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Carmelita Mann",
        "nm": 2102100,
        "roles": [
          {
            "char": "Mrs. Cherry"
          }
        ]
      },
      {
        "name": "Trisha Noble",
        "nm": 633682,
        "roles": [
          {
            "char": "Dr. Liz Park"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E16",
    "title": "The Karate Story",
    "tt": 549820,
    "air_date": "1972-01-12",
    "description": "Eddie and Tom, in an effort to do more father-son activities together, decide to take karate lessons. In addition, both will get some physical activity. The choice of activity is in no means to show an act of aggression or as self protection. However it may as well be as once Eddie's friends at school find out his new activity, resident tough guy Harold O'Brien, an older fifth grader, picks fights with Eddie just to show that Eddie taking karate does not affect the tough guy pecking order. Harold doesn't listen to reason nor does Eddie fight back since he does not yet have the karate skills to do so, so Tom is forced to go talk to Harold's father. Mr. O'Brien, like his son, believes that physical brawn is the sign of a man. Mr. O'Brien does not condone his son's fighting, but he believes that the kids should work it out themselves. Things between the boys change when Eddie hits back and knocks Harold down. True to his word, Mr. O'Brien tells his son to work it out himself. The fighting now stops since Harold doesn't like receiving the medicine he's been dishing out.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Willie Aames",
        "nm": 714,
        "roles": [
          {
            "char": "Harold O'Brien",
            "ch": 402684
          }
        ]
      },
      {
        "name": "Hal Baylor",
        "nm": 63113,
        "roles": [
          {
            "char": "Mr. O'Brien",
            "ch": 158518
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Max Kelly"
          }
        ]
      },
      {
        "name": "Joey Douglas",
        "nm": 1496183,
        "roles": [
          {
            "char": "Jay"
          }
        ]
      },
      {
        "name": "Ed Parker",
        "nm": 662021,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Bill M. Ryusaki",
        "nm": 753492,
        "roles": [
          {
            "char": "Bill - Karate Instructor",
            "as Bill Ryusaki": true
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      }
    ]
  },
  {
    "se": "S03E17",
    "title": "Very Young Man with a Horn",
    "tt": 549833,
    "air_date": "1972-01-19",
    "description": "Eddie has decided to learn the saxophone. With a borrowed instrument and free lessons at school, Tom is encouraged that his son is showing an interest in music. After three days, Eddie's talent is still lacking, but the household endures to encourage Eddie. However, upstairs neighbor, Major Pritchett, is not so understanding. Not willing to compromise, Major Pritchett demands that Eddie cease and desist from ever playing the saxophone again. After speaking to the major, Tom is outraged. The major has declared war, and one of his tactics is to stomp continually on his floor and play his bagpipes at two o'clock in the morning. As neither side gives in, the major, with other neighbors on his side, organizes a tenant's meeting to discuss the issue. After consulting his lawyer Sy Freeman who advises him to come to terms with the major, Tom welcomes the opportunity to address the tenants. After making his point and outing Major Pritchett as the bagpipe player, Tom informs the tenants that Eddie has decided to stop playing the saxophone since he has decided he doesn't like it. The major thinks he's won the battle, but apparently he has not won the war. The major gets a talking to from his next door neighbor, Lorraine Karn, who objects to the continual squawking of his birds. And another neighbor, Mr. Hobson, was so buoyed by Tom's speech that he has decided to bring out his drum set.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Ivor Barry",
        "nm": 58019,
        "roles": [
          {
            "char": "Major Pritchett"
          }
        ]
      },
      {
        "name": "Larry Delaney",
        "nm": 216310,
        "roles": [
          {
            "char": "Mr. Lindley",
            "as Laurence Delaney": true
          }
        ]
      },
      {
        "name": "Allan Drake",
        "nm": 236849,
        "roles": [
          {
            "char": "Mr. Prescott"
          }
        ]
      },
      {
        "name": "Eve McVeagh",
        "nm": 574670,
        "roles": [
          {
            "char": "Lorraine Karn"
          }
        ]
      },
      {
        "name": "Alan Oppenheimer",
        "nm": 649178,
        "roles": [
          {
            "char": "Sy Freeman"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E18",
    "title": "The Investors",
    "tt": 549819,
    "air_date": "1972-01-26",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Hal Cooper",
        "nm": 178079,
        "roles": [
          {
            "char": "Gus"
          }
        ]
      },
      {
        "name": "Martha Salcido",
        "nm": 2055115,
        "roles": [
          {
            "char": "Hostess",
            "as Marta Salcido": true
          }
        ]
      },
      {
        "name": "Janene Forsyth",
        "nm": 2473434,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E19",
    "title": "It's All Write with Me",
    "tt": 549801,
    "air_date": "1972-02-02",
    "description": "Renowned inspirational writer Peter Stowe is an old friend of Tom's from their college days. Peter has agreed to write an article for the magazine, but really only did so to catch up with Tom. With Peter comes an old manuscript of a half completed novel that Tom wrote in college. Tom initially wants to put that ancient history, as he calls it, behind him, but Peter convinces him that perhaps he should resume writing that novel. Tom manages to shut out as much extraneous activity around him so that he can write, but he doesn't know if he wants to do that to Eddie or if it is fair to Eddie. Finally as Peter completes the article, Tom completes his understanding of why he didn't complete the novel in the first place and why he doesn't want to write it now: he found other things in life more important to him, which now includes his life with Eddie.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Pat Harrington Jr.",
        "nm": 364224,
        "roles": [
          {
            "char": "Peter Stowe"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E20",
    "title": "A Little Help from My Friend",
    "tt": 549779,
    "air_date": "1972-02-09",
    "description": "Because Mrs. Livingston has the flu, Tom asks Norman to sit for Eddie over the weekend while Tom is away on a last minute business trip to Sacramento. Also staying with Norman and Eddie at the Corbett household is Norman's bachelor friend, Rodney River, Jr. Tom wants to make sure that Rodney is not a carousing playboy bachelor, which Norman assures him Rodney's not. In actuality, Rodney is an actuary, whose professional life spills into his personal beliefs. Rodney assesses the risk of everything he does and takes precautionary measures to reduce the risk of accident, injury, illness and any other negative issue of which he may think. He is thus also a hypochondriac. The first problem that Rodney has is the sleeping arrangement, first all the germs he thinks are in Eddie's room (the room in which he is first assigned, but later has to move since he is allergic to the goldfish food in the room), and second the narrow couch from which he thinks he may fall off of. After a half sleepless night for the threesome, Rodney doesn't allow Eddie to go to his regular Saturday morning football game for fear of injury. OK'd by Rodney, Norman does allow Eddie to go visit with his friend in the building instead. When it's dinnertime, Eddie is nowhere to be seen. Norman's isn't concerned until Rodney voices his concern. Calling Eddie's friend, Norman learns that Eddie never made it to his intended destination. After calling others, Norman and Rodney, both now worried, decide to go and search for Eddie, but not before a telephone call from Tom who wants to speak to Eddie (Norman doesn't tell Tom that Eddie's missing). Norman and Rodney quickly find Eddie in the building elevator, which is broken - the door stuck ajar and the emergency button not working. Once they open and close the elevator door, the threesome now find they're all stuck in the elevator. Eddie's not worried, Norman only slightly so, but Rodney, afraid of everything, is on the verge of hyperventilating, that is until he finds that he's actually in no harm. This causes a further but more profound revelation that he doesn't need to be afraid of everything in life and that life really is for living, which he hasn't done up to this point. Just then, a savior comes to their rescue: Tom. Tom came home early since he had a premonition that something was wrong. However, finding the threesome in the elevator - Tom just assumed that they were heading off somewhere, the threesome not correcting him - Tom admits his premonition was wrong.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Sammy Davis Jr.",
        "nm": 2035,
        "roles": [
          {
            "char": "Rodney River Jr."
          }
        ]
      }
    ]
  },
  {
    "se": "S03E21",
    "title": "In the Eye of the Beholder",
    "tt": 549800,
    "air_date": "1972-02-16",
    "description": null,
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "William Lanteau",
        "nm": 487140,
        "roles": [
          {
            "char": "Vincent Pryor"
          }
        ]
      },
      {
        "name": "Lou Cutell",
        "nm": 193836,
        "roles": [
          {
            "char": "Samson"
          }
        ]
      },
      {
        "name": "Willie Aames",
        "nm": 714,
        "roles": [
          {
            "char": "Harold O'Brien",
            "ch": 402684
          }
        ]
      },
      {
        "name": "James Cole",
        "nm": 170581,
        "roles": [
          {
            "char": "Ralphie"
          }
        ]
      },
      {
        "name": "Mitchell Sakamoto",
        "nm": 2381431,
        "roles": [
          {
            "char": "Frank Komosori",
            "ch": 402685
          }
        ]
      },
      {
        "name": "Suzanne Taylor",
        "nm": 853220,
        "roles": [
          {
            "char": "Miss Silo",
            "as Sue Taylor": true
          }
        ]
      }
    ]
  },
  {
    "se": "S03E22",
    "title": "Time for a Change",
    "tt": 549830,
    "air_date": "1972-02-23",
    "description": "Partly because Eddie turned his bedroom into a makeshift football field, Tom thinks they may need more space, namely a house. In their search, they come across Irma Handily, a real estate agent eager for a sale. Based on Norman's advice to Tom, Mrs. Handily finds Tom what he thinks is the perfect house: a huge, older country house. Tom and Eddie are both initially excited about the house, but doubts slowly creep into their minds. For Eddie, he will have to leave his friends and his school. In addition, Mrs. Livingston may not be able to go with them because the house is located so far from her own home. And for Tom, the cost of renovations is going to be much higher than what he first anticipated. Although they are still excited about the house, they decide, much to Mrs. Handily's dismay, it is just not right for them at this time and decide to stay put.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "James Komack",
        "nm": 464506,
        "roles": [
          {
            "char": "Norman Tinker",
            "ch": 290510
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Kristina Holland",
        "nm": 390751,
        "roles": [
          {
            "char": "Tina Rickles",
            "ch": 257187
          }
        ]
      },
      {
        "name": "Willie Aames",
        "nm": 714,
        "roles": [
          {
            "char": "Harold O'Brien",
            "ch": 402684
          }
        ]
      },
      {
        "name": "Barbara Cason",
        "nm": 143800,
        "roles": [
          {
            "char": "Irma Handily"
          }
        ]
      },
      {
        "name": "Michael Link",
        "nm": 512875,
        "roles": [
          {
            "char": "Bruce"
          }
        ]
      },
      {
        "name": "Michael Morgan",
        "nm": 604902,
        "roles": [
          {
            "char": "Steve"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E23",
    "title": "We Love Annie",
    "tt": 549834,
    "air_date": "1972-03-01",
    "description": "Tom hires Landon's Listen-In, a telephone answering service for home, their answer lady being Annie Dempsey. She's a Jill of all trades, and once Eddie and Mrs. Livingston simultaneously come down with a cold, Annie offers to sit for Eddie while Tom is at work and Mrs. Livingston recuperating at home. While at the Corbetts, Annie not only looks after Eddie, but she also does her answering service business, sits for another client's dog and cooks dinner for Tom and Eddie, the dinner for which Eddie invites Annie to stay. Annie ends up staying a little longer than expected, as first she passes out from drinking too much wine, then second suspects she is coming down with whatever bug Eddie and Mrs. Livingston have. But Annie has other work to do, namely catering a party, so Kathy and Jeff, two of her colleagues, descend on the Corbetts to find out what needs to be done. Also descending on the Corbetts is Mr. Landon, Annie's boss, who objects to Annie offering too much personalized service. In other words, he thinks Annie and Tom spent the night together. For Tom, this really is a little too much personalized service from Landon's Listen-In. To protect Annie, Tom tells Landon that he wants to a write an article about Annie and the business for the magazine. But he also decides to cancel the service for home as he needs his peace and quiet and privacy back.",
    "cast": [
      {
        "name": "Bill Bixby",
        "nm": 84642,
        "roles": [
          {
            "char": "Tom Corbett",
            "ch": 34386
          }
        ]
      },
      {
        "name": "Miyoshi Umeki",
        "nm": 880855,
        "roles": [
          {
            "char": "Mrs. Livingston",
            "ch": 34383
          }
        ]
      },
      {
        "name": "Brandon Cruz",
        "nm": 190261,
        "roles": [
          {
            "char": "Eddie Corbett",
            "ch": 34387
          }
        ]
      },
      {
        "name": "Anne Meara",
        "nm": 575198,
        "roles": [
          {
            "char": "Annie Dempsey"
          }
        ]
      },
      {
        "name": "Jerry Stiller",
        "nm": 5467,
        "roles": [
          {
            "char": "Mr. Landon"
          }
        ]
      },
      {
        "name": "Yvonne Wilder",
        "nm": 928648,
        "roles": [
          {
            "char": "Kathy"
          }
        ]
      },
      {
        "name": "John Breckfield",
        "nm": 968746,
        "roles": [
          {
            "char": "Jeff",
            "as Jon Breakfield": true
          }
        ]
      }
    ]
  }
]
