[
  {
    "se": "S01E00",
    "title": "The Lodgers",
    "tt": 1052999,
    "air_date": "1974-09-02",
    "description": "Landlord Rigsby shares his crumbling home with his cat Vienna and his two lodgers, amiable, shambling young medical student Alan and Miss Ruth Jones, welfare officer at Alan's college and the object of Rigsby's affection. When Ruth asks Rigsby to give her friend Philip a room, Rigsby is only too happy to please her though he is surprised to find that Philip, another student, is black and sees him - wrongly - as a rival for Ruth, who is actually pursuing Philip in vain. Consequently he tries to get rid of him but changes his mind after being told that Philip is an African prince - and not wanting to refund his deposit.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E01",
    "title": "Black Magic",
    "tt": 813094,
    "air_date": "1974-12-13",
    "description": "Alan teases Rigsby by telling him that Philip has ten wives and can work black magic. Put to the test by Rigsby, Philip bangs a tribal spear on the floor in ritualistic fashion, which results in Ruth, believing it to be a sign that Philip wants her body, running into the room in her nightie. Soon afterwards Rigsby falls down on the stairs - another apparent result of magic. Alan also bangs the spear on the floor and again Ruth comes in but when Rigsby tries it there are answering knocks, courtesy of Philip and Alan, who are hiding, and are amused by Rigsby's reaction of panic before they reveal themselves.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E02",
    "title": "A Night Out",
    "tt": 686973,
    "air_date": "1974-12-20",
    "description": "It is Ruth's birthday and Rigsby plans to take her to up-market restaurant the Grange. When Alan and Philip tell him his dapper clothes are old-fashioned he borrows a tuxedo from another lodger Spooner, a violent wrestler, without asking his permission. At the Grange Rigsby expects Philip will have trouble getting in but in fact Philip has to vouch for Rigsby, whose efforts to woo Ruth go awry when he stamps on her false eye-lash, mistaking it for a spider. As the band strikes up a waltz Rigsby prepares to dazzle Ruth with his fancy foot-work but is prevented by the appearance of Spooner, who tussles with Rigsby to get his tuxedo back and rips the sleeve off. They are ejected and, as Philip takes Ruth home, Rigsby and Alan end up with a bag of chips from the take-away.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Derek Newark",
        "nm": 627610,
        "roles": [
          {
            "char": "Spooner",
            "ch": 109170
          }
        ]
      },
      {
        "name": "Frank Gatliff",
        "nm": 309698,
        "roles": [
          {
            "char": "Manager"
          }
        ]
      },
      {
        "name": "Felix Bowness",
        "nm": 101437,
        "roles": [
          {
            "char": "Waiter",
            "uncredited": true
          }
        ]
      }
    ]
  },
  {
    "se": "S01E03",
    "title": "Charisma",
    "tt": 686975,
    "air_date": "1974-12-27",
    "description": "Rigsby tries to woo Ruth with two free tickets to a wrestling match given him by Spooner but she is not keen so he turns to Alan and Philip for advice on how to capture her heart. They suggest he adopts a sophisticated persona, wear a medallion and play a romantic record. They also give him some tablets to relax him but he takes too many and falls asleep before he can declare himself to Ruth. As a second plan Philip tells him of an African love rite whereby the suitor burns a piece of wood from the 'love tree' outside his sweetheart's hut. Rigsby approaches Ruth with a smouldering piece of wood - actually part of a wardrobe - but her response is to dowse it - and Rigsby - with a soda syphon.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Liz Edmiston",
        "nm": 249454,
        "roles": [
          {
            "char": "Maureen"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E04",
    "title": "All Our Yesterdays",
    "tt": 686974,
    "air_date": "1975-01-03",
    "description": "Spooner the wrestler has tripped over Rigsby's cat Vienna and is confined to his room with a broken leg. He plays his radio at full volume, annoying the other tenants and threatens Rigsby when he tells him to turn the noise down. Suddenly in nostalgic mood Rigsby gets his souvenirs from his service days in World War Two to show Philip and Alan, including his revolver, which goes off. Spooner pretends that Rigsby has killed him with it and plays dead, to have a joke at the landlord's expense. However it turns out that the bullet has actually killed Spooner's pet goldfish so Rigsby asks if he can have it for the cat.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Derek Newark",
        "nm": 627610,
        "roles": [
          {
            "char": "Spooner",
            "ch": 109170
          }
        ]
      }
    ]
  },
  {
    "se": "S01E05",
    "title": "The Prowler",
    "tt": 686994,
    "air_date": "1975-01-10",
    "description": "Whilst calling the cat in, Rigsby hears Ruth scream. She has seen a prowler staring at her through the window. A policeman called Baker is soon on the scene and interviews the household, telling Rigsby to check that the money he keeps hidden under the floor-boards is still there, which Rigsby does, in Baker's presence. Only after Baker has gone and the real police arrive, does Rigsby discover that Baker was an impostor, who has stolen his money.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "George Sewell",
        "nm": 786577,
        "roles": [
          {
            "char": "Baker"
          }
        ]
      },
      {
        "name": "Michael Stainton",
        "nm": 821596,
        "roles": [
          {
            "char": "Policeman"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E06",
    "title": "Stand Up and Be Counted",
    "tt": 686987,
    "air_date": "1975-01-17",
    "description": "It's election time and true blue Rigsby will be voting Conservative whilst the boys are flying the flag for Labour. Ruth is a floating voter. All three candidates visit the house, Rigsby antagonizing the Labour man by suggesting that he is a homosexual with a Filipino house-boy whilst Ruth scares off the Liberal hopeful by making advances at him. Finally the Conservative candidate comes in and, after his dog has fouled the carpet, he tells Rigsby he plans to knock his house down, ultimately recognizing Rigsby as the man who was barred from the Conservative Club Billiards Tournament for cheating. This makes Rigsby's mind up. He will be voting Labour.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Michael Ward",
        "nm": 911734,
        "roles": [
          {
            "char": "Labour Candidate"
          }
        ]
      },
      {
        "name": "Ian Lavender",
        "nm": 491874,
        "roles": [
          {
            "char": "Platt"
          }
        ]
      },
      {
        "name": "Anthony Sharp",
        "nm": 789001,
        "roles": [
          {
            "char": "De Vere-Brown"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E01",
    "title": "The Permissive Society",
    "tt": 686984,
    "air_date": "1975-11-07",
    "description": "Having failed again to get a date with Philip, Ruth is unhappy so Rigsby, to arouse her, blows in her ear but she just thinks there's a draught. Alan and Philip have been on a double date and Philip is annoyed that Alan is so inexperienced with women that they only ended up playing scrabble. Philip lost his virginity on his fourteenth birthday. Alan only got a bike for his. To prove he is not afraid of women Alan enters Ruth's room in his dressing-gown but hides in the wardrobe when Rigsby also goes in and, on discovery, pretends he was sleep-walking. Alan's girl-friend's father comes round to accuse Alan of upsetting his daughter and mistakes Rigsby for the lad's father. Rigsby and Alan see him off but lock the door when he returns with his muscle-bound sons.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "George A. Cooper",
        "nm": 178058,
        "roles": [
          {
            "char": "Cooper",
            "ch": 171009
          }
        ]
      }
    ]
  },
  {
    "se": "S02E02",
    "title": "Food Glorious Food",
    "tt": 813095,
    "air_date": "1975-11-14",
    "description": "Following an argument in which the tenants accuse him of being uncharitable for not wanting to contribute to Ruth's charity tin, Rigsby lectures Philip on the white man's bounties to Africa and explains how he fasted for a week in the desert in the war. Philip then challenges him to fast for forty-eight hours and confiscates his food. Rigsby attempts to cheat by stealing the cat's food and eating an apple from Ruth's room, which turns out to be wax. He gets Alan to put out leftovers for him, but Philip substitutes food that has gone off. Eventually Rigsby wins his bet but the fiver gets put into Ruth's tin after it is discovered that his previous contribution was a button from his cardigan.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E03",
    "title": "A Body Like Mine",
    "tt": 813093,
    "air_date": "1975-11-21",
    "description": "Rigsby is cynical when both Ruth and Alan get into physical fitness regimes but, having failed to open a pickle jar, which Philip does with ease, he is persuaded to take exercise to impress Ruth. This leads to a boxing match with Philip, Ruth promising to date the winner. Not being keen on this idea Philip throws the fight but Rigsby does his back in before he can take Ruth out so she whisks Philip away in his place.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E04",
    "title": "Moonlight and Roses",
    "tt": 686983,
    "air_date": "1975-11-28",
    "description": "Ruth gets engaged to short but romantic Desmond and Rigsby is jealous. The boys suggest he compete by reciting poetry to her but she feels he is mocking her and announces that she will be moving out to live with Desmond. Rigsby tries to put Desmond off by claiming that Ruth is an alcoholic who can get violent but Desmond's love for Ruth means that he can take this in his stride and Ruth leaves the house, having caught Rigsby trying to chat up Brenda, an artists' model and potential new tenant - by quoting the same poetry that he used with her.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Robin Parkinson",
        "nm": 662864,
        "roles": [
          {
            "char": "Desmond"
          }
        ]
      },
      {
        "name": "Gabrielle Rose",
        "nm": 741388,
        "roles": [
          {
            "char": "Brenda",
            "as Gay Rose": true
          }
        ]
      }
    ]
  },
  {
    "se": "S02E05",
    "title": "The Perfect Gentleman",
    "tt": 686993,
    "air_date": "1975-12-05",
    "description": "Alan and Philip do not share the fawning Rigsby's high opinion of the new tenant, suave, ex-Colonial, Seymour, who borrows money from them and owes rent. Seymour appeals to Rigsby's snobbery by promising him golf club membership and tries to turn him against Alan by planting Philip's wallet on him. When Rigsby is also robbed, Philip sets a trap and exposes Seymour as a thief and a con man.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Henry McGee",
        "nm": 569077,
        "roles": [
          {
            "char": "Seymour",
            "ch": 170969
          }
        ]
      }
    ]
  },
  {
    "se": "S02E06",
    "title": "The Last of the Big Spenders",
    "tt": 686992,
    "air_date": "1975-12-12",
    "description": "Whilst Alan and Philip are intrigued when Rigsby brings in a load of expensive new furniture, new lodger Brenda takes it to be a sign of her landlord's wealth and expects him to take her out to dinner. Claiming that Vienna is unwell he suggests a romantic night in instead but this is ruined when bailiffs come to re-possess the furniture which he has not paid for.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Gabrielle Rose",
        "nm": 741388,
        "roles": [
          {
            "char": "Brenda",
            "as Gay Rose": true
          }
        ]
      },
      {
        "name": "Campbell Singer",
        "nm": 801907,
        "roles": [
          {
            "char": "Flint"
          }
        ]
      },
      {
        "name": "Robert Gillespie",
        "nm": 318971,
        "roles": [
          {
            "char": "Gasman"
          }
        ]
      },
      {
        "name": "Ronnie Brody",
        "nm": 110915,
        "roles": [
          {
            "char": "Charlie"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E07",
    "title": "Things That Go Bump in the Night",
    "tt": 686995,
    "air_date": "1975-12-19",
    "description": "After scaring the gullible Alan with a joke werewolf hand, Rigsby tries to spook him even more by telling him about the house ghost, the Grey Lady. Philip persuades Alan to put on a long dress and a bonnet to impersonate the ghost, to scare Rigsby, which he does on several occasions, including at a séance Philip has stage managed. Rigsby then calls in the vicar to exorcise the ghost but the vicar only catches Alan and Brenda kissing on the sofa. By this time Rigsby has found the dress and bonnet so that the Grey Lady makes one final appearance.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Gabrielle Rose",
        "nm": 741388,
        "roles": [
          {
            "char": "Brenda",
            "as Gay Rose": true
          }
        ]
      },
      {
        "name": "Norman Bird",
        "nm": 83424,
        "roles": [
          {
            "char": "Vicar"
          }
        ]
      },
      {
        "name": "David Rowlands",
        "nm": 746760,
        "roles": [
          {
            "char": "Curate"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E08",
    "title": "For the Man Who Has Everything",
    "tt": 686980,
    "air_date": "1975-12-21",
    "description": "Following a lonely Christmas spent with only Vienna as company, Rigsby is visited by the milkman, Fred, wanting his money, and post woman Gwen, who delivers a card - sent by himself - but declines to kiss him under the mistletoe. Alan and Brenda return from spending Christmas with his parents and both, separately, give him bath salts as a present. Philip comes back with a girl-friend Lucy, assuming they would be alone in the house. He tells Rigsby he has a present for him in his room and Rigsby wrongly believes this is Lucy. As she is black he imagines she has just arrived from Africa - rather than Northampton - and tries to teach her the British custom of kissing under the mistletoe. However Philip comes in to do that and gives Rigsby his actual present, a bottle of wine so strong it takes his power of speech away. Gwen and Fred return - she is now prepared to kiss Rigsby under the mistletoe but Fred gets in first!",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Gabrielle Rose",
        "nm": 741388,
        "roles": [
          {
            "char": "Brenda",
            "as Gay Rose": true
          }
        ]
      },
      {
        "name": "Larry Martyn",
        "nm": 554419,
        "roles": [
          {
            "char": "Fred"
          }
        ]
      },
      {
        "name": "Elizabeth Adare",
        "nm": 11572,
        "roles": [
          {
            "char": "Lucy"
          }
        ]
      },
      {
        "name": "Helen Fraser",
        "nm": 292136,
        "roles": [
          {
            "char": "Gwen"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E01",
    "title": "That's My Boy",
    "tt": 686989,
    "air_date": "1977-04-12",
    "description": "Whilst Rigsby is on holiday in Spain, Alan lets a room to Mrs. Brent, whose husband is at sea, and her baby, despite the fact that Rigsby does not allow tenants with children. So, whilst Mrs. Brent looks for other accommodation, Alan tries to hide the baby but is discovered by Rigsby, who initially thinks the baby is Alan's. Ruth has returned and Alan and Philip give her the baby to mind, leading Rigsby to then think that Ruth is his mother, so he is shocked when she says she hardly knows the father and does not know the baby's name. Both Mr. and Mrs. Brent then return and Ruth, knowing Rigsby will do anything for her, tells them that he loves babies and that they can stay.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Ann Beach",
        "nm": 63442,
        "roles": [
          {
            "char": "Mrs. Brent"
          }
        ]
      },
      {
        "name": "David Daker",
        "nm": 197470,
        "roles": [
          {
            "char": "Mr. Brent"
          }
        ]
      },
      {
        "name": "Daphne Oxenford",
        "nm": 654559,
        "roles": [
          {
            "char": "Announcer"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E02",
    "title": "Stage Struck",
    "tt": 686986,
    "air_date": "1977-04-19",
    "description": "A very camp actor called Hilary moves into the house. He has written a play which he wants Ruth and Alan to perform. Rigsby is less than pleased to think that this will allow the long-haired student to share intimate moments with his beloved Miss Jones, so he appeals to Alan's homophobia and tells him that Hilary is gay, scaring Alan off which leads to Hilary asking Rigsby to replace him. Aware of what has gone on Hilary sits very near to Rigsby on the sofa and appears to make a pass at him, scaring Rigsby off from appearing in the play. however, when Hilary assumes the lead it is clear from his behaviour with Ruth that he is definitely not gay.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Peter Bowles",
        "nm": 101248,
        "roles": [
          {
            "char": "Hilary"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E03",
    "title": "Clunk Click",
    "tt": 686976,
    "air_date": "1977-04-26",
    "description": "Rigsby invests in a white sports car to impress Ruth and takes her to the country club in it. On their return the car is severely dented and carrying part of another car with it. When Rigsby learns that the other driver, Mr. French, is a magistrate and will be calling at the house in the evening, he panics and tells Alan he can have the car. Mr. French duly arrives and, on learning that Alan owns the car, gives him ten pounds as it was actually Mr. French who caused the damage.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Derek Francis",
        "nm": 290136,
        "roles": [
          {
            "char": "Mr. French"
          }
        ]
      },
      {
        "name": "James Bree",
        "nm": 106657,
        "roles": [
          {
            "char": "Peppery Man"
          }
        ]
      },
      {
        "name": "Judy Buxton",
        "nm": 125528,
        "roles": [
          {
            "char": "Caroline"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E04",
    "title": "The Good Samaritans",
    "tt": 686991,
    "air_date": "1977-05-03",
    "description": "The household goes on suicide watch when a new tenant, the depressive Mr. Gray, who has lost his wife and his business, becomes Rigsby's latest tenant. Ruth switches tea-cups with him when she sees him drop a tablet in his but it is only saccharin. Mr. Gray's behaviour leads Rigsby to get a man from the Samaritans to visit. Firstly he thinks Ruth is the depressive when he sees her with her head in the gas oven - which she is trying to fix. Later Mr. Gray climbs on the roof and Rigsby, to impress Ruth, goes up to talk him down. The Samaritan then assumes he is the suicide and, whilst Mr. Gray does come down, Rigsby falls off and has to go to hospital.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "David Swift",
        "nm": 842581,
        "roles": [
          {
            "char": "Gray"
          }
        ]
      },
      {
        "name": "John Clive",
        "nm": 166979,
        "roles": [
          {
            "char": "Samaritan"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E05",
    "title": "Fawcett's Python",
    "tt": 686978,
    "air_date": "1977-05-10",
    "description": "Exotic dancer Marilyn moves into the house with Charlie, a python that she uses in her routine. Although Charlie is harmless Philip persuades Rigsby that he is a Fawcett's python, one of the deadliest in the world. Of course he escapes and the boys scare Rigsby with a stuffed toy python. When Douglas the curate comes round for his singing practice with Ruth, Rigsby decides to play a joke on them with the toy python but of course he ends up handling Charlie.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Andonia Katsaros",
        "nm": 441494,
        "roles": [
          {
            "char": "Marilyn"
          }
        ]
      },
      {
        "name": "Jonathan Elsom",
        "nm": 255696,
        "roles": [
          {
            "char": "Douglas"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E06",
    "title": "The Cocktail Hour",
    "tt": 686990,
    "air_date": "1977-05-17",
    "description": "Alan is dating the upper class Caroline Armitage and, when Ruth says that Caroline's mother is a wealthy property owner, Rigsby is keen that Alan gets engaged to her so that he can benefit by it. He gives the lad lessons in etiquette in anticipation of a tea party for Mrs Armitage but is angry to find he has not been invited. When he crashes the party he discovers that Mrs. Armitage is the former Mabel Bagworthy, a common rag-and-bone man's daughter that he was at school with, who rode to school on her father's cart, and he takes great delight in telling everyone. Needless to say,the engagement is off.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Judy Buxton",
        "nm": 125528,
        "roles": [
          {
            "char": "Caroline"
          }
        ]
      },
      {
        "name": "Diana King",
        "nm": 454655,
        "roles": [
          {
            "char": "Mrs Armitage"
          }
        ]
      }
    ]
  },
  {
    "se": "S03E07",
    "title": "Suddenly at Home",
    "tt": 686988,
    "air_date": "1977-05-24",
    "description": "Rigsby's lodger Osborne is a pill-popping hypochondriac but, to Rigsby's annoyance, Ruth feels sorry for and spends time with him. One day Rigsby goes into Osborne's room to find his lifeless body and so arrangements are to be made for a funeral, Rigsby providing the coffin he had bought for himself. For a joke the boys dare him to get in the coffin and shut him in. When he gets out he sees Osborne alive and well - he had merely seemed dead due to his excess of pill-taking. Rigsby promptly collapses.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Richard Beckinsale",
        "nm": 65764,
        "roles": [
          {
            "char": "Alan"
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth",
            "as Frances De La Tour": true
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Roger Brierley",
        "nm": 108926,
        "roles": [
          {
            "char": "Osborne"
          }
        ]
      }
    ]
  },
  {
    "se": "S04E01",
    "title": "Hello Young Lovers",
    "tt": 686982,
    "air_date": "1978-04-04",
    "description": "Lorna and Robin are a young couple who come to stay and Ruth tells Rigsby they are newly-weds. He gives them presents but withdraws them when he finds out they are just living together. They explain that Lorna's stern father disapprove of Robin so - in the absence of Alan - Ruth and Philip ask the father round to discuss things. Due to a misunderstanding he is horrified to think that Rigsby might be his daughter's boyfriend and goes for him, switching his anger to Philip who comes in to rescue Rigsby. Rigsby explains that Philip would not want Lorna as he already has ten wives and the father is so grateful Lorna's beloved is neither Rigsby nor Philip that he accepts Robin.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Deborah Watling",
        "nm": 914449,
        "roles": [
          {
            "char": "Lorna"
          }
        ]
      },
      {
        "name": "Alun Lewis",
        "nm": 506912,
        "roles": [
          {
            "char": "Robin"
          }
        ]
      },
      {
        "name": "Robert Dorning",
        "nm": 233923,
        "roles": [
          {
            "char": "Father"
          }
        ]
      }
    ]
  },
  {
    "se": "S04E02",
    "title": "Fire and Brimstone",
    "tt": 686979,
    "air_date": "1978-04-11",
    "description": "Gwyn, a fundamentalist Welsh preacher who abstains from everything and spends much of his time praying or hymn-singing, moves in. He talks Ruth out of going on a dirty weekend with Rigsby because it would be immoral and has some success in converting Rigsby to the faith. However, when Ruth gets excited as he explains to her a passionate extract from the bible and throws herself at him, he moves out.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "John Clive",
        "nm": 166979,
        "roles": [
          {
            "char": "Gwyn"
          }
        ]
      }
    ]
  },
  {
    "se": "S04E03",
    "title": "Great Expectations",
    "tt": 686981,
    "air_date": "1978-04-18",
    "description": "A solicitor comes to tell Rigsby that an uncle has left him fifty thousand pounds - on condition he can prove he is married. Since Rigsby parted from his actual wife Veronica years ago and she moved away, he persuades Ruth to pose as his 'wife' when the uncle's widow, Aunt Maud, comes to check on his marital status. To confuse matters the real Veronica also shows up but, since he does have a wife, he is allowed to inherit the money. Unfortunately it is all eaten up by his uncle's unpaid taxes.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Avis Bunnage",
        "nm": 120517,
        "roles": [
          {
            "char": "Veronica"
          }
        ]
      },
      {
        "name": "Andrew Sachs",
        "nm": 755133,
        "roles": [
          {
            "char": "Snell"
          }
        ]
      },
      {
        "name": "Gretchen Franklin",
        "nm": 291434,
        "roles": [
          {
            "char": "Aunt Maud"
          }
        ]
      }
    ]
  },
  {
    "se": "S04E04",
    "title": "Pink Carnations",
    "tt": 686985,
    "air_date": "1978-04-25",
    "description": "By coincidence Rigsby and Ruth answer the personal ad each has placed in the local paper and meet at the same hotel, both wearing pink carnations for identification purposes. Then a bridal party arrives for a reception and, as both bride and groom are also sporting a pink carnation, this leads to confusion as both get mistaken for the blind date. When the bride's mother comes to sort things out Rigsby is horrified to think that she might be the person he has arranged to meet and insults her before getting thrown out, still unaware that Ruth was his real blind date.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Helen Fraser",
        "nm": 292136,
        "roles": [
          {
            "char": "Bride"
          }
        ]
      },
      {
        "name": "John Quayle",
        "nm": 703038,
        "roles": [
          {
            "char": "Groom"
          }
        ]
      },
      {
        "name": "Joan Sanderson",
        "nm": 761796,
        "roles": [
          {
            "char": "Mother"
          }
        ]
      },
      {
        "name": "Roy Barraclough",
        "nm": 56618,
        "roles": [
          {
            "char": "Barman"
          }
        ]
      }
    ]
  },
  {
    "se": "S04E05",
    "title": "Under the Influence",
    "tt": 686996,
    "air_date": "1978-05-02",
    "description": "New lodger Ambrose claims to be a hypnotist and proves it by mesmerising Rigsby into regressing to his childhood - and undressing - in front of Ruth. To make things up to Rigsby, Ambrose hypnotises him into adopting a smooth persona to woo Ruth but she is not impressed. After Ruth has pretended to be hypnotised and chased after Rigsby for a joke, he decides he will do the same to her but the pretence is unmasked when she sticks a hat-pin in his bottom.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Peter Jeffrey",
        "nm": 420312,
        "roles": [
          {
            "char": "Ambrose"
          }
        ]
      }
    ]
  },
  {
    "se": "S04E06",
    "title": "Come on in the Water's Lovely",
    "tt": 686977,
    "air_date": "1978-05-09",
    "description": "After his divorce from Veronica comes through Rigsby proposes to Ruth - who accepts. His shifty brother Ron turns up to be the best man and Ruth's upper-crust mother initially mistakes him for the groom as he looks very smart. She does not believe that Ruth should marry Rigsby and tries to talk her out of it but seemingly in vain. On the day of the wedding the Rigsby brothers go to the wrong church and by the time they locate the right one the wedding party has gone home. He confesses this to Ruth, who admits that she had cold feet about their wedding and never went to the church in the first place.",
    "cast": [
      {
        "name": "Leonard Rossiter",
        "nm": 744436,
        "roles": [
          {
            "char": "Rigsby",
            "ch": 29156
          }
        ]
      },
      {
        "name": "Frances de la Tour",
        "nm": 209428,
        "roles": [
          {
            "char": "Ruth"
          }
        ]
      },
      {
        "name": "Don Warrington",
        "nm": 913116,
        "roles": [
          {
            "char": "Philip"
          }
        ]
      },
      {
        "name": "Brian Peck",
        "nm": 669632,
        "roles": [
          {
            "char": "Ron"
          }
        ]
      },
      {
        "name": "Fanny Rowe",
        "nm": 746509,
        "roles": [
          {
            "char": "Mother"
          }
        ]
      }
    ]
  }
]
