[
  {
    "se": "S01E00",
    "title": "Pilot",
    "tt": 1364562,
    "air_date": "1987-04-11",
    "description": null,
    "cast": [
      {
        "name": "Tom Poston",
        "nm": 692976,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E01",
    "title": "Reagan Parachutes Into D.C. Follies",
    "tt": 1364564,
    "air_date": "1987-09-15",
    "description": "Ronald Reagan parachutes into D.C. Follies to hear Woody Allen's paranoia about becoming a father. Martin Mull has trouble getting a drink while Nixon, Ford, and Carter badger him for campaign contributions. After being hit on the head, Admiral Poindexter miraculously recalls the events of the Iran-Contra affair, and Nixon accompanies Reagan, Oliver North and Poindexter in a D.C. Follies version of the \"Iranscam Rap.\"",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Martin Mull",
        "nm": 611898,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Louise DuArt",
        "nm": 239051,
        "roles": [

        ]
      },
      {
        "name": "John Roarke",
        "nm": 730128,
        "roles": [

        ]
      },
      {
        "name": "Maurice LaMarche",
        "nm": 5606,
        "roles": [

        ]
      }
    ]
  },
  {
    "se": "S01E02",
    "title": "Nixon's Presidential Library Is a Bookmobile",
    "tt": 1364560,
    "air_date": "1987-09-22",
    "description": "Unhappy with low ratings, Dan Rather searches for a new image for the evening news. Mikhail Gorbachev arrives at D.C. Follies in preparation for the summit. It's discovered that Nixon's presidential library is a bookmobile. Fred becomes a celebrity for a few minutes when Robin Leach drops by looking for a guest for \"Lifestyles of the Rich and Famous\" but is pushed aside for Princess Di. Finally, Reagan creates a panic when he mistakes a radio broadcast of \"War of the Worlds\" for the real thing.",
    "cast": [
      {
        "name": "Robin Leach",
        "nm": 494858,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E03",
    "title": "Sean Penn Escapes from Jail and Heads to D.C. Follies",
    "tt": 1364565,
    "air_date": "1987-09-29",
    "description": "Prison escapee Sean Penn comes to DC Follies, where Fred and the rest of gang are preparing for the upcoming annual softball match. Also, President Reagan goes to the hospital for an operation and shares a room with Michael Jackson, Geraldo Rivera hosts his latest expose and Julia Duffy stops by.",
    "cast": [
      {
        "name": "Julia Duffy",
        "nm": 240564,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E04",
    "title": "Ollie North Raises Money with 'Adopt-A-Contra' Scheme",
    "tt": 1364561,
    "air_date": "1987-10-06",
    "description": "Prince Charles comes to DC Follies, where he tries to win back his wife, Princess Diana. Ollie North has a new scam up his sleeves, while Gerald Ford has a new hair-growing remedy and Bob Uecker wants to run for President.",
    "cast": [
      {
        "name": "Bob Uecker",
        "nm": 879902,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E05",
    "title": "Tammy Faye Bakker Debuts Her Latest Song",
    "tt": 1364566,
    "air_date": "1987-10-13",
    "description": "Caught up in the presidential campaign, Fred has a nightmare about zombie politicians. Mr. Rodgers broadcasts his show from Russia and ends up in their prison. Tammy Faye Bakker debuts her latest song and Betty White makes an appearance as a stripper for Jimmy Carter's birthday.",
    "cast": [
      {
        "name": "Betty White",
        "nm": 924508,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E06",
    "title": "Jesse Jackson Sings with Dolly, Barbara and Cher",
    "tt": 1364556,
    "air_date": "1987-10-20",
    "description": "John Madden gives Fred a mechanical bull for the bar. Gerald Ford tries to ride it but gets thrown off head first into the wall, where he remains for the rest of the show. Dolly Parton, Barbara Streisand, and Cher testify at the space hearings. Jesse Jackson performs an uplifting song with Dolly, Barbara, and Cher singing backup. Fred's old flame Vanity shows up and turns the distinguished men of D.C. Follies into Jello. Jimmy Carter resolves a problem with his wife by taking her on a romantic date.",
    "cast": [
      {
        "name": "Vanity",
        "nm": 889152,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E07",
    "title": "George H. W. Bush Schemes to Get Ronald Reagan Out of the White House",
    "tt": 1364555,
    "air_date": "1987-10-27",
    "description": "George Bush brainstorms for ways to get Reagan out of office. He tries to hypnotize the president but it backfires and he turns himself into \"RoboBush.\" Jim and Tammy Bakker plan a movie version of their lives starring Sean Penn and Madonna. The Bakkers also fantasize about what their life would be like in the White House. Charlie Callas stops by to share his secret on how to attract girls. Sylvester Stallone chooses D.C. Follies as a location for his next movie and proceeds to blow up the bar.",
    "cast": [
      {
        "name": "Charlie Callas",
        "nm": 130324,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E08",
    "title": "Nixon Gives Fred Financial Advice... and He Loses His Shirt",
    "tt": 1364558,
    "air_date": "1987-11-03",
    "description": "Fred inherits a large sum of money which he invests on the advice of Richard Nixon. Needless to say, he loses all his money and is in danger of losing the bar. Nixon tries various ways to raise money for Fred, one of which is writing a children's fairy tale book. The regular D.C. Follies patrons band together to help save the bar by recording a song a la \" We Are The World.\" Amidst all the charity events, Robert Klein makes an appearance on \"Nightline\" as spokesman for Jim and Tammy Bakker.",
    "cast": [
      {
        "name": "Robert Klein",
        "nm": 458951,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E09",
    "title": "Nixon Impeached from Cub Scouts",
    "tt": 1364559,
    "air_date": "1987-11-10",
    "description": "While riding in a limousine, Reagan and Gorbachev are harassed by Sam Donaldson. Back at D.C. Follies, Nixon plans a scam for his Cub Scout troupe. He is eventually caught, impeached from the organization and in his shame runs away. Mickey Gilley parks his jet outside and delivers a song written for and about the ex-presidents. George Bush fantasizes about not being a wimp and becomes George Bond. Nixon of course returns with a new scam involving man's best friend and a monkey.",
    "cast": [
      {
        "name": "Mickey Gilley",
        "nm": 319076,
        "roles": [

        ]
      }
    ]
  },
  {
    "se": "S01E10",
    "title": "Nixon Acts as Princess Di's Divorce Lawyer",
    "tt": 1364557,
    "air_date": "1987-11-17",
    "description": "John Madden gives a play-by-play of the events leading up to the summit. Sam Donaldson practices his menacing approach to journalism on the patrons at D.C. Follies. Nixon is angry about being left out of the summit talks, but quickly recovers and comes to the aid of Princess Di as her divorce lawyer which culminates in a festive royal divorce ceremony. Mort Sahl visits the bar and drives a few customers away with his political satire. Reagan and Gorbachev encounter some ups and downs at a secret location for their summit.",
    "cast": [
      {
        "name": "Mort Sahl",
        "nm": 756340,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E11",
    "title": "George H. W. Bush Falls Into a Well",
    "tt": 1364554,
    "air_date": "1987-11-24",
    "description": "Barbara Walters, Sam Donaldson, Ted Kopel and Dan Rather do a song and dance about the news media. Woody Allen reveals that he is not really Woody Allen. George Bush, in an effort to get into the spotlight, falls into a well. Fred finally rescues him, but his moment of glory is over shadowed by Sean Penn and Madonna's reported breakup. Sam Donaldson fantasizes about creating the perfect presidential candidate and turns Fred into a monster. Rich Hall visits D.C. Follies and shares his sniglets with the patrons.",
    "cast": [
      {
        "name": "Rich Hall",
        "nm": 356025,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S01E12",
    "title": "Reagan Accidentally Gives Fred a Nuke for Christmas",
    "tt": 1364563,
    "air_date": "1987-12-01",
    "description": "Santa Claus is confirmed to be real and he makes an appearance at D.C. Follies to hear everyone's Christmas wishes. Reagan attends a meeting of the defense department to learn about a new \"A\" bomb the size of an audio cassette, and then mistakenly gives Fred the cassette as a Christmas present. Gerald Ford then tries to disarm the bomb. The three ex-presidents play three ex-wise men and the D.C. Follies gang does a little caroling to the tune of \"Christmas Day.\"",
    "cast": [
      {
        "name": "Todd Walcott",
        "nm": 3300921,
        "roles": [
          {
            "char": "Santa Claus",
            "ch": 4985
          }
        ]
      }
    ]
  },
  {
    "se": "S01E13",
    "title": "Reagan Tries to Wipe Out National Debt with TV Home Shopping Show",
    "tt": 1818650,
    "air_date": "1987-12-08",
    "description": "It's New Years Eve and everyone is making their resolutions. Fred feels he is becoming a doormat for his customers and resolves to change. Reagan takes to the airwaves on a home shopping show in an attempt to wipe out the national debt. Kissinger, Lee Iacocca and John Madden convince Fred that he has to get an angle so Fred sheds his Mr. Nice Guy image and in turn becomes a media hero. He snaps out of it in time to bail out Sean Penn. Ed Asner stops by for a drink and Reagan mistakes him for Gorbachev.",
    "cast": null
  },
  {
    "se": "S01E14",
    "title": "For Nixon's Birthday, an Opera Based on His Life",
    "tt": 1818642,
    "air_date": "1987-12-15",
    "description": "Its Richard Nixon's birthday and the gang at D.C. Follies give him a roast. Bob Hope, Rodney Dangerfield and all the regulars join in the festivities which include an opera based on Nixon's life. The cab driver, Paul Rodriguez, crashes the party and gets a chance to roast Nixon in lieu of payment.",
    "cast": null
  },
  {
    "se": "S01E15",
    "title": "Astrologer Joyce Jillson Predicts the Future",
    "tt": 1818641,
    "air_date": "1987-12-22",
    "description": "Famous astrologer, Joyce Jillson, sets up shop at D.C. Follies to predict the future. She predicts Jane Fonda will be a very successful bag lady; Gary Hart will again drop out of the race; Reagan will boycott the Olympics; and Nixon will be the next President.",
    "cast": null
  },
  {
    "se": "S01E16",
    "title": "Nixon Dreams of Being a Movie Star with Heather Thomas",
    "tt": 1818648,
    "air_date": "1987-12-29",
    "description": "Lee Iacocca moves his Chrysler plant to outer space to avoid union problems on Earth. Barbara Streisand directs a movie at D.C. Follies starring Whoopi Goldberg. Nixon dreams of being a movie star. He is a detective and Heather Thomas is his client. Gerald Ford begins his law practice with an ironic commercial about personal injury. Sid and Marty Krofft open a newsstand outside the bar.",
    "cast": null
  },
  {
    "se": "S01E17",
    "title": "Super Bowl at the Follies",
    "tt": 1818652,
    "air_date": "1988-01-05",
    "description": "The Redskins vs. the Broncos in the Super Bowl. Dick Butkus is at D.C. Follies to host the pre-game show. He gives Fred and Nixon tickets to the game and the seats happen to be on the Redskin's bench. In the middle of the game there is a major earthquake, but the halftime show still goes on with Bob Hope leading Bruce Springsteen and Sammy Davis in the song \"America is for Americans.\" The game then ends suddenly when the players call a strike. Fred and Nixon return home to have a nightcap with Jimmy the Greek.",
    "cast": null
  },
  {
    "se": "S01E18",
    "title": "George H.W. Bush Engages Don King as His Manager",
    "tt": 1818645,
    "air_date": "1988-01-12",
    "description": "Admiral Koop enlists the help of Sean Penn to campaign against smoking. They catch up with Rodney Dangerfield on an airplane and throw him into the arms of the police. Back at D.C. Follies, George Bush and Robert Dole are fighting like children. In an effort to find another arena to settle their differences, they agree to go on Sam Donaldson's new show \"Political Jeopardy.\" George Bush also engages Don King as his manager to battle it out with Dan Rather. Pat Robertson makes an unusual plea for campaign contributions, and Alan Rachins plays a legal advisor for people who have been assaulted, abused, or arrested by Sean Penn.",
    "cast": null
  },
  {
    "se": "S01E19",
    "title": "Margaret Thatcher Confers with Madonna to Find a New Image",
    "tt": 1818647,
    "air_date": "1988-01-19",
    "description": "The show opens with Donaldson, Kennedy, Iacocca and Koch playing a round of \"Political Jeopardy.\" Back at D.C. Follies, It's Valentine's Day and Fred is pining over his lost love, Princess Di. He flashes back to memories of their relationship culminating in a \"Casablanca\" - type scene where Fred tells Di to marry Charles. Margaret Thatcher confides in Madonna to get help for her new image, which turns out to be a very unusual music video. Fred's faith in love is restored when another old flame, Mary Hart, comes into the bar. The moment is fleeting, however because Mary is really there to be interviewed by Barbara Walters.",
    "cast": null
  },
  {
    "se": "S01E20",
    "title": "Lee Iacocca Becomes Lee Ayatollah and Opens a Chrysler Plant in Iran",
    "tt": 1818646,
    "air_date": "1988-01-26",
    "description": "Lee Iacocca becomes Lee Ayatollah, opens a Chrysler plant in Iran and is bombed by U.S. Tankers. Back at D.C. Follies, Bette Midler graphically describes to Fred the birth of her baby. Then Fred helps Mayor Koch design a campaign slogan. Richard Belzer, thinking of opening a comedy club in Washington, stops by to \"work the room\" and is arrested by Sean Penn. Dan Dierdorf, Al Michaels and Frank Gifford regale us with Olympic Moments. Sam Donaldson has an \"Isn't it True\" seizure and attacks everyone at the bar. Mayor Koch and Whoopi Goldberg discuss the homeless while Jesse Jackson and Pat Robertson discuss giving up their Reverend titles.",
    "cast": null
  },
  {
    "se": "S01E21",
    "title": "Recording Industry Behind Nixon's Resignation, Left Clues in Song Lyrics",
    "tt": 1818651,
    "air_date": "1988-02-02",
    "description": "Rona Barret is on hand at the Grammys to introduce the arriving celebrities, while Whoopi Goldberg presents a Grammy to Barbara Streisand who relentlessly thanks herself. Steve Allen stops by and he and Fred try to crack the secret service's code for the presidential candidates, which consists of old TV show titles. Nixon remembers that the recording industry was behind a conspiracy to get him out of office and that they left clues in lyrics to certain songs. Bette Midler wonders why Sam Donaldson is so uptight and Fred tells her what they were like in the 60's. Fred takes us to \"Woodstock\" where Sam is awakened to the cruel reality of the world. He decides he's the one that must point out the truth.",
    "cast": null
  },
  {
    "se": "S01E22",
    "title": "Ford Begs Nixon to Read a Story from His Bedtime Tales",
    "tt": 1818643,
    "air_date": "1988-02-09",
    "description": "Jimmy the Greek explains to Fred how TV evangelists are different from other people. Sylvester Stallone is worried about losing money if Gorbachev pulls his troop from Afghanistan -- He won't be able to make movies without a war-torn country to shoot in. Kissinger needs a quote for the jacket of his new book. He calls Eddie Murphy, who agrees to have his chauffeur read it. Phyllis Diller drops in to talk about her new role as a cosmetic surgery consultant to the presidential candidates. Ford begs Nixon to read a story from his bedtime tales. He chooses \"The Unbelievable Shrinking Man.\"",
    "cast": null
  },
  {
    "se": "S01E23",
    "title": "Presidential Candidates Selected for Jury Duty",
    "tt": 1818649,
    "air_date": "1988-02-16",
    "description": "Having been campaigning in the south for so long, the presidential candidates find themselves selected for jury duty. In this parody of \"Twelve Angry Men,\" our jury must decide the fate of a jaywalker. Their debate turns into a song and dance about the upside down world of the primaries. Back in Washington...at D.C. Follies Bob Hope tells of his Vietnam nightmares when his U.S.O. show performed there with Jane Fonda. Mr. Rogers explains voting procedures and describes some of the presidential candidates to his audience. John Ratzenberger drops by to swap statistics with Reagan, Meese, and Mayor Koch about current world problems.",
    "cast": null
  },
  {
    "se": "S01E24",
    "title": "George Burns Sends Swaggart to D.C. Follies to Repent His Sins",
    "tt": 1818644,
    "air_date": "1988-02-23",
    "description": "George Burns sends Swaggert to \"D.C. Follies\", to repent for sinning. Waldheim appears through the secret passageway in Fred's office while on a mortal mission to prevent the distortion of Nazi films by a Berlin Film Group. Jessica Hahn's formation of the \"Bimbo\" union attempts to protect \"the other woman.\" Jim and Tammy ease Swaggert's conscience as they sing him into believing that it's okay to sin. Jimmie Walker has to escape through the rear entrance after telling Fred of Jimmie's new Undecided Political Party. Kissinger reveals the truth about what the third world nations think about the U.S. and Soviet relations. Mr. George Burns has narrowed down his decision of who his new partner will be by choosing Tammy Bakker.",
    "cast": null
  },
  {
    "se": "S02E01",
    "title": "Mike Tyson Gives Words of Wisdom to Reagan and Gorbachev for World Peace",
    "tt": 1534947,
    "air_date": "1988-09-15",
    "description": "Reluctant to go to school, Danny Quayle wishes he was \"BIG\" and pals around with George Bush and his running mate. Anticipating a fourth ex-president, Nixon, Ford, and Carter act as bookies for the upcoming election to make some extra cash. When Dukakis is unable to attend his boxing match with George Bush, Mike Tyson, subs in and gets beaten when his promoter, Don King, awakes from a national nightmare of the thought of Dan Quayle becoming President. Tyson offers his words of wisdom to Ron and Gorbi in regard to peace and the superpowers. Fred brings peace to the world of politics by convincing Bush and Dukakis to say nice things to each other.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Don King",
        "nm": 5091,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "Mike Tyson",
        "nm": 5512,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E02",
    "title": "Carter, Nixon and Ford Perform Ex-President Do-Wop Blues",
    "tt": 1534942,
    "air_date": "1988-09-22",
    "description": "The old \"Nixon wit\" helps keep him occupied when he gets locked in the basement with the missing Watergate tapes. Mother Mort's version of \"Jack and Jill\" sheds a new light on children's nursery rhymes. The truth is revealed about Elvis's supposed death when he appears as E.P. the new bar boy at D.C. Follies. Siskel and Ebert give a whopping \"10\" to Greg Louganis's and Ford's tap dancing duet. With the hope of becoming rich and famous, the dynamic trio of Carter, Nixon, and Ford become street performers with their \"Ex-President Doo-Wop Blues.\" Pat Robertson's caption to \"send money\" seems to be a permanent appendage to his wardrobe.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Greg Louganis",
        "nm": 5163,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E03",
    "title": "Ollie North and Nixon Plan to Take Over the Western Hemisphere",
    "tt": 1534954,
    "air_date": "1988-09-29",
    "description": "Bush learns how to charge away the deficit problems after watching Gorbi abuse his Russian Express Card. Nixon tries to market himself as the Shroud of Turin to make money. Fred's lessons to Danny about the branches of government help him to better understand his role in the world of politics. Fred's \"Actors to English Dictionary\" helps Kissinger to understand Cher's Oscar acceptance speech. Reagan scares Bush out of the presidency during a supposed prep talk about the office. Ford goes undercover in Ollie and Nixon's plan to take over the Western Hemisphere. Mort takes on the role of U.S. delegate to the Soviet Union when left unattended near the red phone in the White House.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E04",
    "title": "Freddy Krueger's Nightmare: Dan Quayle Elected President",
    "tt": 1534945,
    "air_date": "1988-10-06",
    "description": "Just when Dukakis thought that his White House career would never become a reality, he lands a job as Bush's chauffeur. During Freddy Krueger's visit to D.C. Follies, he awakes from a nightmare in which Quayle almost became president. Freddy also has a heart to heart talk with Fred about Freddy's concern of being remembered as evil incarnate. Arafat's terrorist mind is faced with a dilemma about finding property to bomb that he doesn't already own. As Ronnie's plans to leave the White House get closer, he once again considers a career as an actor when he reads for the \"Ronnie-mooners.\" Fred's \"Cars to English Dictionary\" saves the day for Bette Midler's car search. Reagan becomes sentimental about leaving office when he decides to run again....this time as Governor of Massachusetts.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Robert Englund",
        "nm": 387,
        "roles": [
          {
            "char": "Freddy Krueger",
            "ch": 2143
          }
        ]
      }
    ]
  },
  {
    "se": "S02E05",
    "title": "Nixon Impersonates Elvis in a Moneymaking Scheme",
    "tt": 1534952,
    "air_date": "1988-10-13",
    "description": "In an attempt to tackle the high national debt left by the Reagan administration, Bush turns to the \"Cozfather\" to ask for a loan. Nixon impersonates Elvis in a conniving scheme to raise money. Fred takes on a teacher role for Danny when he explains the succession of the presidency to him. The Bakkers rescue Nancy from a land of no manicures, as they perform an exorcism on her. Donahue's meaningful dialogue with Barbara from Cincinnati becomes a disaster when her feedback indicates that her husband has returned home early.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E06",
    "title": "Nixon Impersonates Dangerfield, Dolly Parton and Bette Midler",
    "tt": 1534951,
    "air_date": "1988-10-20",
    "description": "Quayle heads to D.C. Follies after trying to play hooky from work. Reagan's failing memory serves as an obstacle when he tries to recount his years in office. Whoopi meets her evil counterpart at the bar. Open Mic Night is a hit with the Great Reaganini, Nancy's premier and Ford's hand shadows. In an attempt to bring glory to Mt. Rushmore, the ex-presidents imagine themselves immortalized on the mountain. Nixon impersonates Dangerfield, Dolly, and Bette Midler.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Whoopi Goldberg",
        "nm": 155,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E07",
    "title": "Reagan Auditions for a Part on 'Dynasty'",
    "tt": 1534956,
    "air_date": "1988-10-27",
    "description": "Much to his surprise, Bush signs a nuclear freeze treaty with the Soviets when Gorbachev pretends to be a talking car device. John Forsythe auditions Reagan for a role in Dynasty only to realize that the part calls for a conniving woman...could Nancy be cast? As Donaldson steps down from the White House, his \"Political Bloopers, Blunders, and Practical Jokes\" takes us back to when Bush and Quayle decide to trick the country by running on the same ticket. The Reagans come close to going to bed with Ford and Nixon when they return home to burglars in the White House. Nixon's plan to auction off his extensive wardrobe of navy suits turns out to be a disappointment for him. Bush suggests Siskel and Ebert as an alternative to the judicial process.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "John Forsythe",
        "nm": 1234,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E08",
    "title": "Fred Plays Chess with Yassir Arafat",
    "tt": 1535159,
    "air_date": "1988-11-03",
    "description": "Nixon's benevolent disposition becomes evident when he decides to give profits from his book to charity. Chess has never been as appetizing as with the new Elvis edition. Mr. Downey's Neighborhood sheds new light on politics. The Supreme Court Shuffle clues us in on what would've happened if Quayle appointed the judges. \"Fred is with us\" when Spielberg and Lucas produce a commercial for D.C. Follies. The \"Glasnost to English Dictionary\" comes in handy when Gorbi comes to the bar. Fred learns that playing chess with Arafat is a no win situation. Crazy Yassir's electronic sale is one you can't refuse.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E09",
    "title": "Castro and Arafat's New Show, 'Terrorists at the Movies' Gives Bambi Two Guns Down",
    "tt": 1534943,
    "air_date": "1988-11-10",
    "description": "Geraldo's evidence from home movies of famous people proves that they were indeed once babies. Quayle's homemade autobiography-picture book attempts to capture \"the real Dan.\" Castro and Arafat give Bambi a two guns down rating on \"Terrorists at the Movies.\" Reagan anxiously awaits the release of his memoirs in order to remember his life. The free world becomes the winner on \"Win, Lose or Die\" when they guess Quayle as their worst nightmare. Ford and Quayle go head to head when Gerry gets a new job with the Department of Transportation. During an exclusive interview with Barbara Walters, Mrs. Reagan and Mrs. Bush reveal their untold, but not necessarily unnoticed differences.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E10",
    "title": "Reagan Gets an Acting Job on eightysomething",
    "tt": 1534957,
    "air_date": "1988-11-17",
    "description": "Mort takes on the role of Professor Higgins as he tries to tame Margaret Thatcher. Ted Kennedy's life as a bachelor is made easy with the \"Singles to English Dictionary.\" Thanks to the sweeps week, a heart transplant lands a spot on Donahue. Bush gets a head start in developing a cleaner America when he starts the Toxic Waste of the Month. Nixon, Cher, and Geraldo ease Quayle's conscience about being teased as they sing him into a thicker skin. Nixon's Aunt Gertrude tries to capitalize on his fake death. In response to the debt left by Reagan, Bush develops the Emergency Taxation System. Bush and Quayle's Bartles and James imitation takes us back to basics...taxes will go up. Reagan's job on eightysomething allows him to act his age. Cher defines the word dizzy when she tries to relive a date.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E11",
    "title": "Nixon Schemes to Make Money by Becoming a Surrogate Mother",
    "tt": 1534953,
    "air_date": "1988-11-24",
    "description": "Dan Quayle takes a joy ride in the presidential limo while Bush is out of town. Mort translates Bush's speech for the average American. Reagan accidentally sells Gorbachev the nuclear football during a yard sale. Quayle takes precautions to insure perfect medical health for Bush to insure that he isn't left with the presidency. Michael Jackson reveals the real \"Bad\" boy that he is as he grows tired of being a wimp. Surrogacy on Donahue sets the scene for Nixon's scheme to make money as a surrogate mother. George Burns and Quayle's new comedy act premiers at D.C. Follies. Nixon's fascination with the wonderful world of steroids becomes the object of his dreams.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E12",
    "title": "The Pope Walks on Water at the Boston Harbor",
    "tt": 1534959,
    "air_date": "1988-12-01",
    "description": "While out on Dingy I, Bush is saved from sharks that are afraid to have Quayle as president. Arafat joins the homeless when we learn that he has no visa. Mort's talk show topic of gene splicing fails to interest callers. The return of Open Mic Night offers the premier of the Dick and Dickey act. The Pope proves that he is a man of God when he displays his ability to walk on the Boston Harbor. Ford's surprise inauguration party cures his feelings of being an outcast. Reagan sings Farewell to 'ole D.C. Cosby saves the day for Cher's first annual telethon. The crowd comes out for Spielberg's open call.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E13",
    "title": "Nixon Hawks the Watergate Tapes for $29.99",
    "tt": 1534950,
    "air_date": "1988-12-08",
    "description": "Gorbi gives King Kong a run for his money with his performance atop the Empire State Building. Harry Anderson's quick wit outsmarts the gang at D.C. Follies. For a mere $29.95, Tricky Rat Nixon's \"educational\" Racketeers tape speaks for itself. Just when Barbara Walters thought there was nobody left to sing with, Arafat saves the day with a love song. After watching Mary Tyler Moore, Quayle is convinced that he should have been a newsman.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Harry Anderson",
        "nm": 26789,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E14",
    "title": "Joan Rivers Debates Gorbi and Thatcher",
    "tt": 1821799,
    "air_date": "1988-12-15",
    "description": "As Chief U.S. Delegate, Joan Rivers displays her sharp tongue with Gorbi and Thatcher. Arafat offers a new outlook on children's toys when he introduces G.I. Joe and Jane. The world of relaxation is in for a big surprise with the new Club Mort. The ex-presidents get stranded while on a fishing trip. Could Burns be put in jail for statutory rape for going to bed with the youngest woman he knows? In honor of his eight years in office, Fred presents Ronnie with a segment of \"This is Your Life.\" Feeling down about the Soviet economy, Gorbi is tricked into a scorching bowl of soup from Mort.",
    "cast": [
      {
        "name": "John Roarke",
        "nm": 730128,
        "roles": [

        ]
      },
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [

        ]
      }
    ]
  },
  {
    "se": "S02E15",
    "title": "Nixon Contemplates a Parallel Universe Without Watergate",
    "tt": 1534946,
    "air_date": "1988-12-22",
    "description": "Thanks to Fred, Leslie Nielsen stops by the bar to tell the story of his big break and picks up gifts from all. In search of a new profession, Ronnie disregards acting because it wouldn't allow him time to nap. Due to his ethical ways, Geraldo takes on the life of a lawyer...but he refuses to represent Ollie and the Bakkers. Nixon confesses that he was responsible for Watergate while contemplating the possibility of a parallel universe. In the absence of Dr. Ruth, Mort subs in to give his tactful \"great sex\" tips. Bob Hope dreams of the great actor that he could've been. Nixon tells Danny the story of Cinderella before he gets a little shut eye. In memory of the concept of a Democrat being president, Ted Kennedy starts an endangered species fund.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "Leslie Nielsen",
        "nm": 558,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      },
      {
        "name": "John Roarke",
        "nm": 730128,
        "roles": [

        ]
      }
    ]
  },
  {
    "se": "S02E16",
    "title": "National Rambo Association Allows Criminally Insane to Possess Guns",
    "tt": 1534948,
    "air_date": "1988-12-29",
    "description": "Khomeni's scheme to kidnap Vice-President Quayle backfires when he finds himself begging the U.S. to take Dan back. Nixon's deep concern for the preservation of mankind causes him a headache when his warm hearted clone, Millhouse, breaks the Nixon stereotype by being generous. Joan Rivers and Mort review the latest movies on their all new puke scale. One might say that Bush and Gorbi have gone a step too far with their disarmament treaty when their trust for one another redefines the open door policy. Elvis's new job with the Post Office is a singing reminder to use zip codes. The National Rambo Association serves as an equal opportunity for the criminally insane to possess guns.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "John Roarke",
        "nm": 730128,
        "roles": [

        ]
      }
    ]
  },
  {
    "se": "S02E17",
    "title": "Nixon Has Romantic Fantasies About Bo Derek",
    "tt": 1534949,
    "air_date": "1989-01-05",
    "description": "Nixon fantasizes a romantic weekend on the Riviera with Bo Derek, when in actuality he robbed her hotel room. Arafat has solved the problem of having to decide where to live by making his car a mobile home. Decorating the White House has been made easy for Barbara Bush since the Reagans took everything...except the ghost of Lincoln. Unable to comprehend the importance of his job, Quayle continues to search for a job. During the first social gathering between the Bushes and Gorbachevs, Mikhail takes a liking to Barbara's \"wholesome\" figure. Whoopi and Geraldo discover the advantages of a video newsstand. Nixon reveals how he inspired the movie \"10.\"",
    "cast": [
      {
        "name": "Bo Derek",
        "nm": 137,
        "roles": [
          {
            "char": "Herself"
          }
        ]
      },
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      }
    ]
  },
  {
    "se": "S02E18",
    "title": "Dolly Parton Gives Makeup Tips to Barbara Bush",
    "tt": 1534944,
    "air_date": "1989-01-12",
    "description": "Ford's plan to go back to school to play football comes to an end when his agent, Nixon, is caught with foul play. Dolly's make-up tips for Barbara Bush cause George's eyes to pop out. Nixon tells Quayle horror stories of how the presidency used to be. Cable finally becomes all that it can be with the creation of the Elvis Channel. International Relations may fall into the hands of God when Quayle appoints the wrong Jim Bakker as Secretary of State. Weird Al drops in to return Fred's accordion so that he can once again sleep at night. Bush turns to Mr. Rogers for a lesson on how to be an educational president. Like everything else, Nixon's concept of three wishes is distorted. Even soup can't ease Charles' and Di's marital problems.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "'Weird Al' Yankovic",
        "nm": 946148,
        "roles": [
          {
            "char": "Himself"
          }
        ]
      }
    ]
  },
  {
    "se": "S02E19",
    "title": "Political Love Connection Profiles Arafat and Joan River's Dream Date",
    "tt": 1534955,
    "air_date": "1989-01-19",
    "description": "While visiting D.C. Follies, Yackov Smirnoff makes amends with Gorbi and they perform a segment from the \"Yaki and Miki Show.\" The ex-presidents reminisce \"how it used to be\" during a chauffeured trip by Fred to see Nixon accept an award. Political Love Connection shares the inside story of Arafat's and Joan River's dream date. Due to budget problems, Bush is forced to inform Barbara that they will not be able to afford her eating habits any longer. The Ayatollah and Yassir land a segment on the TBS...Terrorist Broadcasting System.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "John Roarke",
        "nm": 730128,
        "roles": [

        ]
      },
      {
        "name": "Yakov Smirnoff",
        "nm": 807025,
        "roles": [

        ]
      }
    ]
  },
  {
    "se": "S02E20",
    "title": "The Contras Help Out on Ollie North's Telethon",
    "tt": 1534958,
    "air_date": "1989-01-26",
    "description": "Spielberg is living proof that once a director...always a director when Fred asks him to take a snapshot for him. Hollywood's top names toast Yassir for being the hardest working man in terrorism. Contrary to popular belief, Dan believes he makes a difference after his guardian angel shows him how it would've been without him. Could Ron's venture into a political puppet show confuse him as to whom Nancy really is? As a thanks for defending the Iranian Way, the contras help out Ollie's telethon. Nancy and Ron think about what they can get from Bush in exchange for \"the football.\" Yassir contemplates taking Kissinger hostage after Yassir loses on the $50,000 question.",
    "cast": [
      {
        "name": "Fred Willard",
        "nm": 929609,
        "roles": [
          {
            "char": "The Bartender",
            "ch": 250476
          }
        ]
      },
      {
        "name": "John Roarke",
        "nm": 730128,
        "roles": [

        ]
      }
    ]
  }
]
